koshkin-sergey/mbOS/Examples/basic/arch/cortex-m/eval_aducm320/src/include/ADuCM320.h
/****************************************************************************************************//**
 * @file     ADUCM320.h
 *
 * @brief    CMSIS Cortex-M3 Core Peripheral Access Layer Header File for
 *           default ADUCM320 Device Series
 *
 * @version  v1.1
 * @date     Monday September 22 2014 14:22
 *
 *******************************************************************************************************/



/** @addtogroup Analog Devices Inc.
  * @{
  */

/** @addtogroup ADUCM320
  * @{
  */

#ifndef __ADUCM320_H__
#define __ADUCM320_H__

#ifndef __NO_MMR_STRUCTS__
// The new style CMSIS structure definitions for MMRs clash with
// the old style defs. If the old style are required for compilation
// then set __NO_MMR_STRUCTS__ to 0x1
#define __NO_MMR_STRUCTS__ 0x0
#endif

#ifdef __cplusplus
extern "C" {
#endif 


/* -------------------------  Interrupt Number Definition  ------------------------ */

typedef enum {
/* -------------------  Cortex-M3 Processor Exceptions Numbers  ------------------- */
  Reset_IRQn                        = -15,  /*!<   1  Reset Vector, invoked on Power up and warm reset */
  NonMaskableInt_IRQn               = -14,  /*!<   2  Non maskable Interrupt, cannot be stopped or preempted */
  HardFault_IRQn                    = -13,  /*!<   3  Hard Fault, all classes of Fault */
  MemoryManagement_IRQn             = -12,  /*!<   4  Memory Management, MPU mismatch, including Access Violation and No Match */
  BusFault_IRQn                     = -11,  /*!<   5  Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault */
  UsageFault_IRQn                   = -10,  /*!<   6  Usage Fault, i.e. Undef Instruction, Illegal State Transition */
  SVCall_IRQn                       = -5,   /*!<  11  System Service Call via SVC instruction */
  DebugMonitor_IRQn                 = -4,   /*!<  12  Debug Monitor                    */
  PendSV_IRQn                       = -2,   /*!<  14  Pendable request for system service */
  SysTick_IRQn                      = -1,   /*!<  15  System Tick Timer                */
// --------------------------  ADUCM320 Specific Interrupt Numbers  ------------------------------
  WUT_IRQn                          = 0,    /*!<   0  WUT                              */
  EINT0_IRQn                        = 1,    /*!<   1  EINT0                            */
  EINT1_IRQn                        = 2,    /*!<   2  EINT1                            */
  EINT2_IRQn                        = 3,    /*!<   3  EINT2                            */
  EINT3_IRQn                        = 4,    /*!<   4  EINT3                            */
  EINT4_IRQn                        = 5,    /*!<   5  EINT4                            */
  EINT5_IRQn                        = 6,    /*!<   6  EINT5                            */
  EINT6_IRQn                        = 7,    /*!<   7  EINT6                            */
  EINT7_IRQn                        = 8,    /*!<   8  EINT7                            */
  EINT8_IRQn                        = 9,    /*!<   9  EINT8                            */
  WDT_IRQn                          = 10,   /*!<  10  WDT                              */
  LVD0_IRQn                         = 13,   /*!<  13  LVD0                             */
  MDIO_IRQn                         = 14,   /*!<  14  MDIO                             */
  TIMER0_IRQn                       = 15,   /*!<  15  TIMER0                           */
  TIMER1_IRQn                       = 16,   /*!<  16  TIMER1                           */
  FLASH_IRQn                        = 17,   /*!<  17  FLASH                            */
  UART_IRQn                         = 18,   /*!<  18  UART                             */
  SPI0_IRQn                         = 19,   /*!<  19  SPI0                             */
  SPI1_IRQn                         = 20,   /*!<  20  SPI1                             */
  I2C0S_IRQn                        = 21,   /*!<  21  I2C0S                            */
  I2C0M_IRQn                        = 22,   /*!<  22  I2C0M                            */
  PLA0_IRQn                         = 23,   /*!<  23  PLA0                             */
  PLA1_IRQn                         = 24,   /*!<  24  PLA1                             */
  DMA_ERR_IRQn                      = 25,   /*!<  25  DMA_ERR                          */
  DMA_SPI0_TX_IRQn                  = 26,   /*!<  26  DMA_SPI0_TX                      */
  DMA_SPI0_RX_IRQn                  = 27,   /*!<  27  DMA_SPI0_RX                      */
  DMA_SPI1_TX_IRQn                  = 28,   /*!<  28  DMA_SPI1_TX                      */
  DMA_SPI1_RX_IRQn                  = 29,   /*!<  29  DMA_SPI1_RX                      */
  DMA_UART_TX_IRQn                  = 30,   /*!<  30  DMA_UART_TX                      */
  DMA_UART_RX_IRQn                  = 31,   /*!<  31  DMA_UART_RX                      */
  DMA_I2C0S_TX_IRQn                 = 32,   /*!<  32  DMA_I2C0S_TX                     */
  DMA_I2C0S_RX_IRQn                 = 33,   /*!<  33  DMA_I2C0S_RX                     */
  DMA_I2C0M_IRQn                    = 34,   /*!<  34  DMA_I2C0M                        */
  DMA_I2C1S_TX_IRQn                 = 35,   /*!<  35  DMA_I2C1S_TX                     */
  DMA_I2C1S_RX_IRQn                 = 36,   /*!<  36  DMA_I2C1S_RX                     */
  DMA_I2C1M_IRQn                    = 37,   /*!<  37  DMA_I2C1M                        */
  DMA_ADC_IRQn                      = 38,   /*!<  38  DMA_ADC                          */
  DMA_FLASH_IRQn                    = 39,   /*!<  39  DMA_FLASH                        */
  I2C1S_IRQn                        = 44,   /*!<  44  I2C1S                            */
  I2C1M_IRQn                        = 45,   /*!<  45  I2C1M                            */
  PLA2_IRQn                         = 46,   /*!<  46  PLA2                             */
  PLA3_IRQn                         = 47,   /*!<  47  PLA3                             */
  TIMER2_IRQn                       = 48,   /*!<  48  TIMER2                           */
  LVD1_IRQn                         = 49,   /*!<  49  LVD1                             */
  PWM_TRIP_IRQn                     = 50,   /*!<  50  PWM_TRIP                         */
  PWM_PAIR0_IRQn                    = 51,   /*!<  51  PWM_PAIR0                        */
  PWM_PAIR1_IRQn                    = 52,   /*!<  52  PWM_PAIR1                        */
  PWM_PAIR2_IRQn                    = 53,   /*!<  53  PWM_PAIR2                        */
  PWM_PAIR3_IRQn                    = 54    /*!<  54  PWM_PAIR3                        */
} IRQn_Type;


/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

/* ----------------Configuration of the cm3 Processor and Core Peripherals---------------- */

#define __CM3_REV              0x0200       /*!< Cortex-M3 Core Revision          */
#define __MPU_PRESENT             0         /*!< MPU present or not                    */
#define __NVIC_PRIO_BITS          3         /*!< Number of Bits used for Priority Levels */
#define __Vendor_SysTickConfig    0         /*!< Set to 1 if different SysTick Config is used */
/** @} */ /* End of group Configuration_of_CMSIS */

