koshkin-sergey/mbOS/Examples/basic/arch/cortex-m/eval_aducm320/src/include/ADuCM320.h
#include "core_cm3.h"                       /*!< Cortex-M3 processor and core peripherals */
#include "system_ADUCM320.h"               /*!< ADUCM320 System                      */


/* ================================================================================ */
/* ================       Device Specific Peripheral Section       ================ */
/* ================================================================================ */


/** @addtogroup Device_Peripheral_Registers
  * @{
  */


/* -------------------  Start of section using anonymous unions  ------------------ */
#if defined(__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined(__ICCARM__)
  #pragma language=extended
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning 586
#else
  #warning Not supported compiler type
#endif




/* TLD[LOAD] - Load value */
#define TLD_LOAD_MSK                   (0xFFFF << 0  )

/* TVAL[VAL] - Current count */
#define TVAL_VAL_MSK                   (0xFFFF << 0  )

/* TCON[EVENTEN] - Event select */
#define TCON_EVENTEN_MSK               (0x1   << 12 )
#define TCON_EVENTEN                   (0x1   << 12 )
#define TCON_EVENTEN_DIS               (0x0   << 12 ) /* Events will not be captured */
#define TCON_EVENTEN_EN                (0x1   << 12 ) /* Events will be captured  */

/* TCON[EVENT] - Event select range */
#define TCON_EVENT_MSK                 (0xF   << 8  )

/* TCON[RLD] - Reload control */
#define TCON_RLD_MSK                   (0x1   << 7  )
#define TCON_RLD                       (0x1   << 7  )
#define TCON_RLD_EN                    (0x1   << 7  ) /* Resets the up/down counter when TCLRI[0] is set */
#define TCON_RLD_DIS                   (0x0   << 7  ) /* Up/Down counter is only reset on a timeout event */

/* TCON[CLK] - Clock select */
#define TCON_CLK_MSK                   (0x3   << 5  )
#define TCON_CLK_PCLK                  (0x0   << 5  ) /* PCLK.                    */
#define TCON_CLK_HCLK                  (0x1   << 5  ) /* HCLK.                    */
#define TCON_CLK_LFOSC                 (0x2   << 5  ) /* LFOSC. 32 KHz OSC        */
#define TCON_CLK_HFXTAL                (0x3   << 5  ) /* HFXTAL. 16 MHz OSC or XTAL (Dependent on CLKCON0.11) */

/* TCON[ENABLE] - Timer enable */
#define TCON_ENABLE_MSK                (0x1   << 4  )
#define TCON_ENABLE                    (0x1   << 4  )
#define TCON_ENABLE_DIS                (0x0   << 4  ) /* DIS. Timer is disabled (default) */
#define TCON_ENABLE_EN                 (0x1   << 4  ) /* EN. Timer is enabled     */

/* TCON[MOD] - Timer mode */
#define TCON_MOD_MSK                   (0x1   << 3  )
#define TCON_MOD                       (0x1   << 3  )
#define TCON_MOD_FREERUN               (0x0   << 3  ) /* FREERUN.Timer runs in free running mode */
#define TCON_MOD_PERIODIC              (0x1   << 3  ) /* PERIODIC. Timer runs in periodic mode (default) */

/* TCON[UP] - Count up */
#define TCON_UP_MSK                    (0x1   << 2  )
#define TCON_UP                        (0x1   << 2  )
#define TCON_UP_DIS                    (0x0   << 2  ) /* DIS. Timer is set to count down (default) */
#define TCON_UP_EN                     (0x1   << 2  ) /* EN. Timer is set to count up */

/* TCON[PRE] - Prescaler */
#define TCON_PRE_MSK                   (0x3   << 0  )
#define TCON_PRE_DIV1                  (0x0   << 0  ) /* source_clock / [1 or 4]  */
#define TCON_PRE_DIV16                 (0x1   << 0  ) /* source_clock / 16        */
#define TCON_PRE_DIV256                (0x2   << 0  ) /* source_clock / 256       */
#define TCON_PRE_DIV32768              (0x3   << 0  ) /* source_clock / 32,768    */

/* TCLRI[CAP] - Clear captured event interrupt */
#define TCLRI_CAP_MSK                  (0x1   << 1  )
#define TCLRI_CAP                      (0x1   << 1  )
#define TCLRI_CAP_CLR                  (0x1   << 1  ) /* Clear the capture event interrupt */

/* TCLRI[TMOUT] - Clear timeout interrupt */
#define TCLRI_TMOUT_MSK                (0x1   << 0  )
#define TCLRI_TMOUT                    (0x1   << 0  )
#define TCLRI_TMOUT_CLR                (0x1   << 0  ) /* Clears the timeout interrupt */

/* TCAP[CAP] - 16-bit captured value */
#define TCAP_CAP_MSK                   (0xFFFF << 0  )

/* TSTA[PDOK] - TCLRI synchronization */
#define TSTA_PDOK_MSK                  (0x1   << 7  )
#define TSTA_PDOK                      (0x1   << 7  )
#define TSTA_PDOK_CLR                  (0x0   << 7  ) /* CLR. The interrupt is cleared in the timer clock domain */
#define TSTA_PDOK_SET                  (0x1   << 7  ) /* SET. TCLRI[0] is being updated in the timer clock domain */

/* TSTA[BUSY] - Timer Busy */
#define TSTA_BUSY_MSK                  (0x1   << 6  )
#define TSTA_BUSY                      (0x1   << 6  )
#define TSTA_BUSY_CLR                  (0x0   << 6  ) /* CLR. Timer ready to receive commands to TCON */
#define TSTA_BUSY_SET                  (0x1   << 6  ) /* SET. Timer not ready to receive commands to TCON */

/* TSTA[CAP] - Capture event pending */
#define TSTA_CAP_MSK                   (0x1   << 1  )
#define TSTA_CAP                       (0x1   << 1  )
#define TSTA_CAP_CLR                   (0x0   << 1  ) /* CLR. No capture event is pending */
#define TSTA_CAP_SET                   (0x1   << 1  ) /* SET. A capture event is pending */

/* TSTA[TMOUT] - Timeout event occurred */
#define TSTA_TMOUT_MSK                 (0x1   << 0  )
#define TSTA_TMOUT                     (0x1   << 0  )
#define TSTA_TMOUT_CLR                 (0x0   << 0  ) /* CLR. No timeout event has occurred */
#define TSTA_TMOUT_SET                 (0x1   << 0  ) /* SET. A timeout event has occurred */

/* SPISTA[CSRSG] - Detected a rising edge on CS, in CONT mode */
#define SPISTA_CSRSG_MSK               (0x1   << 14 )
#define SPISTA_CSRSG                   (0x1   << 14 )
#define SPISTA_CSRSG_CLR               (0x0   << 14 ) /* Cleared to 0 when the Status register is read. */
#define SPISTA_CSRSG_SET               (0x1   << 14 ) /* Set to 1 when there was a rising edge in CS line, when the device was in master mode, continuous transfer, High Frequency mode and CSIRQ_EN was asserted. */

