koshkin-sergey/mbOS/Examples/basic/arch/cortex-m/eval_aducm320/src/include/ADuCM320.h
/* I2CMCON[LOOPBACK] - Internal loopback enable */
#define I2CMCON_LOOPBACK_MSK           (0x1   << 2  )
#define I2CMCON_LOOPBACK               (0x1   << 2  )
#define I2CMCON_LOOPBACK_DIS           (0x0   << 2  ) /* SCL and SDA out of the device are not muxed onto their corresponding inputs. */
#define I2CMCON_LOOPBACK_EN            (0x1   << 2  ) /* SCL and SDA out of the device are muxed onto their corresponding inputs. */

/* I2CMCON[COMPETE] - Start back-off disable */
#define I2CMCON_COMPETE_MSK            (0x1   << 1  )
#define I2CMCON_COMPETE                (0x1   << 1  )
#define I2CMCON_COMPETE_DIS            (0x0   << 1  )
#define I2CMCON_COMPETE_EN             (0x1   << 1  )

/* I2CMCON[MASEN] - Master enable */
#define I2CMCON_MASEN_MSK              (0x1   << 0  )
#define I2CMCON_MASEN                  (0x1   << 0  )
#define I2CMCON_MASEN_DIS              (0x0   << 0  ) /* Master is disabled       */
#define I2CMCON_MASEN_EN               (0x1   << 0  ) /* Master is enabled        */

/* I2CMSTA[SCL_FILTERED] - State of SCL Line */
#define I2CMSTA_SCL_FILTERED_MSK       (0x1   << 14 )
#define I2CMSTA_SCL_FILTERED           (0x1   << 14 )
#define I2CMSTA_SCL_FILTERED_CLR       (0x0   << 14 )
#define I2CMSTA_SCL_FILTERED_SET       (0x1   << 14 )

/* I2CMSTA[SDA_FILTERED] - State of SDA Line */
#define I2CMSTA_SDA_FILTERED_MSK       (0x1   << 13 )
#define I2CMSTA_SDA_FILTERED           (0x1   << 13 )
#define I2CMSTA_SDA_FILTERED_CLR       (0x0   << 13 )
#define I2CMSTA_SDA_FILTERED_SET       (0x1   << 13 )

/* I2CMSTA[MTXUFLOW] - Master Transmit Underflow */
#define I2CMSTA_MTXUFLOW_MSK           (0x1   << 12 )
#define I2CMSTA_MTXUFLOW               (0x1   << 12 )
#define I2CMSTA_MTXUFLOW_CLR           (0x0   << 12 )
#define I2CMSTA_MTXUFLOW_SET           (0x1   << 12 )

/* I2CMSTA[MSTOP] - STOP driven by this I2C Master */
#define I2CMSTA_MSTOP_MSK              (0x1   << 11 )
#define I2CMSTA_MSTOP                  (0x1   << 11 )
#define I2CMSTA_MSTOP_CLR              (0x0   << 11 )
#define I2CMSTA_MSTOP_SET              (0x1   << 11 )

/* I2CMSTA[LINEBUSY] - Line is busy */
#define I2CMSTA_LINEBUSY_MSK           (0x1   << 10 )
#define I2CMSTA_LINEBUSY               (0x1   << 10 )
#define I2CMSTA_LINEBUSY_CLR           (0x0   << 10 )
#define I2CMSTA_LINEBUSY_SET           (0x1   << 10 )

/* I2CMSTA[MRXOF] - Master Receive FIFO overflow */
#define I2CMSTA_MRXOF_MSK              (0x1   << 9  )
#define I2CMSTA_MRXOF                  (0x1   << 9  )
#define I2CMSTA_MRXOF_CLR              (0x0   << 9  )
#define I2CMSTA_MRXOF_SET              (0x1   << 9  )

/* I2CMSTA[TCOMP] - Transaction complete or stop detected */
#define I2CMSTA_TCOMP_MSK              (0x1   << 8  )
#define I2CMSTA_TCOMP                  (0x1   << 8  )
#define I2CMSTA_TCOMP_CLR              (0x0   << 8  )
#define I2CMSTA_TCOMP_SET              (0x1   << 8  )

/* I2CMSTA[NACKDATA] - ACK not received in response to data write */
#define I2CMSTA_NACKDATA_MSK           (0x1   << 7  )
#define I2CMSTA_NACKDATA               (0x1   << 7  )
#define I2CMSTA_NACKDATA_CLR           (0x0   << 7  )
#define I2CMSTA_NACKDATA_SET           (0x1   << 7  )

/* I2CMSTA[MBUSY] - Master busy */
#define I2CMSTA_MBUSY_MSK              (0x1   << 6  )
#define I2CMSTA_MBUSY                  (0x1   << 6  )
#define I2CMSTA_MBUSY_CLR              (0x0   << 6  )
#define I2CMSTA_MBUSY_SET              (0x1   << 6  )

/* I2CMSTA[ALOST] - Arbitration lost */
#define I2CMSTA_ALOST_MSK              (0x1   << 5  )
#define I2CMSTA_ALOST                  (0x1   << 5  )
#define I2CMSTA_ALOST_CLR              (0x0   << 5  )
#define I2CMSTA_ALOST_SET              (0x1   << 5  )

/* I2CMSTA[NACKADDR] - ACK not received in response to an address */
#define I2CMSTA_NACKADDR_MSK           (0x1   << 4  )
#define I2CMSTA_NACKADDR               (0x1   << 4  )
#define I2CMSTA_NACKADDR_CLR           (0x0   << 4  )
#define I2CMSTA_NACKADDR_SET           (0x1   << 4  )

/* I2CMSTA[MRXREQ] - Master Receive request */
#define I2CMSTA_MRXREQ_MSK             (0x1   << 3  )
#define I2CMSTA_MRXREQ                 (0x1   << 3  )
#define I2CMSTA_MRXREQ_CLR             (0x0   << 3  )
#define I2CMSTA_MRXREQ_SET             (0x1   << 3  )

/* I2CMSTA[MTXREQ] - Master Transmit request */
#define I2CMSTA_MTXREQ_MSK             (0x1   << 2  )
#define I2CMSTA_MTXREQ                 (0x1   << 2  )
#define I2CMSTA_MTXREQ_CLR             (0x0   << 2  )
#define I2CMSTA_MTXREQ_SET             (0x1   << 2  )

/* I2CMSTA[MTXFSTA] - Master Transmit FIFO status */
#define I2CMSTA_MTXFSTA_MSK            (0x3   << 0  )

/* I2CMRX[ICMRX] - Master receive register */
#define I2CMRX_ICMRX_MSK               (0xFF  << 0  )

/* I2CMTX[I2CMTX] - Master transmit register */
#define I2CMTX_I2CMTX_MSK              (0xFF  << 0  )

/* I2CMRXCNT[EXTEND] - Extended read */
#define I2CMRXCNT_EXTEND_MSK           (0x1   << 8  )
#define I2CMRXCNT_EXTEND               (0x1   << 8  )
#define I2CMRXCNT_EXTEND_DIS           (0x0   << 8  )
#define I2CMRXCNT_EXTEND_EN            (0x1   << 8  )

/* I2CMRXCNT[COUNT] - Receive count */
#define I2CMRXCNT_COUNT_MSK            (0xFF  << 0  )

/* I2CMCRXCNT[COUNT] - Current receive count */
#define I2CMCRXCNT_COUNT_MSK           (0xFF  << 0  )

/* I2CADR0[ADR0] - Address byte 0 */
#define I2CADR0_ADR0_MSK               (0xFF  << 0  )

/* I2CADR1[ADR1] - Address byte 1 */
#define I2CADR1_ADR1_MSK               (0xFF  << 0  )

/* I2CDIV[HIGH] - Serial clock high time */
#define I2CDIV_HIGH_MSK                (0xFF  << 8  )

/* I2CDIV[LOW] - Serial clock low time */
#define I2CDIV_LOW_MSK                 (0xFF  << 0  )

/* I2CSCON[STXDMA] - Enable slave Tx DMA request */
#define I2CSCON_STXDMA_MSK             (0x1   << 14 )
#define I2CSCON_STXDMA                 (0x1   << 14 )
#define I2CSCON_STXDMA_DIS             (0x0   << 14 )
#define I2CSCON_STXDMA_EN              (0x1   << 14 )

/* I2CSCON[SRXDMA] - Enable slave Rx DMA request */
#define I2CSCON_SRXDMA_MSK             (0x1   << 13 )
#define I2CSCON_SRXDMA                 (0x1   << 13 )
#define I2CSCON_SRXDMA_DIS             (0x0   << 13 )
#define I2CSCON_SRXDMA_EN              (0x1   << 13 )

/* I2CSCON[IENREPST] - Repeated start interrupt enable */
#define I2CSCON_IENREPST_MSK           (0x1   << 12 )
#define I2CSCON_IENREPST               (0x1   << 12 )
#define I2CSCON_IENREPST_DIS           (0x0   << 12 )
#define I2CSCON_IENREPST_EN            (0x1   << 12 )

/* I2CSCON[SXMITDEC] - Decrement Slave Tx FIFO status when a byte has been transmitted */
#define I2CSCON_SXMITDEC_MSK           (0x1   << 11 )
#define I2CSCON_SXMITDEC               (0x1   << 11 )
#define I2CSCON_SXMITDEC_DIS           (0x0   << 11 )
#define I2CSCON_SXMITDEC_EN            (0x1   << 11 )

/* I2CSCON[IENSTX] - Slave Transmit request interrupt enable */
#define I2CSCON_IENSTX_MSK             (0x1   << 10 )
#define I2CSCON_IENSTX                 (0x1   << 10 )
#define I2CSCON_IENSTX_DIS             (0x0   << 10 )
#define I2CSCON_IENSTX_EN              (0x1   << 10 )

/* I2CSCON[IENSRX] - Slave Receive request interrupt enable */
#define I2CSCON_IENSRX_MSK             (0x1   << 9  )
#define I2CSCON_IENSRX                 (0x1   << 9  )
#define I2CSCON_IENSRX_DIS             (0x0   << 9  )
#define I2CSCON_IENSRX_EN              (0x1   << 9  )

/* I2CSCON[IENSTOP] - Stop condition detected interrupt enable */
#define I2CSCON_IENSTOP_MSK            (0x1   << 8  )
#define I2CSCON_IENSTOP                (0x1   << 8  )
#define I2CSCON_IENSTOP_DIS            (0x0   << 8  )
#define I2CSCON_IENSTOP_EN             (0x1   << 8  )

/* I2CSCON[NACK] - NACK next communication */
#define I2CSCON_NACK_MSK               (0x1   << 7  )
#define I2CSCON_NACK                   (0x1   << 7  )
#define I2CSCON_NACK_DIS               (0x0   << 7  )
#define I2CSCON_NACK_EN                (0x1   << 7  )

/* I2CSCON[STRETCHSCL] - Stretch SCL enable */
#define I2CSCON_STRETCHSCL_MSK         (0x1   << 6  )
#define I2CSCON_STRETCHSCL             (0x1   << 6  )
#define I2CSCON_STRETCHSCL_DIS         (0x0   << 6  )
#define I2CSCON_STRETCHSCL_EN          (0x1   << 6  )

/* I2CSCON[EARLYTXR] - Early transmit request mode */
#define I2CSCON_EARLYTXR_MSK           (0x1   << 5  )
#define I2CSCON_EARLYTXR               (0x1   << 5  )
#define I2CSCON_EARLYTXR_DIS           (0x0   << 5  )
#define I2CSCON_EARLYTXR_EN            (0x1   << 5  )

/* I2CSCON[GCSBCLR] - General call status bit clear */
#define I2CSCON_GCSBCLR_MSK            (0x1   << 4  )
#define I2CSCON_GCSBCLR                (0x1   << 4  )
#define I2CSCON_GCSBCLR_DIS            (0x0   << 4  )
#define I2CSCON_GCSBCLR_EN             (0x1   << 4  )

/* I2CSCON[HGCEN] - Hardware general call enable */
#define I2CSCON_HGCEN_MSK              (0x1   << 3  )
#define I2CSCON_HGCEN                  (0x1   << 3  )
#define I2CSCON_HGCEN_DIS              (0x0   << 3  )
#define I2CSCON_HGCEN_EN               (0x1   << 3  )

/* I2CSCON[GCEN] - General call enable */
#define I2CSCON_GCEN_MSK               (0x1   << 2  )
#define I2CSCON_GCEN                   (0x1   << 2  )
#define I2CSCON_GCEN_DIS               (0x0   << 2  )
#define I2CSCON_GCEN_EN                (0x1   << 2  )

/* I2CSCON[ADR10EN] - Enabled 10-bit addressing */
#define I2CSCON_ADR10EN_MSK            (0x1   << 1  )
#define I2CSCON_ADR10EN                (0x1   << 1  )
#define I2CSCON_ADR10EN_DIS            (0x0   << 1  )
#define I2CSCON_ADR10EN_EN             (0x1   << 1  )

/* I2CSCON[SLVEN] - Slave enable */
#define I2CSCON_SLVEN_MSK              (0x1   << 0  )
#define I2CSCON_SLVEN                  (0x1   << 0  )
#define I2CSCON_SLVEN_DIS              (0x0   << 0  )
#define I2CSCON_SLVEN_EN               (0x1   << 0  )

/* I2CSSTA[START] - Start and matching address */
#define I2CSSTA_START_MSK              (0x1   << 14 )
#define I2CSSTA_START                  (0x1   << 14 )
#define I2CSSTA_START_CLR              (0x0   << 14 )
#define I2CSSTA_START_SET              (0x1   << 14 )

/* I2CSSTA[REPSTART] - Repeated start and matching address */
#define I2CSSTA_REPSTART_MSK           (0x1   << 13 )
#define I2CSSTA_REPSTART               (0x1   << 13 )
#define I2CSSTA_REPSTART_CLR           (0x0   << 13 )
#define I2CSSTA_REPSTART_SET           (0x1   << 13 )

/* I2CSSTA[IDMAT] - Device ID matched */
#define I2CSSTA_IDMAT_MSK              (0x3   << 11 )

/* I2CSSTA[STOP] - Stop after start and matching address */
#define I2CSSTA_STOP_MSK               (0x1   << 10 )
#define I2CSSTA_STOP                   (0x1   << 10 )
#define I2CSSTA_STOP_CLR               (0x0   << 10 )
#define I2CSSTA_STOP_SET               (0x1   << 10 )

/* I2CSSTA[GCID] - General ID */
#define I2CSSTA_GCID_MSK               (0x3   << 8  )

/* I2CSSTA[GCINT] - General call interrupt */
#define I2CSSTA_GCINT_MSK              (0x1   << 7  )
#define I2CSSTA_GCINT                  (0x1   << 7  )
#define I2CSSTA_GCINT_CLR              (0x0   << 7  )
#define I2CSSTA_GCINT_SET              (0x1   << 7  )

