koshkin-sergey/mbOS/Examples/basic/arch/cortex-m/eval_aducm320/src/include/ADuCM320.h
/* I2CSSTA[SBUSY] - Slave busy */
#define I2CSSTA_SBUSY_MSK              (0x1   << 6  )
#define I2CSSTA_SBUSY                  (0x1   << 6  )
#define I2CSSTA_SBUSY_CLR              (0x0   << 6  )
#define I2CSSTA_SBUSY_SET              (0x1   << 6  )

/* I2CSSTA[NOACK] - Ack not generated by the slave */
#define I2CSSTA_NOACK_MSK              (0x1   << 5  )
#define I2CSSTA_NOACK                  (0x1   << 5  )
#define I2CSSTA_NOACK_CLR              (0x0   << 5  )
#define I2CSSTA_NOACK_SET              (0x1   << 5  )

/* I2CSSTA[SRXOF] - Slave Receive FIFO overflow */
#define I2CSSTA_SRXOF_MSK              (0x1   << 4  )
#define I2CSSTA_SRXOF                  (0x1   << 4  )
#define I2CSSTA_SRXOF_CLR              (0x0   << 4  )
#define I2CSSTA_SRXOF_SET              (0x1   << 4  )

/* I2CSSTA[SRXREQ] - Slave Receive request */
#define I2CSSTA_SRXREQ_MSK             (0x1   << 3  )
#define I2CSSTA_SRXREQ                 (0x1   << 3  )
#define I2CSSTA_SRXREQ_CLR             (0x0   << 3  )
#define I2CSSTA_SRXREQ_SET             (0x1   << 3  )

/* I2CSSTA[STXREQ] - Slave Transmit request */
#define I2CSSTA_STXREQ_MSK             (0x1   << 2  )
#define I2CSSTA_STXREQ                 (0x1   << 2  )
#define I2CSSTA_STXREQ_CLR             (0x0   << 2  )
#define I2CSSTA_STXREQ_SET             (0x1   << 2  )

/* I2CSSTA[STXUR] - Slave Transmit FIFO underflow */
#define I2CSSTA_STXUR_MSK              (0x1   << 1  )
#define I2CSSTA_STXUR                  (0x1   << 1  )
#define I2CSSTA_STXUR_CLR              (0x0   << 1  )
#define I2CSSTA_STXUR_SET              (0x1   << 1  )

/* I2CSSTA[STXFSEREQ] - Slave Tx FIFO Status or early request */
#define I2CSSTA_STXFSEREQ_MSK          (0x1   << 0  )
#define I2CSSTA_STXFSEREQ              (0x1   << 0  )
#define I2CSSTA_STXFSEREQ_CLR          (0x0   << 0  )
#define I2CSSTA_STXFSEREQ_SET          (0x1   << 0  )

/* I2CSRX[I2CSRX] - Slave receive register */
#define I2CSRX_I2CSRX_MSK              (0xFF  << 0  )

/* I2CSTX[I2CSTX] - Slave transmit register */
#define I2CSTX_I2CSTX_MSK              (0xFF  << 0  )

/* I2CALT[ALT] - Slave Alt */
#define I2CALT_ALT_MSK                 (0xFF  << 0  )

/* I2CID0[ID0] - Slave device ID 0 */
#define I2CID0_ID0_MSK                 (0xFF  << 0  )

/* I2CID1[ID1] - Slave device ID 1 */
#define I2CID1_ID1_MSK                 (0xFF  << 0  )

/* I2CID2[ID2] - Slave device ID 2 */
#define I2CID2_ID2_MSK                 (0xFF  << 0  )

/* I2CID3[ID3] - Slave device ID 3 */
#define I2CID3_ID3_MSK                 (0xFF  << 0  )

/* I2CFSTA[MFLUSH] - Flush the master transmit FIFO */
#define I2CFSTA_MFLUSH_MSK             (0x1   << 9  )
#define I2CFSTA_MFLUSH                 (0x1   << 9  )
#define I2CFSTA_MFLUSH_DIS             (0x0   << 9  ) /* Clearing to 0 has no effect. */
#define I2CFSTA_MFLUSH_EN              (0x1   << 9  ) /* Set to 1 to flush the master transmit FIFO. The master transmit FIFO will have to flushed if arbitration is lost or a slave responds with a NACK. */

/* I2CFSTA[SFLUSH] - Flush the slave transmit FIFO */
#define I2CFSTA_SFLUSH_MSK             (0x1   << 8  )
#define I2CFSTA_SFLUSH                 (0x1   << 8  )
#define I2CFSTA_SFLUSH_DIS             (0x0   << 8  ) /* Clearing to 0 has no effect. */
#define I2CFSTA_SFLUSH_EN              (0x1   << 8  ) /* Set to 1 to flush the slave transmit FIFO. */

/* I2CFSTA[MRXFSTA] - Master receive FIFO status */
#define I2CFSTA_MRXFSTA_MSK            (0x3   << 6  )
#define I2CFSTA_MRXFSTA_EMPTY          (0x0   << 6  ) /* FIFO empty               */
#define I2CFSTA_MRXFSTA_ONEBYTE        (0x1   << 6  ) /* 1 bytes in the FIFO      */
#define I2CFSTA_MRXFSTA_TWOBYTES       (0x2   << 6  ) /* 2 bytes in the FIFO      */

/* I2CFSTA[MTXFSTA] - Master transmit FIFO status */
#define I2CFSTA_MTXFSTA_MSK            (0x3   << 4  )
#define I2CFSTA_MTXFSTA_EMPTY          (0x0   << 4  ) /* FIFO empty               */
#define I2CFSTA_MTXFSTA_ONEBYTE        (0x1   << 4  ) /* 1 bytes in the FIFO      */
#define I2CFSTA_MTXFSTA_TWOBYTES       (0x2   << 4  ) /* 2 bytes in the FIFO      */

/* I2CFSTA[SRXFSTA] - Slave receive FIFO status */
#define I2CFSTA_SRXFSTA_MSK            (0x3   << 2  )
#define I2CFSTA_SRXFSTA_EMPTY          (0x0   << 2  ) /* FIFO empty               */
#define I2CFSTA_SRXFSTA_ONEBYTE        (0x1   << 2  ) /* 1 bytes in the FIFO      */
#define I2CFSTA_SRXFSTA_TWOBYTES       (0x2   << 2  ) /* 2 bytes in the FIFO      */

/* I2CFSTA[STXFSTA] - Slave transmit FIFO status */
#define I2CFSTA_STXFSTA_MSK            (0x3   << 0  )
#define I2CFSTA_STXFSTA_EMPTY          (0x0   << 0  ) /* FIFO empty               */
#define I2CFSTA_STXFSTA_ONEBYTE        (0x1   << 0  ) /* 1 bytes in the FIFO      */
#define I2CFSTA_STXFSTA_TWOBYTES       (0x2   << 0  ) /* 2 bytes in the FIFO      */

/* I2CSHCON[RESET] - Reset START STOP detect circuit */
#define I2CSHCON_RESET_MSK             (0x1   << 0  )
#define I2CSHCON_RESET                 (0x1   << 0  )
#define I2CSHCON_RESET_DIS             (0x0   << 0  )
#define I2CSHCON_RESET_EN              (0x1   << 0  )

/* GPCON[CON7] - p0.7  configuration bits */
#define GPCON_CON7_MSK                 (0x3   << 14 )

/* GPCON[CON6] - p0.6  configuration bits */
#define GPCON_CON6_MSK                 (0x3   << 12 )

/* GPCON[CON5] - p0.5  configuration bits */
#define GPCON_CON5_MSK                 (0x3   << 10 )

/* GPCON[CON4] - p0.4  configuration bits */
#define GPCON_CON4_MSK                 (0x3   << 8  )

/* GPCON[CON3] - p0.3  configuration bits */
#define GPCON_CON3_MSK                 (0x3   << 6  )

/* GPCON[CON2] - p0.2  configuration bits */
#define GPCON_CON2_MSK                 (0x3   << 4  )

/* GPCON[CON1] - p0.1  configuration bits */
#define GPCON_CON1_MSK                 (0x3   << 2  )

/* GPCON[CON0] - p0.0  configuration bits */
#define GPCON_CON0_MSK                 (0x3   << 0  )

/* GPOE[OE7] - Pin output drive enable */
#define GPOE_OE7_MSK                   (0x1   << 7  )
#define GPOE_OE7                       (0x1   << 7  )
#define GPOE_OE7_DIS                   (0x0   << 7  )
#define GPOE_OE7_EN                    (0x1   << 7  )

