koshkin-sergey/mbOS/Examples/basic/arch/cortex-m/eval_aducm320/src/include/ADuCM320.h
/* EI0CFG[IRQ1EN] - External Interrupt 1 Enable bit */
#define EI0CFG_IRQ1EN_BBA              (*(volatile unsigned long *) 0x4204841C)
#define EI0CFG_IRQ1EN_MSK              (0x1   << 7  )
#define EI0CFG_IRQ1EN                  (0x1   << 7  )
#define EI0CFG_IRQ1EN_DIS              (0x0   << 7  ) /* External Interrupt 0 disabled */
#define EI0CFG_IRQ1EN_EN               (0x1   << 7  ) /* External Interrupt 0 enabled */

/* EI0CFG[IRQ1MDE] - External Interrupt 1 Mode registers */
#define EI0CFG_IRQ1MDE_MSK             (0x7   << 4  )
#define EI0CFG_IRQ1MDE_RISE            (0x0   << 4  ) /* Rising edge              */
#define EI0CFG_IRQ1MDE_FALL            (0x1   << 4  ) /* Falling edge             */
#define EI0CFG_IRQ1MDE_RISEORFALL      (0x2   << 4  ) /* Rising or falling edge   */
#define EI0CFG_IRQ1MDE_HIGHLEVEL       (0x3   << 4  ) /* High level               */
#define EI0CFG_IRQ1MDE_LOWLEVEL        (0x4   << 4  ) /* Low level                */

/* EI0CFG[IRQ0EN] - External Interrupt 0 Enable bit */
#define EI0CFG_IRQ0EN_BBA              (*(volatile unsigned long *) 0x4204840C)
#define EI0CFG_IRQ0EN_MSK              (0x1   << 3  )
#define EI0CFG_IRQ0EN                  (0x1   << 3  )
#define EI0CFG_IRQ0EN_DIS              (0x0   << 3  ) /* External Interrupt 0 disabled */
#define EI0CFG_IRQ0EN_EN               (0x1   << 3  ) /* External Interrupt 0 enabled */

/* EI0CFG[IRQ0MDE] - External Interrupt 0 Mode registers */
#define EI0CFG_IRQ0MDE_MSK             (0x7   << 0  )
#define EI0CFG_IRQ0MDE_RISE            (0x0   << 0  ) /* Rising edge              */
#define EI0CFG_IRQ0MDE_FALL            (0x1   << 0  ) /* Falling edge             */
#define EI0CFG_IRQ0MDE_RISEORFALL      (0x2   << 0  ) /* Rising or falling edge   */
#define EI0CFG_IRQ0MDE_HIGHLEVEL       (0x3   << 0  ) /* High level               */
#define EI0CFG_IRQ0MDE_LOWLEVEL        (0x4   << 0  ) /* Low level                */

/* Reset Value for EI1CFG*/
#define EI1CFG_RVAL                    0x0 

/* EI1CFG[IRQ7EN] - External Interrupt 7 enable bit */
#define EI1CFG_IRQ7EN_BBA              (*(volatile unsigned long *) 0x420484BC)
#define EI1CFG_IRQ7EN_MSK              (0x1   << 15 )
#define EI1CFG_IRQ7EN                  (0x1   << 15 )
#define EI1CFG_IRQ7EN_DIS              (0x0   << 15 ) /* External Interrupt 7 disabled */
#define EI1CFG_IRQ7EN_EN               (0x1   << 15 ) /* External Interrupt 7 enabled */

/* EI1CFG[IRQ7MDE] - External Interrupt 7 Mode registers */
#define EI1CFG_IRQ7MDE_MSK             (0x7   << 12 )
#define EI1CFG_IRQ7MDE_RISE            (0x0   << 12 ) /* Rising edge              */
#define EI1CFG_IRQ7MDE_FALL            (0x1   << 12 ) /* Falling edge             */
#define EI1CFG_IRQ7MDE_RISEORFALL      (0x2   << 12 ) /* Rising or falling edge   */
#define EI1CFG_IRQ7MDE_HIGHLEVEL       (0x3   << 12 ) /* High level               */
#define EI1CFG_IRQ7MDE_LOWLEVEL        (0x4   << 12 ) /* Low level                */

/* EI1CFG[IRQ6EN] - External Interrupt 6 Enable bit */
#define EI1CFG_IRQ6EN_BBA              (*(volatile unsigned long *) 0x420484AC)
#define EI1CFG_IRQ6EN_MSK              (0x1   << 11 )
#define EI1CFG_IRQ6EN                  (0x1   << 11 )
#define EI1CFG_IRQ6EN_DIS              (0x0   << 11 ) /* External Interrupt 6 disabled */
#define EI1CFG_IRQ6EN_EN               (0x1   << 11 ) /* External Interrupt 6 enabled */

/* EI1CFG[IRQ6MDE] - External Interrupt 6 Mode registers */
#define EI1CFG_IRQ6MDE_MSK             (0x7   << 8  )
#define EI1CFG_IRQ6MDE_RISE            (0x0   << 8  ) /* Rising edge              */
#define EI1CFG_IRQ6MDE_FALL            (0x1   << 8  ) /* Falling edge             */
#define EI1CFG_IRQ6MDE_RISEORFALL      (0x2   << 8  ) /* Rising or falling edge   */
#define EI1CFG_IRQ6MDE_HIGHLEVEL       (0x3   << 8  ) /* High level               */
#define EI1CFG_IRQ6MDE_LOWLEVEL        (0x4   << 8  ) /* Low level                */

/* EI1CFG[IRQ5EN] - External Interrupt 5 Enable bit */
#define EI1CFG_IRQ5EN_BBA              (*(volatile unsigned long *) 0x4204849C)
#define EI1CFG_IRQ5EN_MSK              (0x1   << 7  )
#define EI1CFG_IRQ5EN                  (0x1   << 7  )
#define EI1CFG_IRQ5EN_DIS              (0x0   << 7  ) /* External Interrupt 5 disabled */
#define EI1CFG_IRQ5EN_EN               (0x1   << 7  ) /* External Interrupt 5 enabled */

/* EI1CFG[IRQ5MDE] - External Interrupt 5 Mode registers */
#define EI1CFG_IRQ5MDE_MSK             (0x7   << 4  )
#define EI1CFG_IRQ5MDE_RISING          (0x0   << 4  ) /* Rising edge              */
#define EI1CFG_IRQ5MDE_FALLING         (0x1   << 4  ) /* Falling edge             */
#define EI1CFG_IRQ5MDE_RISEORFALL      (0x2   << 4  ) /* Rising or falling edge   */
#define EI1CFG_IRQ5MDE_HIGHLEVEL       (0x3   << 4  ) /* High level               */
#define EI1CFG_IRQ5MDE_LOWLEVEL        (0x4   << 4  ) /* Low level                */

/* EI1CFG[IRQ4EN] - External Interrupt 4 Enable bit */
#define EI1CFG_IRQ4EN_BBA              (*(volatile unsigned long *) 0x4204848C)
#define EI1CFG_IRQ4EN_MSK              (0x1   << 3  )
#define EI1CFG_IRQ4EN                  (0x1   << 3  )
#define EI1CFG_IRQ4EN_DIS              (0x0   << 3  ) /* External Interrupt 4 disabled */
#define EI1CFG_IRQ4EN_EN               (0x1   << 3  ) /* External Interrupt 4 enabled */

/* EI1CFG[IRQ4MDE] - External Interrupt 4 Mode registers */
#define EI1CFG_IRQ4MDE_MSK             (0x7   << 0  )
#define EI1CFG_IRQ4MDE_RISE            (0x0   << 0  ) /* Rising edge              */
#define EI1CFG_IRQ4MDE_FALL            (0x1   << 0  ) /* Falling edge             */
#define EI1CFG_IRQ4MDE_RISEORFALL      (0x2   << 0  ) /* Rising or falling edge   */
#define EI1CFG_IRQ4MDE_HIGHLEVEL       (0x3   << 0  ) /* High level               */
#define EI1CFG_IRQ4MDE_LOWLEVEL        (0x4   << 0  ) /* Low level                */

/* Reset Value for EI2CFG*/
#define EI2CFG_RVAL                    0x0 

/* EI2CFG[IRQ8EN] - External Interrupt 8 Enable bit */
#define EI2CFG_IRQ8EN_BBA              (*(volatile unsigned long *) 0x4204850C)
#define EI2CFG_IRQ8EN_MSK              (0x1   << 3  )
#define EI2CFG_IRQ8EN                  (0x1   << 3  )
#define EI2CFG_IRQ8EN_DIS              (0x0   << 3  ) /* External Interrupt 8 disabled */
#define EI2CFG_IRQ8EN_EN               (0x1   << 3  ) /* External Interrupt 8 enabled */

/* EI2CFG[IRQ8MDE] - External Interrupt 8 Mode registers */
#define EI2CFG_IRQ8MDE_MSK             (0x7   << 0  )
#define EI2CFG_IRQ8MDE_RISE            (0x0   << 0  ) /* Rising edge              */
#define EI2CFG_IRQ8MDE_FALL            (0x1   << 0  ) /* Falling edge             */
#define EI2CFG_IRQ8MDE_RISEORFALL      (0x2   << 0  ) /* Rising or falling edge   */
#define EI2CFG_IRQ8MDE_HIGHLEVEL       (0x3   << 0  ) /* High level               */
#define EI2CFG_IRQ8MDE_LOWLEVEL        (0x4   << 0  ) /* Low level                */

/* Reset Value for EICLR*/
#define EICLR_RVAL                     0x0 

/* EICLR[IRQ8] - External interrupt 8 */
#define EICLR_IRQ8_BBA                 (*(volatile unsigned long *) 0x42048620)
#define EICLR_IRQ8_MSK                 (0x1   << 8  )
#define EICLR_IRQ8                     (0x1   << 8  )
#define EICLR_IRQ8_DIS                 (0x0   << 8  )
#define EICLR_IRQ8_EN                  (0x1   << 8  )

