koshkin-sergey/mbOS/Examples/basic/arch/cortex-m/eval_aducm320/src/include/ADuCM320.h
/* T3CON[PMD] - Power Mode Disable */
#define T3CON_PMD_BBA                  (*(volatile unsigned long *) 0x4204B100)
#define T3CON_PMD_MSK                  (0x1   << 0  )
#define T3CON_PMD                      (0x1   << 0  )
#define T3CON_PMD_DIS                  (0x0   << 0  ) /* DIS. The watchdog timer will continue its count down while in hibernate mode. */
#define T3CON_PMD_EN                   (0x1   << 0  ) /* EN. When hibernate mode is entered, the watchdog counter will suspend its count down. As hibernate mode is exited, the count down will resume from its current count value (the count will not be reset). */

/* Reset Value for T3CLRI*/
#define T3CLRI_RVAL                    0x0 

/* T3CLRI[CLRWDG] - Clear watchdog */
#define T3CLRI_CLRWDG_MSK              (0xFFFF << 0  )

/* Reset Value for T3STA*/
#define T3STA_RVAL                     0x0 

/* T3STA[LOCK] - Lock status bit */
#define T3STA_LOCK_BBA                 (*(volatile unsigned long *) 0x4204B310)
#define T3STA_LOCK_MSK                 (0x1   << 4  )
#define T3STA_LOCK                     (0x1   << 4  )
#define T3STA_LOCK_CLR                 (0x0   << 4  )
#define T3STA_LOCK_SET                 (0x1   << 4  )

/* T3STA[CON] - T3CON write sync in progress */
#define T3STA_CON_BBA                  (*(volatile unsigned long *) 0x4204B30C)
#define T3STA_CON_MSK                  (0x1   << 3  )
#define T3STA_CON                      (0x1   << 3  )
#define T3STA_CON_CLR                  (0x0   << 3  ) /* APB and T3 clock domains T3CON configuration values match */
#define T3STA_CON_SET                  (0x1   << 3  ) /* APB T3CON register values are being synchronized to T3 clock domain */

/* T3STA[LD] - T3LD write sync in progress */
#define T3STA_LD_BBA                   (*(volatile unsigned long *) 0x4204B308)
#define T3STA_LD_MSK                   (0x1   << 2  )
#define T3STA_LD                       (0x1   << 2  )
#define T3STA_LD_CLR                   (0x0   << 2  ) /* APB and T3 clock domains T3LD values match */
#define T3STA_LD_SET                   (0x1   << 2  ) /* APB T3LD value is being synchronized to T3 clock domain */

/* T3STA[CLRI] - T3CLRI write sync in progress */
#define T3STA_CLRI_BBA                 (*(volatile unsigned long *) 0x4204B304)
#define T3STA_CLRI_MSK                 (0x1   << 1  )
#define T3STA_CLRI                     (0x1   << 1  )
#define T3STA_CLRI_CLR                 (0x0   << 1  ) /* APB T3CLRI write sync not done/ */
#define T3STA_CLRI_SET                 (0x1   << 1  ) /* APB T3CLRI write is being synced to T3 clock domain. T3 will be restarted (if 0xCCCC was written) once sync is complete */
// ------------------------------------------------------------------------------------------------
// -----                                        wut                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief wut (pADI_WUT)
  */

#if (__NO_MMR_STRUCTS__==0)
typedef struct {                            /*!< pADI_WUT Structure                     */
  __IO uint16_t  T4VAL0;                    /*!< Current count value - LS 16 bits      */
  __I  uint16_t  RESERVED0;
  __IO uint16_t  T4VAL1;                    /*!< Current count value - MS 16 bits      */
  __I  uint16_t  RESERVED1;
  __IO uint16_t  T4CON;                     /*!< Control register                      */
  __I  uint16_t  RESERVED2;
  __IO uint16_t  T4INC;                     /*!< 12-bit interval for wakeup field A    */
  __I  uint16_t  RESERVED3;
  __IO uint16_t  T4WUFB0;                   /*!< Wakeup field B - LS 16 bits           */
  __I  uint16_t  RESERVED4;
  __IO uint16_t  T4WUFB1;                   /*!< Wakeup field B - MS 16 bits           */
  __I  uint16_t  RESERVED5;
  __IO uint16_t  T4WUFC0;                   /*!< Wakeup field C - LS 16 bits           */
  __I  uint16_t  RESERVED6;
  __IO uint16_t  T4WUFC1;                   /*!< Wakeup field C - MS 16 bits           */
  __I  uint16_t  RESERVED7;
  __IO uint16_t  T4WUFD0;                   /*!< Wakeup field D - LS 16 bits           */
  __I  uint16_t  RESERVED8;
  __IO uint16_t  T4WUFD1;                   /*!< Wakeup field D - MS 16 bits           */
  __I  uint16_t  RESERVED9;
  __IO uint16_t  T4IEN;                     /*!< Interrupt enable register             */
  __I  uint16_t  RESERVED10;
  __IO uint16_t  T4STA;                     /*!< Status register                       */
  __I  uint16_t  RESERVED11;
  __IO uint16_t  T4CLRI;                    /*!< Clear interrupt register              */
  __I  uint16_t  RESERVED12[5];
  __IO uint16_t  T4WUFA0;                   /*!< Wakeup field A - LS 16 bits           */
  __I  uint16_t  RESERVED13;
  __IO uint16_t  T4WUFA1;                   /*!< Wakeup field A - MS 16 bits           */
} ADI_WUT_TypeDef;
#else // (__NO_MMR_STRUCTS__==0)
#define          T4VAL0                                     (*(volatile unsigned short int *) 0x40002500)
#define          T4VAL1                                     (*(volatile unsigned short int *) 0x40002504)
#define          T4CON                                      (*(volatile unsigned short int *) 0x40002508)
#define          T4INC                                      (*(volatile unsigned short int *) 0x4000250C)
#define          T4WUFB0                                    (*(volatile unsigned short int *) 0x40002510)
#define          T4WUFB1                                    (*(volatile unsigned short int *) 0x40002514)
#define          T4WUFC0                                    (*(volatile unsigned short int *) 0x40002518)
#define          T4WUFC1                                    (*(volatile unsigned short int *) 0x4000251C)
#define          T4WUFD0                                    (*(volatile unsigned short int *) 0x40002520)
#define          T4WUFD1                                    (*(volatile unsigned short int *) 0x40002524)
#define          T4IEN                                      (*(volatile unsigned short int *) 0x40002528)
#define          T4STA                                      (*(volatile unsigned short int *) 0x4000252C)
#define          T4CLRI                                     (*(volatile unsigned short int *) 0x40002530)
#define          T4WUFA0                                    (*(volatile unsigned short int *) 0x4000253C)
#define          T4WUFA1                                    (*(volatile unsigned short int *) 0x40002540)
#endif // (__NO_MMR_STRUCTS__==0)

