koshkin-sergey/mbOS/Examples/basic/arch/cortex-m/eval_aducm320/src/include/ADuCM320.h
/* Reset Value for T4VAL0*/
#define T4VAL0_RVAL                    0x0 

/* T4VAL0[T4VALL] - Current count Low */
#define T4VAL0_T4VALL_MSK              (0xFFFF << 0  )

/* Reset Value for T4VAL1*/
#define T4VAL1_RVAL                    0x0 

/* T4VAL1[T4VALH] - Current count high */
#define T4VAL1_T4VALH_MSK              (0xFFFF << 0  )

/* Reset Value for T4CON*/
#define T4CON_RVAL                     0x40 

/* T4CON[STOP_WUFA] - Disables updating field A register T4WUFA */
#define T4CON_STOP_WUFA_BBA            (*(volatile unsigned long *) 0x4204A12C)
#define T4CON_STOP_WUFA_MSK            (0x1   << 11 )
#define T4CON_STOP_WUFA                (0x1   << 11 )
#define T4CON_STOP_WUFA_DIS            (0x0   << 11 )
#define T4CON_STOP_WUFA_EN             (0x1   << 11 )

/* T4CON[CLK] - Clock select */
#define T4CON_CLK_MSK                  (0x3   << 9  )
#define T4CON_CLK_PCLK                 (0x0   << 9  ) /* PCLK: PCLK (default)     */
#define T4CON_CLK_LFOSC                (0x1   << 9  ) /* LFOSC: 32 kHz internal oscillator */
#define T4CON_CLK_ECLKIN               (0x3   << 9  ) /* ECLKIN: External clock from P1.0 */

/* T4CON[WUEN] - Wakeup enable */
#define T4CON_WUEN_BBA                 (*(volatile unsigned long *) 0x4204A120)
#define T4CON_WUEN_MSK                 (0x1   << 8  )
#define T4CON_WUEN                     (0x1   << 8  )
#define T4CON_WUEN_DIS                 (0x0   << 8  ) /* DIS: Cleared by user to disable the wake up timer when the core clock is off */
#define T4CON_WUEN_EN                  (0x1   << 8  ) /* EN: Set by user to enable the wake up timer even when the core clock is off. */

/* T4CON[ENABLE] - Timer enable */
#define T4CON_ENABLE_BBA               (*(volatile unsigned long *) 0x4204A11C)
#define T4CON_ENABLE_MSK               (0x1   << 7  )
#define T4CON_ENABLE                   (0x1   << 7  )
#define T4CON_ENABLE_DIS               (0x0   << 7  ) /* DIS: Disable the timer (default). */
#define T4CON_ENABLE_EN                (0x1   << 7  ) /* EN: Enable the timer.    */

/* T4CON[MOD] - Timer mode */
#define T4CON_MOD_BBA                  (*(volatile unsigned long *) 0x4204A118)
#define T4CON_MOD_MSK                  (0x1   << 6  )
#define T4CON_MOD                      (0x1   << 6  )
#define T4CON_MOD_PERIODIC             (0x0   << 6  ) /* PERIODIC: Cleared by user to operate in periodic mode. In this mode, the timer counts up to T4WUFD */
#define T4CON_MOD_FREERUN              (0x1   << 6  ) /* FREERUN: Set by user to operate in free running mode (default). */

/* T4CON[FREEZE] - Freeze enable */
#define T4CON_FREEZE_BBA               (*(volatile unsigned long *) 0x4204A10C)
#define T4CON_FREEZE_MSK               (0x1   << 3  )
#define T4CON_FREEZE                   (0x1   << 3  )
#define T4CON_FREEZE_DIS               (0x0   << 3  ) /* DIS: Cleared by user to disable this feature (default). */
#define T4CON_FREEZE_EN                (0x1   << 3  ) /* EN: Set by user to enable the freeze of the high 16-bits after the lower bits have been read from T4VAL0. This ensures that the software will read an atomic shot of the timer. T4VAL1 unfreezes after it has been read. */

/* T4CON[PRE] - Prescaler */
#define T4CON_PRE_MSK                  (0x3   << 0  )
#define T4CON_PRE_PREDIV1              (0x0   << 0  ) /* PREDIV1: source clock/1 (default). If the selected clock source is PCLK, then this setting results in a prescaler of 4. */
#define T4CON_PRE_PREDIV16             (0x1   << 0  ) /* PREDIV16: source clock/16 */
#define T4CON_PRE_PREDIV256            (0x2   << 0  ) /* PREDIV256: source clock/256 */
#define T4CON_PRE_PREDIV32768          (0x3   << 0  ) /* PREDIV32768: source clock/32,768 */

/* Reset Value for T4INC*/
#define T4INC_RVAL                     0xC8 

/* T4INC[INTERVAL] - Interval for wakeup field A */
#define T4INC_INTERVAL_MSK             (0xFFF << 0  )

/* Reset Value for T4WUFB0*/
#define T4WUFB0_RVAL                   0x1FFF 

/* T4WUFB0[T4WUFBL] - Wakeup field B low */
#define T4WUFB0_T4WUFBL_MSK            (0xFFFF << 0  )

/* Reset Value for T4WUFB1*/
#define T4WUFB1_RVAL                   0x0 

/* T4WUFB1[T4WUFBH] - Wakeup field B High */
#define T4WUFB1_T4WUFBH_MSK            (0xFFFF << 0  )

/* Reset Value for T4WUFC0*/
#define T4WUFC0_RVAL                   0x2FFF 

/* T4WUFC0[T4WUFCL] - Wakeup field C Low */
#define T4WUFC0_T4WUFCL_MSK            (0xFFFF << 0  )

/* Reset Value for T4WUFC1*/
#define T4WUFC1_RVAL                   0x0 

/* T4WUFC1[T4WUFCH] - Wakeup field C High */
#define T4WUFC1_T4WUFCH_MSK            (0xFFFF << 0  )

/* Reset Value for T4WUFD0*/
#define T4WUFD0_RVAL                   0x3FFF 

/* T4WUFD0[T4WUFD0] - Wakeup field D Low */
#define T4WUFD0_T4WUFD0_MSK            (0xFFFF << 0  )

/* Reset Value for T4WUFD1*/
#define T4WUFD1_RVAL                   0x0 

/* T4WUFD1[T4WUFDH] - Wakeup field D high */
#define T4WUFD1_T4WUFDH_MSK            (0xFFFF << 0  )

/* Reset Value for T4IEN*/
#define T4IEN_RVAL                     0x0 

/* T4IEN[ROLL] - Rollover interrupt enable */
#define T4IEN_ROLL_BBA                 (*(volatile unsigned long *) 0x4204A510)
#define T4IEN_ROLL_MSK                 (0x1   << 4  )
#define T4IEN_ROLL                     (0x1   << 4  )
#define T4IEN_ROLL_DIS                 (0x0   << 4  )
#define T4IEN_ROLL_EN                  (0x1   << 4  )

/* T4IEN[WUFD] - T4WUFD interrupt enable */
#define T4IEN_WUFD_BBA                 (*(volatile unsigned long *) 0x4204A50C)
#define T4IEN_WUFD_MSK                 (0x1   << 3  )
#define T4IEN_WUFD                     (0x1   << 3  )
#define T4IEN_WUFD_DIS                 (0x0   << 3  )
#define T4IEN_WUFD_EN                  (0x1   << 3  )

/* T4IEN[WUFC] - T4WUFC interrupt enable */
#define T4IEN_WUFC_BBA                 (*(volatile unsigned long *) 0x4204A508)
#define T4IEN_WUFC_MSK                 (0x1   << 2  )
#define T4IEN_WUFC                     (0x1   << 2  )
#define T4IEN_WUFC_DIS                 (0x0   << 2  )
#define T4IEN_WUFC_EN                  (0x1   << 2  )

/* T4IEN[WUFB] - T4WUFB interrupt enable */
#define T4IEN_WUFB_BBA                 (*(volatile unsigned long *) 0x4204A504)
#define T4IEN_WUFB_MSK                 (0x1   << 1  )
#define T4IEN_WUFB                     (0x1   << 1  )
#define T4IEN_WUFB_DIS                 (0x0   << 1  )
#define T4IEN_WUFB_EN                  (0x1   << 1  )

/* T4IEN[WUFA] - T4WUFA interrupt enable */
#define T4IEN_WUFA_BBA                 (*(volatile unsigned long *) 0x4204A500)
#define T4IEN_WUFA_MSK                 (0x1   << 0  )
#define T4IEN_WUFA                     (0x1   << 0  )
#define T4IEN_WUFA_DIS                 (0x0   << 0  )
#define T4IEN_WUFA_EN                  (0x1   << 0  )

/* Reset Value for T4STA*/
#define T4STA_RVAL                     0x0 

/* T4STA[PDOK] - Enable bit synchronized */
#define T4STA_PDOK_BBA                 (*(volatile unsigned long *) 0x4204A5A0)
#define T4STA_PDOK_MSK                 (0x1   << 8  )
#define T4STA_PDOK                     (0x1   << 8  )
#define T4STA_PDOK_CLR                 (0x0   << 8  )
#define T4STA_PDOK_SET                 (0x1   << 8  )

/* T4STA[FREEZE] - Timer value freeze */
#define T4STA_FREEZE_BBA               (*(volatile unsigned long *) 0x4204A59C)
#define T4STA_FREEZE_MSK               (0x1   << 7  )
#define T4STA_FREEZE                   (0x1   << 7  )
#define T4STA_FREEZE_CLR               (0x0   << 7  )
#define T4STA_FREEZE_SET               (0x1   << 7  )

