koshkin-sergey/mbOS/Examples/basic/arch/cortex-m/eval_aducm320/src/include/ADuCM320.h
/* I2C1MSTA[MTXUFLOW] - Master Transmit Underflow */
#define I2C1MSTA_MTXUFLOW_BBA          (*(volatile unsigned long *) 0x420680B0)
#define I2C1MSTA_MTXUFLOW_MSK          (0x1   << 12 )
#define I2C1MSTA_MTXUFLOW              (0x1   << 12 )
#define I2C1MSTA_MTXUFLOW_CLR          (0x0   << 12 )
#define I2C1MSTA_MTXUFLOW_SET          (0x1   << 12 )

/* I2C1MSTA[MSTOP] - STOP driven by this I2C Master */
#define I2C1MSTA_MSTOP_BBA             (*(volatile unsigned long *) 0x420680AC)
#define I2C1MSTA_MSTOP_MSK             (0x1   << 11 )
#define I2C1MSTA_MSTOP                 (0x1   << 11 )
#define I2C1MSTA_MSTOP_CLR             (0x0   << 11 )
#define I2C1MSTA_MSTOP_SET             (0x1   << 11 )

/* I2C1MSTA[LINEBUSY] - Line is busy */
#define I2C1MSTA_LINEBUSY_BBA          (*(volatile unsigned long *) 0x420680A8)
#define I2C1MSTA_LINEBUSY_MSK          (0x1   << 10 )
#define I2C1MSTA_LINEBUSY              (0x1   << 10 )
#define I2C1MSTA_LINEBUSY_CLR          (0x0   << 10 )
#define I2C1MSTA_LINEBUSY_SET          (0x1   << 10 )

/* I2C1MSTA[MRXOF] - Master Receive FIFO overflow */
#define I2C1MSTA_MRXOF_BBA             (*(volatile unsigned long *) 0x420680A4)
#define I2C1MSTA_MRXOF_MSK             (0x1   << 9  )
#define I2C1MSTA_MRXOF                 (0x1   << 9  )
#define I2C1MSTA_MRXOF_CLR             (0x0   << 9  )
#define I2C1MSTA_MRXOF_SET             (0x1   << 9  )

/* I2C1MSTA[TCOMP] - Transaction complete or stop detected */
#define I2C1MSTA_TCOMP_BBA             (*(volatile unsigned long *) 0x420680A0)
#define I2C1MSTA_TCOMP_MSK             (0x1   << 8  )
#define I2C1MSTA_TCOMP                 (0x1   << 8  )
#define I2C1MSTA_TCOMP_CLR             (0x0   << 8  )
#define I2C1MSTA_TCOMP_SET             (0x1   << 8  )

/* I2C1MSTA[NACKDATA] - ACK not received in response to data write */
#define I2C1MSTA_NACKDATA_BBA          (*(volatile unsigned long *) 0x4206809C)
#define I2C1MSTA_NACKDATA_MSK          (0x1   << 7  )
#define I2C1MSTA_NACKDATA              (0x1   << 7  )
#define I2C1MSTA_NACKDATA_CLR          (0x0   << 7  )
#define I2C1MSTA_NACKDATA_SET          (0x1   << 7  )

/* I2C1MSTA[MBUSY] - Master busy */
#define I2C1MSTA_MBUSY_BBA             (*(volatile unsigned long *) 0x42068098)
#define I2C1MSTA_MBUSY_MSK             (0x1   << 6  )
#define I2C1MSTA_MBUSY                 (0x1   << 6  )
#define I2C1MSTA_MBUSY_CLR             (0x0   << 6  )
#define I2C1MSTA_MBUSY_SET             (0x1   << 6  )

/* I2C1MSTA[ALOST] - Arbitration lost */
#define I2C1MSTA_ALOST_BBA             (*(volatile unsigned long *) 0x42068094)
#define I2C1MSTA_ALOST_MSK             (0x1   << 5  )
#define I2C1MSTA_ALOST                 (0x1   << 5  )
#define I2C1MSTA_ALOST_CLR             (0x0   << 5  )
#define I2C1MSTA_ALOST_SET             (0x1   << 5  )

/* I2C1MSTA[NACKADDR] - ACK not received in response to an address */
#define I2C1MSTA_NACKADDR_BBA          (*(volatile unsigned long *) 0x42068090)
#define I2C1MSTA_NACKADDR_MSK          (0x1   << 4  )
#define I2C1MSTA_NACKADDR              (0x1   << 4  )
#define I2C1MSTA_NACKADDR_CLR          (0x0   << 4  )
#define I2C1MSTA_NACKADDR_SET          (0x1   << 4  )

/* I2C1MSTA[MRXREQ] - Master Receive request */
#define I2C1MSTA_MRXREQ_BBA            (*(volatile unsigned long *) 0x4206808C)
#define I2C1MSTA_MRXREQ_MSK            (0x1   << 3  )
#define I2C1MSTA_MRXREQ                (0x1   << 3  )
#define I2C1MSTA_MRXREQ_CLR            (0x0   << 3  )
#define I2C1MSTA_MRXREQ_SET            (0x1   << 3  )

/* I2C1MSTA[MTXREQ] - Master Transmit request */
#define I2C1MSTA_MTXREQ_BBA            (*(volatile unsigned long *) 0x42068088)
#define I2C1MSTA_MTXREQ_MSK            (0x1   << 2  )
#define I2C1MSTA_MTXREQ                (0x1   << 2  )
#define I2C1MSTA_MTXREQ_CLR            (0x0   << 2  )
#define I2C1MSTA_MTXREQ_SET            (0x1   << 2  )

/* I2C1MSTA[MTXFSTA] - Master Transmit FIFO status */
#define I2C1MSTA_MTXFSTA_MSK           (0x3   << 0  )

/* Reset Value for I2C1MRX*/
#define I2C1MRX_RVAL                   0x0 

/* I2C1MRX[ICMRX] - Master receive register */
#define I2C1MRX_ICMRX_MSK              (0xFF  << 0  )

/* Reset Value for I2C1MTX*/
#define I2C1MTX_RVAL                   0x0 

/* I2C1MTX[I2CMTX] - Master transmit register */
#define I2C1MTX_I2CMTX_MSK             (0xFF  << 0  )

/* Reset Value for I2C1MRXCNT*/
#define I2C1MRXCNT_RVAL                0x0 

/* I2C1MRXCNT[EXTEND] - Extended read */
#define I2C1MRXCNT_EXTEND_BBA          (*(volatile unsigned long *) 0x42068220)
#define I2C1MRXCNT_EXTEND_MSK          (0x1   << 8  )
#define I2C1MRXCNT_EXTEND              (0x1   << 8  )
#define I2C1MRXCNT_EXTEND_DIS          (0x0   << 8  )
#define I2C1MRXCNT_EXTEND_EN           (0x1   << 8  )

/* I2C1MRXCNT[COUNT] - Receive count */
#define I2C1MRXCNT_COUNT_MSK           (0xFF  << 0  )

/* Reset Value for I2C1MCRXCNT*/
#define I2C1MCRXCNT_RVAL               0x0 

/* I2C1MCRXCNT[COUNT] - Current receive count */
#define I2C1MCRXCNT_COUNT_MSK          (0xFF  << 0  )

/* Reset Value for I2C1ADR0*/
#define I2C1ADR0_RVAL                  0x0 

/* I2C1ADR0[ADR0] - Address byte 0 */
#define I2C1ADR0_ADR0_MSK              (0xFF  << 0  )

/* Reset Value for I2C1ADR1*/
#define I2C1ADR1_RVAL                  0x0 

/* I2C1ADR1[ADR1] - Address byte 1 */
#define I2C1ADR1_ADR1_MSK              (0xFF  << 0  )

/* Reset Value for I2C1DIV*/
#define I2C1DIV_RVAL                   0x1F1F 

/* I2C1DIV[HIGH] - Serial clock high time */
#define I2C1DIV_HIGH_MSK               (0xFF  << 8  )

/* I2C1DIV[LOW] - Serial clock low time */
#define I2C1DIV_LOW_MSK                (0xFF  << 0  )

/* Reset Value for I2C1SCON*/
#define I2C1SCON_RVAL                  0x0 

/* I2C1SCON[STXDMA] - Enable slave Tx DMA request */
#define I2C1SCON_STXDMA_BBA            (*(volatile unsigned long *) 0x42068538)
#define I2C1SCON_STXDMA_MSK            (0x1   << 14 )
#define I2C1SCON_STXDMA                (0x1   << 14 )
#define I2C1SCON_STXDMA_DIS            (0x0   << 14 )
#define I2C1SCON_STXDMA_EN             (0x1   << 14 )

/* I2C1SCON[SRXDMA] - Enable slave Rx DMA request */
#define I2C1SCON_SRXDMA_BBA            (*(volatile unsigned long *) 0x42068534)
#define I2C1SCON_SRXDMA_MSK            (0x1   << 13 )
#define I2C1SCON_SRXDMA                (0x1   << 13 )
#define I2C1SCON_SRXDMA_DIS            (0x0   << 13 )
#define I2C1SCON_SRXDMA_EN             (0x1   << 13 )

