koshkin-sergey/mbOS/Examples/basic/arch/cortex-m/eval_aducm320/src/include/ADuCM320.h
/* I2C1SCON[IENREPST] - Repeated start interrupt enable */
#define I2C1SCON_IENREPST_BBA          (*(volatile unsigned long *) 0x42068530)
#define I2C1SCON_IENREPST_MSK          (0x1   << 12 )
#define I2C1SCON_IENREPST              (0x1   << 12 )
#define I2C1SCON_IENREPST_DIS          (0x0   << 12 )
#define I2C1SCON_IENREPST_EN           (0x1   << 12 )

/* I2C1SCON[SXMITDEC] - Decrement Slave Tx FIFO status when a byte has been transmitted */
#define I2C1SCON_SXMITDEC_BBA          (*(volatile unsigned long *) 0x4206852C)
#define I2C1SCON_SXMITDEC_MSK          (0x1   << 11 )
#define I2C1SCON_SXMITDEC              (0x1   << 11 )
#define I2C1SCON_SXMITDEC_DIS          (0x0   << 11 )
#define I2C1SCON_SXMITDEC_EN           (0x1   << 11 )

/* I2C1SCON[IENSTX] - Slave Transmit request interrupt enable */
#define I2C1SCON_IENSTX_BBA            (*(volatile unsigned long *) 0x42068528)
#define I2C1SCON_IENSTX_MSK            (0x1   << 10 )
#define I2C1SCON_IENSTX                (0x1   << 10 )
#define I2C1SCON_IENSTX_DIS            (0x0   << 10 )
#define I2C1SCON_IENSTX_EN             (0x1   << 10 )

/* I2C1SCON[IENSRX] - Slave Receive request interrupt enable */
#define I2C1SCON_IENSRX_BBA            (*(volatile unsigned long *) 0x42068524)
#define I2C1SCON_IENSRX_MSK            (0x1   << 9  )
#define I2C1SCON_IENSRX                (0x1   << 9  )
#define I2C1SCON_IENSRX_DIS            (0x0   << 9  )
#define I2C1SCON_IENSRX_EN             (0x1   << 9  )

/* I2C1SCON[IENSTOP] - Stop condition detected interrupt enable */
#define I2C1SCON_IENSTOP_BBA           (*(volatile unsigned long *) 0x42068520)
#define I2C1SCON_IENSTOP_MSK           (0x1   << 8  )
#define I2C1SCON_IENSTOP               (0x1   << 8  )
#define I2C1SCON_IENSTOP_DIS           (0x0   << 8  )
#define I2C1SCON_IENSTOP_EN            (0x1   << 8  )

/* I2C1SCON[NACK] - NACK next communication */
#define I2C1SCON_NACK_BBA              (*(volatile unsigned long *) 0x4206851C)
#define I2C1SCON_NACK_MSK              (0x1   << 7  )
#define I2C1SCON_NACK                  (0x1   << 7  )
#define I2C1SCON_NACK_DIS              (0x0   << 7  )
#define I2C1SCON_NACK_EN               (0x1   << 7  )

/* I2C1SCON[STRETCHSCL] - Stretch SCL enable */
#define I2C1SCON_STRETCHSCL_BBA        (*(volatile unsigned long *) 0x42068518)
#define I2C1SCON_STRETCHSCL_MSK        (0x1   << 6  )
#define I2C1SCON_STRETCHSCL            (0x1   << 6  )
#define I2C1SCON_STRETCHSCL_DIS        (0x0   << 6  )
#define I2C1SCON_STRETCHSCL_EN         (0x1   << 6  )

/* I2C1SCON[EARLYTXR] - Early transmit request mode */
#define I2C1SCON_EARLYTXR_BBA          (*(volatile unsigned long *) 0x42068514)
#define I2C1SCON_EARLYTXR_MSK          (0x1   << 5  )
#define I2C1SCON_EARLYTXR              (0x1   << 5  )
#define I2C1SCON_EARLYTXR_DIS          (0x0   << 5  )
#define I2C1SCON_EARLYTXR_EN           (0x1   << 5  )

/* I2C1SCON[GCSBCLR] - General call status bit clear */
#define I2C1SCON_GCSBCLR_BBA           (*(volatile unsigned long *) 0x42068510)
#define I2C1SCON_GCSBCLR_MSK           (0x1   << 4  )
#define I2C1SCON_GCSBCLR               (0x1   << 4  )
#define I2C1SCON_GCSBCLR_DIS           (0x0   << 4  )
#define I2C1SCON_GCSBCLR_EN            (0x1   << 4  )

/* I2C1SCON[HGCEN] - Hardware general call enable */
#define I2C1SCON_HGCEN_BBA             (*(volatile unsigned long *) 0x4206850C)
#define I2C1SCON_HGCEN_MSK             (0x1   << 3  )
#define I2C1SCON_HGCEN                 (0x1   << 3  )
#define I2C1SCON_HGCEN_DIS             (0x0   << 3  )
#define I2C1SCON_HGCEN_EN              (0x1   << 3  )

/* I2C1SCON[GCEN] - General call enable */
#define I2C1SCON_GCEN_BBA              (*(volatile unsigned long *) 0x42068508)
#define I2C1SCON_GCEN_MSK              (0x1   << 2  )
#define I2C1SCON_GCEN                  (0x1   << 2  )
#define I2C1SCON_GCEN_DIS              (0x0   << 2  )
#define I2C1SCON_GCEN_EN               (0x1   << 2  )

/* I2C1SCON[ADR10EN] - Enabled 10-bit addressing */
#define I2C1SCON_ADR10EN_BBA           (*(volatile unsigned long *) 0x42068504)
#define I2C1SCON_ADR10EN_MSK           (0x1   << 1  )
#define I2C1SCON_ADR10EN               (0x1   << 1  )
#define I2C1SCON_ADR10EN_DIS           (0x0   << 1  )
#define I2C1SCON_ADR10EN_EN            (0x1   << 1  )

/* I2C1SCON[SLVEN] - Slave enable */
#define I2C1SCON_SLVEN_BBA             (*(volatile unsigned long *) 0x42068500)
#define I2C1SCON_SLVEN_MSK             (0x1   << 0  )
#define I2C1SCON_SLVEN                 (0x1   << 0  )
#define I2C1SCON_SLVEN_DIS             (0x0   << 0  )
#define I2C1SCON_SLVEN_EN              (0x1   << 0  )

/* Reset Value for I2C1SSTA*/
#define I2C1SSTA_RVAL                  0x1 

/* I2C1SSTA[START] - Start and matching address */
#define I2C1SSTA_START_BBA             (*(volatile unsigned long *) 0x420685B8)
#define I2C1SSTA_START_MSK             (0x1   << 14 )
#define I2C1SSTA_START                 (0x1   << 14 )
#define I2C1SSTA_START_CLR             (0x0   << 14 )
#define I2C1SSTA_START_SET             (0x1   << 14 )

/* I2C1SSTA[REPSTART] - Repeated start and matching address */
#define I2C1SSTA_REPSTART_BBA          (*(volatile unsigned long *) 0x420685B4)
#define I2C1SSTA_REPSTART_MSK          (0x1   << 13 )
#define I2C1SSTA_REPSTART              (0x1   << 13 )
#define I2C1SSTA_REPSTART_CLR          (0x0   << 13 )
#define I2C1SSTA_REPSTART_SET          (0x1   << 13 )

/* I2C1SSTA[IDMAT] - Device ID matched */
#define I2C1SSTA_IDMAT_MSK             (0x3   << 11 )

/* I2C1SSTA[STOP] - Stop after start and matching address */
#define I2C1SSTA_STOP_BBA              (*(volatile unsigned long *) 0x420685A8)
#define I2C1SSTA_STOP_MSK              (0x1   << 10 )
#define I2C1SSTA_STOP                  (0x1   << 10 )
#define I2C1SSTA_STOP_CLR              (0x0   << 10 )
#define I2C1SSTA_STOP_SET              (0x1   << 10 )

/* I2C1SSTA[GCID] - General ID */
#define I2C1SSTA_GCID_MSK              (0x3   << 8  )

/* I2C1SSTA[GCINT] - General call interrupt */
#define I2C1SSTA_GCINT_BBA             (*(volatile unsigned long *) 0x4206859C)
#define I2C1SSTA_GCINT_MSK             (0x1   << 7  )
#define I2C1SSTA_GCINT                 (0x1   << 7  )
#define I2C1SSTA_GCINT_CLR             (0x0   << 7  )
#define I2C1SSTA_GCINT_SET             (0x1   << 7  )

/* I2C1SSTA[SBUSY] - Slave busy */
#define I2C1SSTA_SBUSY_BBA             (*(volatile unsigned long *) 0x42068598)
#define I2C1SSTA_SBUSY_MSK             (0x1   << 6  )
#define I2C1SSTA_SBUSY                 (0x1   << 6  )
#define I2C1SSTA_SBUSY_CLR             (0x0   << 6  )
#define I2C1SSTA_SBUSY_SET             (0x1   << 6  )

