koshkin-sergey/mbOS/Examples/basic/arch/cortex-m/eval_aducm320/src/include/ADuCM320.h
/* I2C1SSTA[NOACK] - Ack not generated by the slave */
#define I2C1SSTA_NOACK_BBA             (*(volatile unsigned long *) 0x42068594)
#define I2C1SSTA_NOACK_MSK             (0x1   << 5  )
#define I2C1SSTA_NOACK                 (0x1   << 5  )
#define I2C1SSTA_NOACK_CLR             (0x0   << 5  )
#define I2C1SSTA_NOACK_SET             (0x1   << 5  )

/* I2C1SSTA[SRXOF] - Slave Receive FIFO overflow */
#define I2C1SSTA_SRXOF_BBA             (*(volatile unsigned long *) 0x42068590)
#define I2C1SSTA_SRXOF_MSK             (0x1   << 4  )
#define I2C1SSTA_SRXOF                 (0x1   << 4  )
#define I2C1SSTA_SRXOF_CLR             (0x0   << 4  )
#define I2C1SSTA_SRXOF_SET             (0x1   << 4  )

/* I2C1SSTA[SRXREQ] - Slave Receive request */
#define I2C1SSTA_SRXREQ_BBA            (*(volatile unsigned long *) 0x4206858C)
#define I2C1SSTA_SRXREQ_MSK            (0x1   << 3  )
#define I2C1SSTA_SRXREQ                (0x1   << 3  )
#define I2C1SSTA_SRXREQ_CLR            (0x0   << 3  )
#define I2C1SSTA_SRXREQ_SET            (0x1   << 3  )

/* I2C1SSTA[STXREQ] - Slave Transmit request */
#define I2C1SSTA_STXREQ_BBA            (*(volatile unsigned long *) 0x42068588)
#define I2C1SSTA_STXREQ_MSK            (0x1   << 2  )
#define I2C1SSTA_STXREQ                (0x1   << 2  )
#define I2C1SSTA_STXREQ_CLR            (0x0   << 2  )
#define I2C1SSTA_STXREQ_SET            (0x1   << 2  )

/* I2C1SSTA[STXUR] - Slave Transmit FIFO underflow */
#define I2C1SSTA_STXUR_BBA             (*(volatile unsigned long *) 0x42068584)
#define I2C1SSTA_STXUR_MSK             (0x1   << 1  )
#define I2C1SSTA_STXUR                 (0x1   << 1  )
#define I2C1SSTA_STXUR_CLR             (0x0   << 1  )
#define I2C1SSTA_STXUR_SET             (0x1   << 1  )

/* I2C1SSTA[STXFSEREQ] - Slave Tx FIFO Status or early request */
#define I2C1SSTA_STXFSEREQ_BBA         (*(volatile unsigned long *) 0x42068580)
#define I2C1SSTA_STXFSEREQ_MSK         (0x1   << 0  )
#define I2C1SSTA_STXFSEREQ             (0x1   << 0  )
#define I2C1SSTA_STXFSEREQ_CLR         (0x0   << 0  )
#define I2C1SSTA_STXFSEREQ_SET         (0x1   << 0  )

/* Reset Value for I2C1SRX*/
#define I2C1SRX_RVAL                   0x0 

/* I2C1SRX[I2CSRX] - Slave receive register */
#define I2C1SRX_I2CSRX_MSK             (0xFF  << 0  )

/* Reset Value for I2C1STX*/
#define I2C1STX_RVAL                   0x0 

/* I2C1STX[I2CSTX] - Slave transmit register */
#define I2C1STX_I2CSTX_MSK             (0xFF  << 0  )

/* Reset Value for I2C1ALT*/
#define I2C1ALT_RVAL                   0x0 

/* I2C1ALT[ALT] - Slave Alt */
#define I2C1ALT_ALT_MSK                (0xFF  << 0  )

/* Reset Value for I2C1ID0*/
#define I2C1ID0_RVAL                   0x0 

/* I2C1ID0[ID0] - Slave device ID 0 */
#define I2C1ID0_ID0_MSK                (0xFF  << 0  )

/* Reset Value for I2C1ID1*/
#define I2C1ID1_RVAL                   0x0 

/* I2C1ID1[ID1] - Slave device ID 1 */
#define I2C1ID1_ID1_MSK                (0xFF  << 0  )

/* Reset Value for I2C1ID2*/
#define I2C1ID2_RVAL                   0x0 

/* I2C1ID2[ID2] - Slave device ID 2 */
#define I2C1ID2_ID2_MSK                (0xFF  << 0  )

/* Reset Value for I2C1ID3*/
#define I2C1ID3_RVAL                   0x0 

/* I2C1ID3[ID3] - Slave device ID 3 */
#define I2C1ID3_ID3_MSK                (0xFF  << 0  )

/* Reset Value for I2C1FSTA*/
#define I2C1FSTA_RVAL                  0x0 

/* I2C1FSTA[MFLUSH] - Flush the master transmit FIFO */
#define I2C1FSTA_MFLUSH_BBA            (*(volatile unsigned long *) 0x420689A4)
#define I2C1FSTA_MFLUSH_MSK            (0x1   << 9  )
#define I2C1FSTA_MFLUSH                (0x1   << 9  )
#define I2C1FSTA_MFLUSH_DIS            (0x0   << 9  ) /* Clearing to 0 has no effect. */
#define I2C1FSTA_MFLUSH_EN             (0x1   << 9  ) /* Set to 1 to flush the master transmit FIFO. The master transmit FIFO will have to flushed if arbitration is lost or a slave responds with a NACK. */

/* I2C1FSTA[SFLUSH] - Flush the slave transmit FIFO */
#define I2C1FSTA_SFLUSH_BBA            (*(volatile unsigned long *) 0x420689A0)
#define I2C1FSTA_SFLUSH_MSK            (0x1   << 8  )
#define I2C1FSTA_SFLUSH                (0x1   << 8  )
#define I2C1FSTA_SFLUSH_DIS            (0x0   << 8  ) /* Clearing to 0 has no effect. */
#define I2C1FSTA_SFLUSH_EN             (0x1   << 8  ) /* Set to 1 to flush the slave transmit FIFO. */

/* I2C1FSTA[MRXFSTA] - Master receive FIFO status */
#define I2C1FSTA_MRXFSTA_MSK           (0x3   << 6  )
#define I2C1FSTA_MRXFSTA_EMPTY         (0x0   << 6  ) /* FIFO empty               */
#define I2C1FSTA_MRXFSTA_ONEBYTE       (0x1   << 6  ) /* 1 bytes in the FIFO      */
#define I2C1FSTA_MRXFSTA_TWOBYTES      (0x2   << 6  ) /* 2 bytes in the FIFO      */

/* I2C1FSTA[MTXFSTA] - Master transmit FIFO status */
#define I2C1FSTA_MTXFSTA_MSK           (0x3   << 4  )
#define I2C1FSTA_MTXFSTA_EMPTY         (0x0   << 4  ) /* FIFO empty               */
#define I2C1FSTA_MTXFSTA_ONEBYTE       (0x1   << 4  ) /* 1 bytes in the FIFO      */
#define I2C1FSTA_MTXFSTA_TWOBYTES      (0x2   << 4  ) /* 2 bytes in the FIFO      */

/* I2C1FSTA[SRXFSTA] - Slave receive FIFO status */
#define I2C1FSTA_SRXFSTA_MSK           (0x3   << 2  )
#define I2C1FSTA_SRXFSTA_EMPTY         (0x0   << 2  ) /* FIFO empty               */
#define I2C1FSTA_SRXFSTA_ONEBYTE       (0x1   << 2  ) /* 1 bytes in the FIFO      */
#define I2C1FSTA_SRXFSTA_TWOBYTES      (0x2   << 2  ) /* 2 bytes in the FIFO      */

/* I2C1FSTA[STXFSTA] - Slave transmit FIFO status */
#define I2C1FSTA_STXFSTA_MSK           (0x3   << 0  )
#define I2C1FSTA_STXFSTA_EMPTY         (0x0   << 0  ) /* FIFO empty               */
#define I2C1FSTA_STXFSTA_ONEBYTE       (0x1   << 0  ) /* 1 bytes in the FIFO      */
#define I2C1FSTA_STXFSTA_TWOBYTES      (0x2   << 0  ) /* 2 bytes in the FIFO      */

/* Reset Value for I2C1SHCON*/
#define I2C1SHCON_RVAL                 0x0 

/* I2C1SHCON[RESET] - Reset START STOP detect circuit */
#define I2C1SHCON_RESET_BBA            (*(volatile unsigned long *) 0x42068A00)
#define I2C1SHCON_RESET_MSK            (0x1   << 0  )
#define I2C1SHCON_RESET                (0x1   << 0  )
#define I2C1SHCON_RESET_DIS            (0x0   << 0  )
#define I2C1SHCON_RESET_EN             (0x1   << 0  )
// ------------------------------------------------------------------------------------------------
// -----                                        uart0                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief uart0 (pADI_UART)
  */

#if (__NO_MMR_STRUCTS__==0)
typedef struct {                            /*!< pADI_UART Structure                    */
  
  union {
    __IO uint16_t  COMTX;                   /*!< Transmit holding register             */
    __IO uint16_t  COMRX;                   /*!< Receive buffer register               */
  } ;
  __I  uint16_t  RESERVED0;
  __IO uint16_t  COMIEN;                    /*!< Interrupt enable register             */
  __I  uint16_t  RESERVED1;
  __IO uint16_t  COMIIR;                    /*!< Interrupt identification register     */
  __I  uint16_t  RESERVED2;
  __IO uint16_t  COMLCR;                    /*!< Line control register                 */
  __I  uint16_t  RESERVED3;
  __IO uint16_t  COMMCR;                    /*!< Modem control register                */
  __I  uint16_t  RESERVED4;
  __IO uint16_t  COMLSR;                    /*!< Line status register                  */
  __I  uint16_t  RESERVED5;
  __IO uint16_t  COMMSR;                    /*!< Modem status register                 */
  __I  uint16_t  RESERVED6;
  __IO uint16_t  COMSCR;                    /*!< Scratch buffer register               */
  __I  uint16_t  RESERVED7[3];
  __IO uint16_t  COMFBR;                    /*!< Fractional baud rate register         */
  __I  uint16_t  RESERVED8;
  __IO uint16_t  COMDIV;                    /*!< Baud rate divider register            */
} ADI_UART_TypeDef;
#else // (__NO_MMR_STRUCTS__==0)
#define          COMTX                                      (*(volatile unsigned short int *) 0x40005000)
#define          COMRX                                      (*(volatile unsigned short int *) 0x40005000)
#define          COMIEN                                     (*(volatile unsigned short int *) 0x40005004)
#define          COMIIR                                     (*(volatile unsigned short int *) 0x40005008)
#define          COMLCR                                     (*(volatile unsigned short int *) 0x4000500C)
#define          COMMCR                                     (*(volatile unsigned short int *) 0x40005010)
#define          COMLSR                                     (*(volatile unsigned short int *) 0x40005014)
#define          COMMSR                                     (*(volatile unsigned short int *) 0x40005018)
#define          COMSCR                                     (*(volatile unsigned short int *) 0x4000501C)
#define          COMFBR                                     (*(volatile unsigned short int *) 0x40005024)
#define          COMDIV                                     (*(volatile unsigned short int *) 0x40005028)
#endif // (__NO_MMR_STRUCTS__==0)

/* Reset Value for COMTX*/
#define COMTX_RVAL                     0x0 

/* COMTX[THR] - Transmit Holding Register */
#define COMTX_THR_MSK                  (0xFF  << 0  )

/* Reset Value for COMRX*/
#define COMRX_RVAL                     0x0 

/* COMRX[RBR] - Receive Buffer Register */
#define COMRX_RBR_MSK                  (0xFF  << 0  )

/* Reset Value for COMIEN*/
#define COMIEN_RVAL                    0x0 

/* COMIEN[EDMAR] - DMA requests in receive mode */
#define COMIEN_EDMAR_BBA               (*(volatile unsigned long *) 0x420A0094)
#define COMIEN_EDMAR_MSK               (0x1   << 5  )
#define COMIEN_EDMAR                   (0x1   << 5  )
#define COMIEN_EDMAR_DIS               (0x0   << 5  ) /* DMA requests disabled    */
#define COMIEN_EDMAR_EN                (0x1   << 5  ) /* DMA requests enabled     */

/* COMIEN[EDMAT] - DMA requests in transmit mode */
#define COMIEN_EDMAT_BBA               (*(volatile unsigned long *) 0x420A0090)
#define COMIEN_EDMAT_MSK               (0x1   << 4  )
#define COMIEN_EDMAT                   (0x1   << 4  )
#define COMIEN_EDMAT_DIS               (0x0   << 4  ) /* DMA requests are disabled */
#define COMIEN_EDMAT_EN                (0x1   << 4  ) /* DMA requests are enabled */

/* COMIEN[EDSSI] - Modem status interrupt */
#define COMIEN_EDSSI_BBA               (*(volatile unsigned long *) 0x420A008C)
#define COMIEN_EDSSI_MSK               (0x1   << 3  )
#define COMIEN_EDSSI                   (0x1   << 3  )
#define COMIEN_EDSSI_DIS               (0x0   << 3  ) /* Interrupt disabled       */
#define COMIEN_EDSSI_EN                (0x1   << 3  ) /* Interrupt enabled        */

