koshkin-sergey/mbOS/Examples/basic/arch/cortex-m/eval_aducm320/src/include/ADuCM320.h
/* PLA_ELEM[MUX0] - Even element feedback selection (in respective block) */
#define PLA_ELEM_MUX0_MSK              (0x3   << 9  )
#define PLA_ELEM_MUX0_ELEM0            (0x0   << 9  ) /* Feedback from Element 0 (all except Element 0) / Input from other block (Element 0 only) */
#define PLA_ELEM_MUX0_ELEM2            (0x1   << 9  ) /* Feedback from Element 2  */
#define PLA_ELEM_MUX0_ELEM4            (0x2   << 9  ) /* Feedback from Element 4  */
#define PLA_ELEM_MUX0_ELEM6            (0x3   << 9  ) /* Feedback from Element 6  */

/* PLA_ELEM[MUX1] - Odd element feedback selection (in respective block) */
#define PLA_ELEM_MUX1_MSK              (0x3   << 7  )
#define PLA_ELEM_MUX1_ELEM1            (0x0   << 7  ) /* Feedback from Element 1  */
#define PLA_ELEM_MUX1_ELEM3            (0x1   << 7  ) /* Feedback from Element 3  */
#define PLA_ELEM_MUX1_ELEM5            (0x2   << 7  ) /* Feedback from Element 5  */
#define PLA_ELEM_MUX1_ELEM7            (0x3   << 7  ) /* Feedback from Element 7  */

/* PLA_ELEM[MUX2] - Select between correspondng bit from PLA_DINx register or even feedback mux */
#define PLA_ELEM_MUX2_BBA              (*(volatile unsigned long *) 0x420B0018)
#define PLA_ELEM_MUX2_MSK              (0x1   << 6  )
#define PLA_ELEM_MUX2                  (0x1   << 6  )
#define PLA_ELEM_MUX2_MMR              (0x0   << 6  ) /* PLA_DINx input           */
#define PLA_ELEM_MUX2_EVEN             (0x1   << 6  ) /* Even feedback mux        */

/* PLA_ELEM[MUX3] - Select between GPIO Bus input or odd feedback input (for Elements 16-31 odd feedback is always selected) */
#define PLA_ELEM_MUX3_BBA              (*(volatile unsigned long *) 0x420B0014)
#define PLA_ELEM_MUX3_MSK              (0x1   << 5  )
#define PLA_ELEM_MUX3                  (0x1   << 5  )
#define PLA_ELEM_MUX3_ODD              (0x0   << 5  ) /* odd feedback mux         */
#define PLA_ELEM_MUX3_GPIO             (0x1   << 5  ) /* GPIO input               */

/* PLA_ELEM[TBL] - bit 4,3,2,1 configures output for {mux2_out, mux3_out} = 11,10,01,00 respectively */
#define PLA_ELEM_TBL_MSK               (0xF   << 1  )
#define PLA_ELEM_TBL_LOW               (0x0   << 1  ) /* 0.                       */
#define PLA_ELEM_TBL_NOR               (0x1   << 1  ) /* NOR.                     */
#define PLA_ELEM_TBL_BANDNOTA          (0x2   << 1  ) /* B and not A.             */
#define PLA_ELEM_TBL_NOTA              (0x3   << 1  ) /* NOT A.                   */
#define PLA_ELEM_TBL_AANDNOTB          (0x4   << 1  ) /* A and not B.             */
#define PLA_ELEM_TBL_NOTB              (0x5   << 1  ) /* Not B.                   */
#define PLA_ELEM_TBL_EXOR              (0x6   << 1  ) /* EXOR.                    */
#define PLA_ELEM_TBL_NAND              (0x7   << 1  ) /* NAND.                    */
#define PLA_ELEM_TBL_AND               (0x8   << 1  ) /* AND.                     */
#define PLA_ELEM_TBL_EXNOR             (0x9   << 1  ) /* EXNOR.                   */
#define PLA_ELEM_TBL_B                 (0xA   << 1  ) /* B.                       */
#define PLA_ELEM_TBL_BORNOTA           (0xB   << 1  ) /* B or not A.              */
#define PLA_ELEM_TBL_A                 (0xC   << 1  ) /* A.                       */
#define PLA_ELEM_TBL_AORNOTB           (0xD   << 1  ) /* A or not B.              */
#define PLA_ELEM_TBL_OR                (0xE   << 1  ) /* OR                       */
#define PLA_ELEM_TBL_HIGH              (0xF   << 1  ) /* 1.                       */

/* PLA_ELEM[MUX4] - Select or bypass flip-flop output */
#define PLA_ELEM_MUX4_BBA              (*(volatile unsigned long *) 0x420B0000)
#define PLA_ELEM_MUX4_MSK              (0x1   << 0  )
#define PLA_ELEM_MUX4                  (0x1   << 0  )
#define PLA_ELEM_MUX4_FF               (0x0   << 0  ) /* FF output                */
#define PLA_ELEM_MUX4_BYPASS           (0x1   << 0  ) /* Bypass output            */

/* Reset Value for PLA_CLK*/
#define PLA_CLK_RVAL                   0x0 

/* PLA_CLK[BLOCK3] - Clock select for Block 3 */
#define PLA_CLK_BLOCK3_MSK             (0x7   << 12 )
#define PLA_CLK_BLOCK3_P03             (0x0   << 12 ) /* GPIO clock on P0.3       */
#define PLA_CLK_BLOCK3_P11             (0x1   << 12 ) /* GPIO clock on P1.1       */
#define PLA_CLK_BLOCK3_P20             (0x2   << 12 ) /* GPIO clock on P2.0       */
#define PLA_CLK_BLOCK3_HCLK            (0x3   << 12 ) /* HCLK                     */
#define PLA_CLK_BLOCK3_MOSC            (0x4   << 12 ) /* MOSC (16 MHz)            */
#define PLA_CLK_BLOCK3_T0              (0x5   << 12 ) /* Timer 0                  */
#define PLA_CLK_BLOCK3_T2              (0x6   << 12 ) /* Timer 2                  */
#define PLA_CLK_BLOCK3_KOSC            (0x7   << 12 ) /* KOSC (32 kHz)            */

/* PLA_CLK[BLOCK2] - Clock select for Block 2 */
#define PLA_CLK_BLOCK2_MSK             (0x7   << 8  )
#define PLA_CLK_BLOCK2_P03             (0x0   << 8  ) /* GPIO clock on P0.3       */
#define PLA_CLK_BLOCK2_P11             (0x1   << 8  ) /* GPIO clock on P1.1       */
#define PLA_CLK_BLOCK2_P20             (0x2   << 8  ) /* GPIO clock on P2.0       */
#define PLA_CLK_BLOCK2_HCLK            (0x3   << 8  ) /* HCLK                     */
#define PLA_CLK_BLOCK2_MOSC            (0x4   << 8  ) /* MOSC (16 MHz)            */
#define PLA_CLK_BLOCK2_T0              (0x5   << 8  ) /* Timer 0                  */
#define PLA_CLK_BLOCK2_T2              (0x6   << 8  ) /* Timer 2                  */
#define PLA_CLK_BLOCK2_KOSC            (0x7   << 8  ) /* KOSC (32 kHz)            */

/* PLA_CLK[BLOCK1] - Clock select for Block 1 */
#define PLA_CLK_BLOCK1_MSK             (0x7   << 4  )
#define PLA_CLK_BLOCK1_P03             (0x0   << 4  ) /* GPIO clock on P0.3       */
#define PLA_CLK_BLOCK1_P11             (0x1   << 4  ) /* GPIO clock on P1.1       */
#define PLA_CLK_BLOCK1_P20             (0x2   << 4  ) /* GPIO clock on P2.0       */
#define PLA_CLK_BLOCK1_HCLK            (0x3   << 4  ) /* HCLK                     */
#define PLA_CLK_BLOCK1_MOSC            (0x4   << 4  ) /* MOSC (16 MHz)            */
#define PLA_CLK_BLOCK1_T0              (0x5   << 4  ) /* Timer 0                  */
#define PLA_CLK_BLOCK1_T2              (0x6   << 4  ) /* Timer 2                  */
#define PLA_CLK_BLOCK1_KOSC            (0x7   << 4  ) /* KOSC (32 kHz)            */

/* PLA_CLK[BLOCK0] - Clock select for Block 0 */
#define PLA_CLK_BLOCK0_MSK             (0x7   << 0  )
#define PLA_CLK_BLOCK0_P03             (0x0   << 0  ) /* GPIO clock on P0.3       */
#define PLA_CLK_BLOCK0_P11             (0x1   << 0  ) /* GPIO clock on P1.1       */
#define PLA_CLK_BLOCK0_P20             (0x2   << 0  ) /* GPIO clock on P2.0       */
#define PLA_CLK_BLOCK0_HCLK            (0x3   << 0  ) /* HCLK                     */
#define PLA_CLK_BLOCK0_MOSC            (0x4   << 0  ) /* MOSC (16 MHz)            */
#define PLA_CLK_BLOCK0_T0              (0x5   << 0  ) /* Timer 0                  */
#define PLA_CLK_BLOCK0_T2              (0x6   << 0  ) /* Timer 2                  */
#define PLA_CLK_BLOCK0_KOSC            (0x7   << 0  ) /* KOSC (32 kHz)            */

/* Reset Value for PLA_IRQ0*/
#define PLA_IRQ0_RVAL                  0x0 

