koshkin-sergey/mbOS/Examples/basic/arch/cortex-m/eval_aducm320/src/include/ADuCM320.h
/* PLA_DOUT0[E5] - Output bit from Element 5 */
#define PLA_DOUT0_E5_BBA               (*(volatile unsigned long *) 0x420B1314)
#define PLA_DOUT0_E5_MSK               (0x1   << 5  )
#define PLA_DOUT0_E5                   (0x1   << 5  )
#define PLA_DOUT0_E5_CLR               (0x0   << 5  )
#define PLA_DOUT0_E5_SET               (0x1   << 5  )

/* PLA_DOUT0[E4] - Output bit from Element 4 */
#define PLA_DOUT0_E4_BBA               (*(volatile unsigned long *) 0x420B1310)
#define PLA_DOUT0_E4_MSK               (0x1   << 4  )
#define PLA_DOUT0_E4                   (0x1   << 4  )
#define PLA_DOUT0_E4_CLR               (0x0   << 4  )
#define PLA_DOUT0_E4_SET               (0x1   << 4  )

/* PLA_DOUT0[E3] - Output bit from Element 3 */
#define PLA_DOUT0_E3_BBA               (*(volatile unsigned long *) 0x420B130C)
#define PLA_DOUT0_E3_MSK               (0x1   << 3  )
#define PLA_DOUT0_E3                   (0x1   << 3  )
#define PLA_DOUT0_E3_CLR               (0x0   << 3  )
#define PLA_DOUT0_E3_SET               (0x1   << 3  )

/* PLA_DOUT0[E2] - Output bit from Element 2 */
#define PLA_DOUT0_E2_BBA               (*(volatile unsigned long *) 0x420B1308)
#define PLA_DOUT0_E2_MSK               (0x1   << 2  )
#define PLA_DOUT0_E2                   (0x1   << 2  )
#define PLA_DOUT0_E2_CLR               (0x0   << 2  )
#define PLA_DOUT0_E2_SET               (0x1   << 2  )

/* PLA_DOUT0[E1] - Output bit from Element 1 */
#define PLA_DOUT0_E1_BBA               (*(volatile unsigned long *) 0x420B1304)
#define PLA_DOUT0_E1_MSK               (0x1   << 1  )
#define PLA_DOUT0_E1                   (0x1   << 1  )
#define PLA_DOUT0_E1_CLR               (0x0   << 1  )
#define PLA_DOUT0_E1_SET               (0x1   << 1  )

/* PLA_DOUT0[E0] - Output bit from Element 0 */
#define PLA_DOUT0_E0_BBA               (*(volatile unsigned long *) 0x420B1300)
#define PLA_DOUT0_E0_MSK               (0x1   << 0  )
#define PLA_DOUT0_E0                   (0x1   << 0  )
#define PLA_DOUT0_E0_CLR               (0x0   << 0  )
#define PLA_DOUT0_E0_SET               (0x1   << 0  )

/* Reset Value for PLA_DOUT1*/
#define PLA_DOUT1_RVAL                 0x0 

/* PLA_DOUT1[E31] - Output bit from Element 31 */
#define PLA_DOUT1_E31_BBA              (*(volatile unsigned long *) 0x420B13BC)
#define PLA_DOUT1_E31_MSK              (0x1   << 15 )
#define PLA_DOUT1_E31                  (0x1   << 15 )
#define PLA_DOUT1_E31_CLR              (0x0   << 15 )
#define PLA_DOUT1_E31_SET              (0x1   << 15 )

/* PLA_DOUT1[E30] - Output bit from Element 30 */
#define PLA_DOUT1_E30_BBA              (*(volatile unsigned long *) 0x420B13B8)
#define PLA_DOUT1_E30_MSK              (0x1   << 14 )
#define PLA_DOUT1_E30                  (0x1   << 14 )
#define PLA_DOUT1_E30_CLR              (0x0   << 14 )
#define PLA_DOUT1_E30_SET              (0x1   << 14 )

/* PLA_DOUT1[E29] - Output bit from Element 29 */
#define PLA_DOUT1_E29_BBA              (*(volatile unsigned long *) 0x420B13B4)
#define PLA_DOUT1_E29_MSK              (0x1   << 13 )
#define PLA_DOUT1_E29                  (0x1   << 13 )
#define PLA_DOUT1_E29_CLR              (0x0   << 13 )
#define PLA_DOUT1_E29_SET              (0x1   << 13 )

/* PLA_DOUT1[E28] - Output bit from Element 28 */
#define PLA_DOUT1_E28_BBA              (*(volatile unsigned long *) 0x420B13B0)
#define PLA_DOUT1_E28_MSK              (0x1   << 12 )
#define PLA_DOUT1_E28                  (0x1   << 12 )
#define PLA_DOUT1_E28_CLR              (0x0   << 12 )
#define PLA_DOUT1_E28_SET              (0x1   << 12 )

/* PLA_DOUT1[E27] - Output bit from Element 27 */
#define PLA_DOUT1_E27_BBA              (*(volatile unsigned long *) 0x420B13AC)
#define PLA_DOUT1_E27_MSK              (0x1   << 11 )
#define PLA_DOUT1_E27                  (0x1   << 11 )
#define PLA_DOUT1_E27_CLR              (0x0   << 11 )
#define PLA_DOUT1_E27_SET              (0x1   << 11 )

/* PLA_DOUT1[E26] - Output bit from Element 26 */
#define PLA_DOUT1_E26_BBA              (*(volatile unsigned long *) 0x420B13A8)
#define PLA_DOUT1_E26_MSK              (0x1   << 10 )
#define PLA_DOUT1_E26                  (0x1   << 10 )
#define PLA_DOUT1_E26_CLR              (0x0   << 10 )
#define PLA_DOUT1_E26_SET              (0x1   << 10 )

/* PLA_DOUT1[E25] - Output bit from Element 25 */
#define PLA_DOUT1_E25_BBA              (*(volatile unsigned long *) 0x420B13A4)
#define PLA_DOUT1_E25_MSK              (0x1   << 9  )
#define PLA_DOUT1_E25                  (0x1   << 9  )
#define PLA_DOUT1_E25_CLR              (0x0   << 9  )
#define PLA_DOUT1_E25_SET              (0x1   << 9  )

/* PLA_DOUT1[E24] - Output bit from Element 24 */
#define PLA_DOUT1_E24_BBA              (*(volatile unsigned long *) 0x420B13A0)
#define PLA_DOUT1_E24_MSK              (0x1   << 8  )
#define PLA_DOUT1_E24                  (0x1   << 8  )
#define PLA_DOUT1_E24_CLR              (0x0   << 8  )
#define PLA_DOUT1_E24_SET              (0x1   << 8  )

/* PLA_DOUT1[E23] - Output bit from Element 23 */
#define PLA_DOUT1_E23_BBA              (*(volatile unsigned long *) 0x420B139C)
#define PLA_DOUT1_E23_MSK              (0x1   << 7  )
#define PLA_DOUT1_E23                  (0x1   << 7  )
#define PLA_DOUT1_E23_CLR              (0x0   << 7  )
#define PLA_DOUT1_E23_SET              (0x1   << 7  )

/* PLA_DOUT1[E22] - Output bit from Element 22 */
#define PLA_DOUT1_E22_BBA              (*(volatile unsigned long *) 0x420B1398)
#define PLA_DOUT1_E22_MSK              (0x1   << 6  )
#define PLA_DOUT1_E22                  (0x1   << 6  )
#define PLA_DOUT1_E22_CLR              (0x0   << 6  )
#define PLA_DOUT1_E22_SET              (0x1   << 6  )

/* PLA_DOUT1[E21] - Output bit from Element 21 */
#define PLA_DOUT1_E21_BBA              (*(volatile unsigned long *) 0x420B1394)
#define PLA_DOUT1_E21_MSK              (0x1   << 5  )
#define PLA_DOUT1_E21                  (0x1   << 5  )
#define PLA_DOUT1_E21_CLR              (0x0   << 5  )
#define PLA_DOUT1_E21_SET              (0x1   << 5  )

/* PLA_DOUT1[E20] - Output bit from Element 20 */
#define PLA_DOUT1_E20_BBA              (*(volatile unsigned long *) 0x420B1390)
#define PLA_DOUT1_E20_MSK              (0x1   << 4  )
#define PLA_DOUT1_E20                  (0x1   << 4  )
#define PLA_DOUT1_E20_CLR              (0x0   << 4  )
#define PLA_DOUT1_E20_SET              (0x1   << 4  )

/* PLA_DOUT1[E19] - Output bit from Element 19 */
#define PLA_DOUT1_E19_BBA              (*(volatile unsigned long *) 0x420B138C)
#define PLA_DOUT1_E19_MSK              (0x1   << 3  )
#define PLA_DOUT1_E19                  (0x1   << 3  )
#define PLA_DOUT1_E19_CLR              (0x0   << 3  )
#define PLA_DOUT1_E19_SET              (0x1   << 3  )

/* PLA_DOUT1[E18] - Output bit from Element 18 */
#define PLA_DOUT1_E18_BBA              (*(volatile unsigned long *) 0x420B1388)
#define PLA_DOUT1_E18_MSK              (0x1   << 2  )
#define PLA_DOUT1_E18                  (0x1   << 2  )
#define PLA_DOUT1_E18_CLR              (0x0   << 2  )
#define PLA_DOUT1_E18_SET              (0x1   << 2  )

