koshkin-sergey/mbOS/Examples/basic/arch/cortex-m/eval_aducm320/src/include/ADuCM320.h
/* PLA_DOUT1[E17] - Output bit from Element 17 */
#define PLA_DOUT1_E17_BBA              (*(volatile unsigned long *) 0x420B1384)
#define PLA_DOUT1_E17_MSK              (0x1   << 1  )
#define PLA_DOUT1_E17                  (0x1   << 1  )
#define PLA_DOUT1_E17_CLR              (0x0   << 1  )
#define PLA_DOUT1_E17_SET              (0x1   << 1  )

/* PLA_DOUT1[E16] - Output bit from Element 16 */
#define PLA_DOUT1_E16_BBA              (*(volatile unsigned long *) 0x420B1380)
#define PLA_DOUT1_E16_MSK              (0x1   << 0  )
#define PLA_DOUT1_E16                  (0x1   << 0  )
#define PLA_DOUT1_E16_CLR              (0x0   << 0  )
#define PLA_DOUT1_E16_SET              (0x1   << 0  )

/* Reset Value for PLA_LCK*/
#define PLA_LCK_RVAL                   0x0 

/* PLA_LCK[LOCK] - Set to disable writing to registers */
#define PLA_LCK_LOCK_BBA               (*(volatile unsigned long *) 0x420B1400)
#define PLA_LCK_LOCK_MSK               (0x1   << 0  )
#define PLA_LCK_LOCK                   (0x1   << 0  )
#define PLA_LCK_LOCK_DIS               (0x0   << 0  ) /* Writing to registers allowed */
#define PLA_LCK_LOCK_EN                (0x1   << 0  ) /* Writing to registers disabled */
// ------------------------------------------------------------------------------------------------
// -----                                        dma                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief dma (pADI_DMA)
  */

#if (__NO_MMR_STRUCTS__==0)
typedef struct {                            /*!< pADI_DMA Structure                     */
  __IO uint32_t  DMASTA;                    /*!< DMA Status                            */
  __IO uint32_t  DMACFG;                    /*!< DMA Configuration                     */
  __IO uint32_t  DMAPDBPTR;                 /*!< DMA channel primary control data base pointer */
  __IO uint32_t  DMAADBPTR;                 /*!< DMA channel alternate control data base pointer */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  DMASWREQ;                  /*!< DMA channel software request          */
  __I  uint32_t  RESERVED1[2];
  __IO uint32_t  DMARMSKSET;                /*!< DMA channel request mask set          */
  __IO uint32_t  DMARMSKCLR;                /*!< DMA channel request mask clear        */
  __IO uint32_t  DMAENSET;                  /*!< DMA channel enable set                */
  __IO uint32_t  DMAENCLR;                  /*!< DMA channel enable clear              */
  __IO uint32_t  DMAALTSET;                 /*!< DMA channel primary-alternate set     */
  __IO uint32_t  DMAALTCLR;                 /*!< DMA channel primary-alternate clear   */
  __IO uint32_t  DMAPRISET;                 /*!< DMA channel priority set              */
  __IO uint32_t  DMAPRICLR;                 /*!< DMA channel priority clear            */
  __I  uint32_t  RESERVED2[3];
  __IO uint32_t  DMAERRCLR;                 /*!< DMA Per Channel Bus Error             */
  __I  uint32_t  RESERVED3[492];
  __IO uint32_t  DMABSSET;                  /*!< DMA channel bytes swap enable set     */
  __IO uint32_t  DMABSCLR;                  /*!< DMA channel bytes swap enable clear   */
} ADI_DMA_TypeDef;
#else // (__NO_MMR_STRUCTS__==0)
#define          DMASTA                                     (*(volatile unsigned long      *) 0x40010000)
#define          DMACFG                                     (*(volatile unsigned long      *) 0x40010004)
#define          DMAPDBPTR                                  (*(volatile unsigned long      *) 0x40010008)
#define          DMAADBPTR                                  (*(volatile unsigned long      *) 0x4001000C)
#define          DMASWREQ                                   (*(volatile unsigned long      *) 0x40010014)
#define          DMARMSKSET                                 (*(volatile unsigned long      *) 0x40010020)
#define          DMARMSKCLR                                 (*(volatile unsigned long      *) 0x40010024)
#define          DMAENSET                                   (*(volatile unsigned long      *) 0x40010028)
#define          DMAENCLR                                   (*(volatile unsigned long      *) 0x4001002C)
#define          DMAALTSET                                  (*(volatile unsigned long      *) 0x40010030)
#define          DMAALTCLR                                  (*(volatile unsigned long      *) 0x40010034)
#define          DMAPRISET                                  (*(volatile unsigned long      *) 0x40010038)
#define          DMAPRICLR                                  (*(volatile unsigned long      *) 0x4001003C)
#define          DMAERRCLR                                  (*(volatile unsigned long      *) 0x4001004C)
#define          DMABSSET                                   (*(volatile unsigned long      *) 0x40010800)
#define          DMABSCLR                                   (*(volatile unsigned long      *) 0x40010804)
#endif // (__NO_MMR_STRUCTS__==0)

/* Reset Value for DMASTA*/
#define DMASTA_RVAL                    0xF0000 

/* DMASTA[CHNLSM1] - Number of available DMA channels minus 1 */
#define DMASTA_CHNLSM1_MSK             (0x1F  << 16 )

/* DMASTA[STATE] - Current state of DMA controller */
#define DMASTA_STATE_MSK               (0xF   << 4  )

/* DMASTA[MENABLE] - Enable status of the controller */
#define DMASTA_MENABLE_BBA             (*(volatile unsigned long *) 0x42200000)
#define DMASTA_MENABLE_MSK             (0x1   << 0  )
#define DMASTA_MENABLE                 (0x1   << 0  )

/* Reset Value for DMACFG*/
#define DMACFG_RVAL                    0x0 

/* DMACFG[MENABLE] - Controller enable */
#define DMACFG_MENABLE_BBA             (*(volatile unsigned long *) 0x42200080)
#define DMACFG_MENABLE_MSK             (0x1   << 0  )
#define DMACFG_MENABLE                 (0x1   << 0  )

/* Reset Value for DMAPDBPTR*/
#define DMAPDBPTR_RVAL                 0x0 

/* DMAPDBPTR[CTRLBASEPTR] - Pointer to the base address of the primary data structure */
#define DMAPDBPTR_CTRLBASEPTR_MSK      (0xFFFFFFFF << 0  )

/* Reset Value for DMAADBPTR*/
#define DMAADBPTR_RVAL                 0x100 

