koshkin-sergey/mbOS/Examples/basic/arch/cortex-m/eval_aducm320/src/include/ADuCM320.h
/* Reset Value for GP1CON*/
#define GP1CON_RVAL                    0x0 

/* GP1CON[CON7] - p1.7  configuration bits */
#define GP1CON_CON7_MSK                (0x3   << 14 )
#define GP1CON_CON7_GPIOIRQ1           (0x0   << 14 ) /* GPIO/IRQ1                */
#define GP1CON_CON7_PWM5               (0x1   << 14 ) /* PWM5                     */
#define GP1CON_CON7_SPI1CS             (0x2   << 14 ) /* SPI1 CS                  */
#define GP1CON_CON7_PLAO7              (0x3   << 14 ) /* PLAO[7]                  */

/* GP1CON[CON6] - p1.6  configuration bits */
#define GP1CON_CON6_MSK                (0x3   << 12 )
#define GP1CON_CON6_GPIO               (0x0   << 12 ) /* GPIO                     */
#define GP1CON_CON6_PWM4               (0x1   << 12 ) /* PWM4                     */
#define GP1CON_CON6_SPI1MOSI           (0x2   << 12 ) /* SPI1 MOSI                */
#define GP1CON_CON6_PLAO6              (0x3   << 12 ) /* PLAO[6]                  */

/* GP1CON[CON5] - p1.5  configuration bits */
#define GP1CON_CON5_MSK                (0x3   << 10 )
#define GP1CON_CON5_GPIO               (0x0   << 10 ) /* GPIO                     */
#define GP1CON_CON5_PWM3               (0x1   << 10 ) /* PWM3                     */
#define GP1CON_CON5_SPI1MISO           (0x2   << 10 ) /* SPI1 MISO                */
#define GP1CON_CON5_PLAO5              (0x3   << 10 ) /* PLAO[5]                  */

/* GP1CON[CON4] - p1.4  configuration bits */
#define GP1CON_CON4_MSK                (0x3   << 8  )
#define GP1CON_CON4_GPIO               (0x0   << 8  ) /* GPIO                     */
#define GP1CON_CON4_PWM2               (0x1   << 8  ) /* PWM2                     */
#define GP1CON_CON4_SPISCLK            (0x2   << 8  ) /* SPI1 SCLK                */
#define GP1CON_CON4_PLAO4              (0x3   << 8  ) /* PLAO[4]                  */

/* GP1CON[CON3] - p1.3  configuration bits */
#define GP1CON_CON3_MSK                (0x3   << 6  )
#define GP1CON_CON3_GPIO               (0x0   << 6  ) /* GPIO                     */
#define GP1CON_CON3_PWM1               (0x1   << 6  ) /* PWM1                     */
#define GP1CON_CON3_PLAI7              (0x3   << 6  ) /* PLAI[7]                  */

/* GP1CON[CON2] - p1.2  configuration bits */
#define GP1CON_CON2_MSK                (0x3   << 4  )
#define GP1CON_CON2_GPIO               (0x0   << 4  ) /* GPIO                     */
#define GP1CON_CON2_PWM0               (0x1   << 4  ) /* PWM0                     */
#define GP1CON_CON2_PLAI6              (0x3   << 4  ) /* PLAI6]                   */

/* GP1CON[CON1] - p1.1  configuration bits */
#define GP1CON_CON1_MSK                (0x3   << 2  )
#define GP1CON_CON1_GPIO               (0x0   << 2  ) /* GPIO                     */
#define GP1CON_CON1_UARTSOUT           (0x1   << 2  ) /* UART SOUT                */
#define GP1CON_CON1_PLACLK1            (0x2   << 2  ) /* PLA CLK1                 */
#define GP1CON_CON1_PLAI5              (0x3   << 2  ) /* PLAI[5]                  */

/* GP1CON[CON0] - p1.0  configuration bits */
#define GP1CON_CON0_MSK                (0x3   << 0  )
#define GP1CON_CON0_GPIO               (0x0   << 0  ) /* GPIO                     */
#define GP1CON_CON0_UARTSIN            (0x1   << 0  ) /* UART SIN                 */
#define GP1CON_CON0_ECLKIN             (0x2   << 0  ) /* External Clock Input     */
#define GP1CON_CON0_PLAI4              (0x3   << 0  ) /* PLAI[4]                  */

/* Reset Value for GP1OE*/
#define GP1OE_RVAL                     0x0 

/* GP1OE[OE7] - Pin Output Drive enable */
#define GP1OE_OE7_BBA                  (*(volatile unsigned long *) 0x4240089C)
#define GP1OE_OE7_MSK                  (0x1   << 7  )
#define GP1OE_OE7                      (0x1   << 7  )
#define GP1OE_OE7_DIS                  (0x0   << 7  )
#define GP1OE_OE7_EN                   (0x1   << 7  )

/* GP1OE[OE6] - Pin Output Drive enable */
#define GP1OE_OE6_BBA                  (*(volatile unsigned long *) 0x42400898)
#define GP1OE_OE6_MSK                  (0x1   << 6  )
#define GP1OE_OE6                      (0x1   << 6  )
#define GP1OE_OE6_DIS                  (0x0   << 6  )
#define GP1OE_OE6_EN                   (0x1   << 6  )

/* GP1OE[OE5] - Pin Output Drive enable */
#define GP1OE_OE5_BBA                  (*(volatile unsigned long *) 0x42400894)
#define GP1OE_OE5_MSK                  (0x1   << 5  )
#define GP1OE_OE5                      (0x1   << 5  )
#define GP1OE_OE5_DIS                  (0x0   << 5  )
#define GP1OE_OE5_EN                   (0x1   << 5  )

/* GP1OE[OE4] - Pin Output Drive enable */
#define GP1OE_OE4_BBA                  (*(volatile unsigned long *) 0x42400890)
#define GP1OE_OE4_MSK                  (0x1   << 4  )
#define GP1OE_OE4                      (0x1   << 4  )
#define GP1OE_OE4_DIS                  (0x0   << 4  )
#define GP1OE_OE4_EN                   (0x1   << 4  )

/* GP1OE[OE3] - Pin Output Drive enable */
#define GP1OE_OE3_BBA                  (*(volatile unsigned long *) 0x4240088C)
#define GP1OE_OE3_MSK                  (0x1   << 3  )
#define GP1OE_OE3                      (0x1   << 3  )
#define GP1OE_OE3_DIS                  (0x0   << 3  )
#define GP1OE_OE3_EN                   (0x1   << 3  )

/* GP1OE[OE2] - Pin Output Drive enable */
#define GP1OE_OE2_BBA                  (*(volatile unsigned long *) 0x42400888)
#define GP1OE_OE2_MSK                  (0x1   << 2  )
#define GP1OE_OE2                      (0x1   << 2  )
#define GP1OE_OE2_DIS                  (0x0   << 2  )
#define GP1OE_OE2_EN                   (0x1   << 2  )

/* GP1OE[OE1] - Pin Output Drive enable */
#define GP1OE_OE1_BBA                  (*(volatile unsigned long *) 0x42400884)
#define GP1OE_OE1_MSK                  (0x1   << 1  )
#define GP1OE_OE1                      (0x1   << 1  )
#define GP1OE_OE1_DIS                  (0x0   << 1  )
#define GP1OE_OE1_EN                   (0x1   << 1  )

/* GP1OE[OE0] - Pin Output Drive enable */
#define GP1OE_OE0_BBA                  (*(volatile unsigned long *) 0x42400880)
#define GP1OE_OE0_MSK                  (0x1   << 0  )
#define GP1OE_OE0                      (0x1   << 0  )
#define GP1OE_OE0_DIS                  (0x0   << 0  )
#define GP1OE_OE0_EN                   (0x1   << 0  )

/* Reset Value for GP1PUL*/
#define GP1PUL_RVAL                    0x0 

