koshkin-sergey/mbOS/Examples/basic/arch/cortex-m/eval_aducm320/src/include/ADuCM320.h
/* Reset Value for GP1OUT*/
#define GP1OUT_RVAL                    0x0 

/* GP1OUT[OUT7] - Data out */
#define GP1OUT_OUT7_BBA                (*(volatile unsigned long *) 0x42400A9C)
#define GP1OUT_OUT7_MSK                (0x1   << 7  )
#define GP1OUT_OUT7                    (0x1   << 7  )
#define GP1OUT_OUT7_LOW                (0x0   << 7  )
#define GP1OUT_OUT7_HIGH               (0x1   << 7  )

/* GP1OUT[OUT6] - Data out */
#define GP1OUT_OUT6_BBA                (*(volatile unsigned long *) 0x42400A98)
#define GP1OUT_OUT6_MSK                (0x1   << 6  )
#define GP1OUT_OUT6                    (0x1   << 6  )
#define GP1OUT_OUT6_LOW                (0x0   << 6  )
#define GP1OUT_OUT6_HIGH               (0x1   << 6  )

/* GP1OUT[OUT5] - Data out */
#define GP1OUT_OUT5_BBA                (*(volatile unsigned long *) 0x42400A94)
#define GP1OUT_OUT5_MSK                (0x1   << 5  )
#define GP1OUT_OUT5                    (0x1   << 5  )
#define GP1OUT_OUT5_LOW                (0x0   << 5  )
#define GP1OUT_OUT5_HIGH               (0x1   << 5  )

/* GP1OUT[OUT4] - Data out */
#define GP1OUT_OUT4_BBA                (*(volatile unsigned long *) 0x42400A90)
#define GP1OUT_OUT4_MSK                (0x1   << 4  )
#define GP1OUT_OUT4                    (0x1   << 4  )
#define GP1OUT_OUT4_LOW                (0x0   << 4  )
#define GP1OUT_OUT4_HIGH               (0x1   << 4  )

/* GP1OUT[OUT3] - Data out */
#define GP1OUT_OUT3_BBA                (*(volatile unsigned long *) 0x42400A8C)
#define GP1OUT_OUT3_MSK                (0x1   << 3  )
#define GP1OUT_OUT3                    (0x1   << 3  )
#define GP1OUT_OUT3_LOW                (0x0   << 3  )
#define GP1OUT_OUT3_HIGH               (0x1   << 3  )

/* GP1OUT[OUT2] - Data out */
#define GP1OUT_OUT2_BBA                (*(volatile unsigned long *) 0x42400A88)
#define GP1OUT_OUT2_MSK                (0x1   << 2  )
#define GP1OUT_OUT2                    (0x1   << 2  )
#define GP1OUT_OUT2_LOW                (0x0   << 2  )
#define GP1OUT_OUT2_HIGH               (0x1   << 2  )

/* GP1OUT[OUT1] - Data out */
#define GP1OUT_OUT1_BBA                (*(volatile unsigned long *) 0x42400A84)
#define GP1OUT_OUT1_MSK                (0x1   << 1  )
#define GP1OUT_OUT1                    (0x1   << 1  )
#define GP1OUT_OUT1_LOW                (0x0   << 1  )
#define GP1OUT_OUT1_HIGH               (0x1   << 1  )

/* GP1OUT[OUT0] - Data out */
#define GP1OUT_OUT0_BBA                (*(volatile unsigned long *) 0x42400A80)
#define GP1OUT_OUT0_MSK                (0x1   << 0  )
#define GP1OUT_OUT0                    (0x1   << 0  )
#define GP1OUT_OUT0_LOW                (0x0   << 0  )
#define GP1OUT_OUT0_HIGH               (0x1   << 0  )

/* Reset Value for GP1SET*/
#define GP1SET_RVAL                    0x0 

/* GP1SET[SET7] - Set the output HIGH for the pin */
#define GP1SET_SET7_BBA                (*(volatile unsigned long *) 0x42400B1C)
#define GP1SET_SET7_MSK                (0x1   << 7  )
#define GP1SET_SET7                    (0x1   << 7  )
#define GP1SET_SET7_SET                (0x1   << 7  )

/* GP1SET[SET6] - Set the output HIGH for the pin */
#define GP1SET_SET6_BBA                (*(volatile unsigned long *) 0x42400B18)
#define GP1SET_SET6_MSK                (0x1   << 6  )
#define GP1SET_SET6                    (0x1   << 6  )
#define GP1SET_SET6_SET                (0x1   << 6  )

/* GP1SET[SET5] - Set the output HIGH for the pin */
#define GP1SET_SET5_BBA                (*(volatile unsigned long *) 0x42400B14)
#define GP1SET_SET5_MSK                (0x1   << 5  )
#define GP1SET_SET5                    (0x1   << 5  )
#define GP1SET_SET5_SET                (0x1   << 5  )

/* GP1SET[SET4] - Set the output HIGH for the pin */
#define GP1SET_SET4_BBA                (*(volatile unsigned long *) 0x42400B10)
#define GP1SET_SET4_MSK                (0x1   << 4  )
#define GP1SET_SET4                    (0x1   << 4  )
#define GP1SET_SET4_SET                (0x1   << 4  )

/* GP1SET[SET3] - Set the output HIGH for the pin */
#define GP1SET_SET3_BBA                (*(volatile unsigned long *) 0x42400B0C)
#define GP1SET_SET3_MSK                (0x1   << 3  )
#define GP1SET_SET3                    (0x1   << 3  )
#define GP1SET_SET3_SET                (0x1   << 3  )

/* GP1SET[SET2] - Set the output HIGH for the pin */
#define GP1SET_SET2_BBA                (*(volatile unsigned long *) 0x42400B08)
#define GP1SET_SET2_MSK                (0x1   << 2  )
#define GP1SET_SET2                    (0x1   << 2  )
#define GP1SET_SET2_SET                (0x1   << 2  )

/* GP1SET[SET1] - Set the output HIGH for the pin */
#define GP1SET_SET1_BBA                (*(volatile unsigned long *) 0x42400B04)
#define GP1SET_SET1_MSK                (0x1   << 1  )
#define GP1SET_SET1                    (0x1   << 1  )
#define GP1SET_SET1_SET                (0x1   << 1  )

/* GP1SET[SET0] - Set the output HIGH for the pin */
#define GP1SET_SET0_BBA                (*(volatile unsigned long *) 0x42400B00)
#define GP1SET_SET0_MSK                (0x1   << 0  )
#define GP1SET_SET0                    (0x1   << 0  )
#define GP1SET_SET0_SET                (0x1   << 0  )

/* Reset Value for GP1CLR*/
#define GP1CLR_RVAL                    0x0 

/* GP1CLR[CLR7] - Set the output low  for the port pin */
#define GP1CLR_CLR7_BBA                (*(volatile unsigned long *) 0x42400B9C)
#define GP1CLR_CLR7_MSK                (0x1   << 7  )
#define GP1CLR_CLR7                    (0x1   << 7  )
#define GP1CLR_CLR7_CLR                (0x1   << 7  )

/* GP1CLR[CLR6] - Set the output low  for the port pin */
#define GP1CLR_CLR6_BBA                (*(volatile unsigned long *) 0x42400B98)
#define GP1CLR_CLR6_MSK                (0x1   << 6  )
#define GP1CLR_CLR6                    (0x1   << 6  )
#define GP1CLR_CLR6_CLR                (0x1   << 6  )

/* GP1CLR[CLR5] - Set the output low  for the port pin */
#define GP1CLR_CLR5_BBA                (*(volatile unsigned long *) 0x42400B94)
#define GP1CLR_CLR5_MSK                (0x1   << 5  )
#define GP1CLR_CLR5                    (0x1   << 5  )
#define GP1CLR_CLR5_CLR                (0x1   << 5  )

/* GP1CLR[CLR4] - Set the output low  for the port pin */
#define GP1CLR_CLR4_BBA                (*(volatile unsigned long *) 0x42400B90)
#define GP1CLR_CLR4_MSK                (0x1   << 4  )
#define GP1CLR_CLR4                    (0x1   << 4  )
#define GP1CLR_CLR4_CLR                (0x1   << 4  )

/* GP1CLR[CLR3] - Set the output low  for the port pin */
#define GP1CLR_CLR3_BBA                (*(volatile unsigned long *) 0x42400B8C)
#define GP1CLR_CLR3_MSK                (0x1   << 3  )
#define GP1CLR_CLR3                    (0x1   << 3  )
#define GP1CLR_CLR3_CLR                (0x1   << 3  )

/* GP1CLR[CLR2] - Set the output low  for the port pin */
#define GP1CLR_CLR2_BBA                (*(volatile unsigned long *) 0x42400B88)
#define GP1CLR_CLR2_MSK                (0x1   << 2  )
#define GP1CLR_CLR2                    (0x1   << 2  )
#define GP1CLR_CLR2_CLR                (0x1   << 2  )

/* GP1CLR[CLR1] - Set the output low  for the port pin */
#define GP1CLR_CLR1_BBA                (*(volatile unsigned long *) 0x42400B84)
#define GP1CLR_CLR1_MSK                (0x1   << 1  )
#define GP1CLR_CLR1                    (0x1   << 1  )
#define GP1CLR_CLR1_CLR                (0x1   << 1  )

/* GP1CLR[CLR0] - Set the output low  for the port pin */
#define GP1CLR_CLR0_BBA                (*(volatile unsigned long *) 0x42400B80)
#define GP1CLR_CLR0_MSK                (0x1   << 0  )
#define GP1CLR_CLR0                    (0x1   << 0  )
#define GP1CLR_CLR0_CLR                (0x1   << 0  )

/* Reset Value for GP1TGL*/
#define GP1TGL_RVAL                    0x0 

