koshkin-sergey/mbOS/Examples/basic/arch/cortex-m/eval_aducm320/src/include/ADuCM320.h
/* GP1TGL[TGL7] - Toggle the output of the port pin */
#define GP1TGL_TGL7_BBA                (*(volatile unsigned long *) 0x42400C1C)
#define GP1TGL_TGL7_MSK                (0x1   << 7  )
#define GP1TGL_TGL7                    (0x1   << 7  )
#define GP1TGL_TGL7_TGL                (0x1   << 7  )

/* GP1TGL[TGL6] - Toggle the output of the port pin */
#define GP1TGL_TGL6_BBA                (*(volatile unsigned long *) 0x42400C18)
#define GP1TGL_TGL6_MSK                (0x1   << 6  )
#define GP1TGL_TGL6                    (0x1   << 6  )
#define GP1TGL_TGL6_TGL                (0x1   << 6  )

/* GP1TGL[TGL5] - Toggle the output of the port pin */
#define GP1TGL_TGL5_BBA                (*(volatile unsigned long *) 0x42400C14)
#define GP1TGL_TGL5_MSK                (0x1   << 5  )
#define GP1TGL_TGL5                    (0x1   << 5  )
#define GP1TGL_TGL5_TGL                (0x1   << 5  )

/* GP1TGL[TGL4] - Toggle the output of the port pin */
#define GP1TGL_TGL4_BBA                (*(volatile unsigned long *) 0x42400C10)
#define GP1TGL_TGL4_MSK                (0x1   << 4  )
#define GP1TGL_TGL4                    (0x1   << 4  )
#define GP1TGL_TGL4_TGL                (0x1   << 4  )

/* GP1TGL[TGL3] - Toggle the output of the port pin */
#define GP1TGL_TGL3_BBA                (*(volatile unsigned long *) 0x42400C0C)
#define GP1TGL_TGL3_MSK                (0x1   << 3  )
#define GP1TGL_TGL3                    (0x1   << 3  )
#define GP1TGL_TGL3_TGL                (0x1   << 3  )

/* GP1TGL[TGL2] - Toggle the output of the port pin */
#define GP1TGL_TGL2_BBA                (*(volatile unsigned long *) 0x42400C08)
#define GP1TGL_TGL2_MSK                (0x1   << 2  )
#define GP1TGL_TGL2                    (0x1   << 2  )
#define GP1TGL_TGL2_TGL                (0x1   << 2  )

/* GP1TGL[TGL1] - Toggle the output of the port pin */
#define GP1TGL_TGL1_BBA                (*(volatile unsigned long *) 0x42400C04)
#define GP1TGL_TGL1_MSK                (0x1   << 1  )
#define GP1TGL_TGL1                    (0x1   << 1  )
#define GP1TGL_TGL1_TGL                (0x1   << 1  )

/* GP1TGL[TGL0] - Toggle the output of the port pin */
#define GP1TGL_TGL0_BBA                (*(volatile unsigned long *) 0x42400C00)
#define GP1TGL_TGL0_MSK                (0x1   << 0  )
#define GP1TGL_TGL0                    (0x1   << 0  )
#define GP1TGL_TGL0_TGL                (0x1   << 0  )

/* Reset Value for GP1ODE*/
#define GP1ODE_RVAL                    0x0 

/* GP1ODE[ODE7] - Open drain enable */
#define GP1ODE_ODE7_BBA                (*(volatile unsigned long *) 0x42400C9C)
#define GP1ODE_ODE7_MSK                (0x1   << 7  )
#define GP1ODE_ODE7                    (0x1   << 7  )
#define GP1ODE_ODE7_DIS                (0x0   << 7  )
#define GP1ODE_ODE7_EN                 (0x1   << 7  )

/* GP1ODE[ODE6] - Open drain enable */
#define GP1ODE_ODE6_BBA                (*(volatile unsigned long *) 0x42400C98)
#define GP1ODE_ODE6_MSK                (0x1   << 6  )
#define GP1ODE_ODE6                    (0x1   << 6  )
#define GP1ODE_ODE6_DIS                (0x0   << 6  )
#define GP1ODE_ODE6_EN                 (0x1   << 6  )

/* GP1ODE[ODE5] - Open drain enable */
#define GP1ODE_ODE5_BBA                (*(volatile unsigned long *) 0x42400C94)
#define GP1ODE_ODE5_MSK                (0x1   << 5  )
#define GP1ODE_ODE5                    (0x1   << 5  )
#define GP1ODE_ODE5_DIS                (0x0   << 5  )
#define GP1ODE_ODE5_EN                 (0x1   << 5  )

/* GP1ODE[ODE4] - Open drain enable */
#define GP1ODE_ODE4_BBA                (*(volatile unsigned long *) 0x42400C90)
#define GP1ODE_ODE4_MSK                (0x1   << 4  )
#define GP1ODE_ODE4                    (0x1   << 4  )
#define GP1ODE_ODE4_DIS                (0x0   << 4  )
#define GP1ODE_ODE4_EN                 (0x1   << 4  )

/* GP1ODE[ODE3] - Open drain enable */
#define GP1ODE_ODE3_BBA                (*(volatile unsigned long *) 0x42400C8C)
#define GP1ODE_ODE3_MSK                (0x1   << 3  )
#define GP1ODE_ODE3                    (0x1   << 3  )
#define GP1ODE_ODE3_DIS                (0x0   << 3  )
#define GP1ODE_ODE3_EN                 (0x1   << 3  )

/* GP1ODE[ODE2] - Open drain enable */
#define GP1ODE_ODE2_BBA                (*(volatile unsigned long *) 0x42400C88)
#define GP1ODE_ODE2_MSK                (0x1   << 2  )
#define GP1ODE_ODE2                    (0x1   << 2  )
#define GP1ODE_ODE2_DIS                (0x0   << 2  )
#define GP1ODE_ODE2_EN                 (0x1   << 2  )

/* GP1ODE[ODE1] - Open drain enable */
#define GP1ODE_ODE1_BBA                (*(volatile unsigned long *) 0x42400C84)
#define GP1ODE_ODE1_MSK                (0x1   << 1  )
#define GP1ODE_ODE1                    (0x1   << 1  )
#define GP1ODE_ODE1_DIS                (0x0   << 1  )
#define GP1ODE_ODE1_EN                 (0x1   << 1  )

/* GP1ODE[ODE0] - Open drain enable */
#define GP1ODE_ODE0_BBA                (*(volatile unsigned long *) 0x42400C80)
#define GP1ODE_ODE0_MSK                (0x1   << 0  )
#define GP1ODE_ODE0                    (0x1   << 0  )
#define GP1ODE_ODE0_DIS                (0x0   << 0  )
#define GP1ODE_ODE0_EN                 (0x1   << 0  )


// ------------------------------------------------------------------------------------------------
// -----                                        GPIO_FIX                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief gpio (pADI_GPIO_FIX)
  */

#if (__NO_MMR_STRUCTS__==0)
typedef struct {                            /*!< pADI_GPIO_FIX Structure                */
  __IO uint8_t   GP1SET;                    /*!< GPIO Port 1 data out set              */
  __I  uint8_t   RESERVED0[3];
  __IO uint8_t   GP2CLR;                    /*!< GPIO Port 2 data out clear            */
} ADI_GPIO_FIX_TypeDef;
#endif // (__NO_MMR_STRUCTS__==0)


#if (__NO_MMR_STRUCTS__==1)

#define          GP2CON                                     (*(volatile unsigned short int *) 0x40020080)
#define          GP2OE                                      (*(volatile unsigned char      *) 0x40020084)
#define          GP2PUL                                     (*(volatile unsigned char      *) 0x40020088)
#define          GP2IE                                      (*(volatile unsigned char      *) 0x4002008C)
#define          GP2IN                                      (*(volatile unsigned char      *) 0x40020090)
#define          GP2OUT                                     (*(volatile unsigned char      *) 0x40020094)
#define          GP2SET                                     (*(volatile unsigned char      *) 0x40020098)
#define          GP2CLR                                     (*(volatile unsigned char      *) 0x4002009C)
#define          GP2TGL                                     (*(volatile unsigned char      *) 0x400200A0)
#define          GP2ODE                                     (*(volatile unsigned char      *) 0x400200A4)
#endif // (__NO_MMR_STRUCTS__==1)

/* Reset Value for GP2CON*/
#define GP2CON_RVAL                    0x10 

