koshkin-sergey/mbOS/Examples/basic/arch/cortex-m/eval_aducm320/src/include/ADuCM320.h
/* GP2PUL[PUL3] - Pin Pull up enable */
#define GP2PUL_PUL3_BBA                (*(volatile unsigned long *) 0x4240110C)
#define GP2PUL_PUL3_MSK                (0x1   << 3  )
#define GP2PUL_PUL3                    (0x1   << 3  )
#define GP2PUL_PUL3_DIS                (0x0   << 3  )
#define GP2PUL_PUL3_EN                 (0x1   << 3  )

/* GP2PUL[PUL2] - Pin Pull up enable */
#define GP2PUL_PUL2_BBA                (*(volatile unsigned long *) 0x42401108)
#define GP2PUL_PUL2_MSK                (0x1   << 2  )
#define GP2PUL_PUL2                    (0x1   << 2  )
#define GP2PUL_PUL2_DIS                (0x0   << 2  )
#define GP2PUL_PUL2_EN                 (0x1   << 2  )

/* GP2PUL[PUL1] - Pin Pull up enable */
#define GP2PUL_PUL1_BBA                (*(volatile unsigned long *) 0x42401104)
#define GP2PUL_PUL1_MSK                (0x1   << 1  )
#define GP2PUL_PUL1                    (0x1   << 1  )
#define GP2PUL_PUL1_DIS                (0x0   << 1  )
#define GP2PUL_PUL1_EN                 (0x1   << 1  )

/* GP2PUL[PUL0] - Pin Pull up enable */
#define GP2PUL_PUL0_BBA                (*(volatile unsigned long *) 0x42401100)
#define GP2PUL_PUL0_MSK                (0x1   << 0  )
#define GP2PUL_PUL0                    (0x1   << 0  )
#define GP2PUL_PUL0_DIS                (0x0   << 0  )
#define GP2PUL_PUL0_EN                 (0x1   << 0  )

/* Reset Value for GP2IE*/
#define GP2IE_RVAL                     0x0 

/* GP2IE[IEN7] - Input path enable */
#define GP2IE_IEN7_BBA                 (*(volatile unsigned long *) 0x4240119C)
#define GP2IE_IEN7_MSK                 (0x1   << 7  )
#define GP2IE_IEN7                     (0x1   << 7  )
#define GP2IE_IEN7_DIS                 (0x0   << 7  )
#define GP2IE_IEN7_EN                  (0x1   << 7  )

/* GP2IE[IEN6] - Input path enable */
#define GP2IE_IEN6_BBA                 (*(volatile unsigned long *) 0x42401198)
#define GP2IE_IEN6_MSK                 (0x1   << 6  )
#define GP2IE_IEN6                     (0x1   << 6  )
#define GP2IE_IEN6_DIS                 (0x0   << 6  )
#define GP2IE_IEN6_EN                  (0x1   << 6  )

/* GP2IE[IEN5] - Input path enable */
#define GP2IE_IEN5_BBA                 (*(volatile unsigned long *) 0x42401194)
#define GP2IE_IEN5_MSK                 (0x1   << 5  )
#define GP2IE_IEN5                     (0x1   << 5  )
#define GP2IE_IEN5_DIS                 (0x0   << 5  )
#define GP2IE_IEN5_EN                  (0x1   << 5  )

/* GP2IE[IEN4] - Input path enable */
#define GP2IE_IEN4_BBA                 (*(volatile unsigned long *) 0x42401190)
#define GP2IE_IEN4_MSK                 (0x1   << 4  )
#define GP2IE_IEN4                     (0x1   << 4  )
#define GP2IE_IEN4_DIS                 (0x0   << 4  )
#define GP2IE_IEN4_EN                  (0x1   << 4  )

/* GP2IE[IEN3] - Input path enable */
#define GP2IE_IEN3_BBA                 (*(volatile unsigned long *) 0x4240118C)
#define GP2IE_IEN3_MSK                 (0x1   << 3  )
#define GP2IE_IEN3                     (0x1   << 3  )
#define GP2IE_IEN3_DIS                 (0x0   << 3  )
#define GP2IE_IEN3_EN                  (0x1   << 3  )

/* GP2IE[IEN2] - Input path enable */
#define GP2IE_IEN2_BBA                 (*(volatile unsigned long *) 0x42401188)
#define GP2IE_IEN2_MSK                 (0x1   << 2  )
#define GP2IE_IEN2                     (0x1   << 2  )
#define GP2IE_IEN2_DIS                 (0x0   << 2  )
#define GP2IE_IEN2_EN                  (0x1   << 2  )

/* GP2IE[IEN1] - Input path enable */
#define GP2IE_IEN1_BBA                 (*(volatile unsigned long *) 0x42401184)
#define GP2IE_IEN1_MSK                 (0x1   << 1  )
#define GP2IE_IEN1                     (0x1   << 1  )
#define GP2IE_IEN1_DIS                 (0x0   << 1  )
#define GP2IE_IEN1_EN                  (0x1   << 1  )

/* GP2IE[IEN0] - Input path enable */
#define GP2IE_IEN0_BBA                 (*(volatile unsigned long *) 0x42401180)
#define GP2IE_IEN0_MSK                 (0x1   << 0  )
#define GP2IE_IEN0                     (0x1   << 0  )
#define GP2IE_IEN0_DIS                 (0x0   << 0  )
#define GP2IE_IEN0_EN                  (0x1   << 0  )

/* Reset Value for GP2IN*/
#define GP2IN_RVAL                     0x0 

/* GP2IN[IN7] - Registered data input */
#define GP2IN_IN7_BBA                  (*(volatile unsigned long *) 0x4240121C)
#define GP2IN_IN7_MSK                  (0x1   << 7  )
#define GP2IN_IN7                      (0x1   << 7  )
#define GP2IN_IN7_LOW                  (0x0   << 7  )
#define GP2IN_IN7_HIGH                 (0x1   << 7  )

/* GP2IN[IN6] - Registered data input */
#define GP2IN_IN6_BBA                  (*(volatile unsigned long *) 0x42401218)
#define GP2IN_IN6_MSK                  (0x1   << 6  )
#define GP2IN_IN6                      (0x1   << 6  )
#define GP2IN_IN6_LOW                  (0x0   << 6  )
#define GP2IN_IN6_HIGH                 (0x1   << 6  )

/* GP2IN[IN5] - Registered data input */
#define GP2IN_IN5_BBA                  (*(volatile unsigned long *) 0x42401214)
#define GP2IN_IN5_MSK                  (0x1   << 5  )
#define GP2IN_IN5                      (0x1   << 5  )
#define GP2IN_IN5_LOW                  (0x0   << 5  )
#define GP2IN_IN5_HIGH                 (0x1   << 5  )

/* GP2IN[IN4] - Registered data input */
#define GP2IN_IN4_BBA                  (*(volatile unsigned long *) 0x42401210)
#define GP2IN_IN4_MSK                  (0x1   << 4  )
#define GP2IN_IN4                      (0x1   << 4  )
#define GP2IN_IN4_LOW                  (0x0   << 4  )
#define GP2IN_IN4_HIGH                 (0x1   << 4  )

/* GP2IN[IN3] - Registered data input */
#define GP2IN_IN3_BBA                  (*(volatile unsigned long *) 0x4240120C)
#define GP2IN_IN3_MSK                  (0x1   << 3  )
#define GP2IN_IN3                      (0x1   << 3  )
#define GP2IN_IN3_LOW                  (0x0   << 3  )
#define GP2IN_IN3_HIGH                 (0x1   << 3  )

/* GP2IN[IN2] - Registered data input */
#define GP2IN_IN2_BBA                  (*(volatile unsigned long *) 0x42401208)
#define GP2IN_IN2_MSK                  (0x1   << 2  )
#define GP2IN_IN2                      (0x1   << 2  )
#define GP2IN_IN2_LOW                  (0x0   << 2  )
#define GP2IN_IN2_HIGH                 (0x1   << 2  )

/* GP2IN[IN1] - Registered data input */
#define GP2IN_IN1_BBA                  (*(volatile unsigned long *) 0x42401204)
#define GP2IN_IN1_MSK                  (0x1   << 1  )
#define GP2IN_IN1                      (0x1   << 1  )
#define GP2IN_IN1_LOW                  (0x0   << 1  )
#define GP2IN_IN1_HIGH                 (0x1   << 1  )

/* GP2IN[IN0] - Registered data input */
#define GP2IN_IN0_BBA                  (*(volatile unsigned long *) 0x42401200)
#define GP2IN_IN0_MSK                  (0x1   << 0  )
#define GP2IN_IN0                      (0x1   << 0  )
#define GP2IN_IN0_LOW                  (0x0   << 0  )
#define GP2IN_IN0_HIGH                 (0x1   << 0  )

/* Reset Value for GP2OUT*/
#define GP2OUT_RVAL                    0x0 

/* GP2OUT[OUT7] - Data out */
#define GP2OUT_OUT7_BBA                (*(volatile unsigned long *) 0x4240129C)
#define GP2OUT_OUT7_MSK                (0x1   << 7  )
#define GP2OUT_OUT7                    (0x1   << 7  )
#define GP2OUT_OUT7_LOW                (0x0   << 7  )
#define GP2OUT_OUT7_HIGH               (0x1   << 7  )

/* GP2OUT[OUT6] - Data out */
#define GP2OUT_OUT6_BBA                (*(volatile unsigned long *) 0x42401298)
#define GP2OUT_OUT6_MSK                (0x1   << 6  )
#define GP2OUT_OUT6                    (0x1   << 6  )
#define GP2OUT_OUT6_LOW                (0x0   << 6  )
#define GP2OUT_OUT6_HIGH               (0x1   << 6  )

/* GP2OUT[OUT5] - Data out */
#define GP2OUT_OUT5_BBA                (*(volatile unsigned long *) 0x42401294)
#define GP2OUT_OUT5_MSK                (0x1   << 5  )
#define GP2OUT_OUT5                    (0x1   << 5  )
#define GP2OUT_OUT5_LOW                (0x0   << 5  )
#define GP2OUT_OUT5_HIGH               (0x1   << 5  )

