koshkin-sergey/mbOS/Examples/basic/arch/cortex-m/eval_aducm320/src/include/ADuCM320.h
/* GP2OUT[OUT4] - Data out */
#define GP2OUT_OUT4_BBA                (*(volatile unsigned long *) 0x42401290)
#define GP2OUT_OUT4_MSK                (0x1   << 4  )
#define GP2OUT_OUT4                    (0x1   << 4  )
#define GP2OUT_OUT4_LOW                (0x0   << 4  )
#define GP2OUT_OUT4_HIGH               (0x1   << 4  )

/* GP2OUT[OUT3] - Data out */
#define GP2OUT_OUT3_BBA                (*(volatile unsigned long *) 0x4240128C)
#define GP2OUT_OUT3_MSK                (0x1   << 3  )
#define GP2OUT_OUT3                    (0x1   << 3  )
#define GP2OUT_OUT3_LOW                (0x0   << 3  )
#define GP2OUT_OUT3_HIGH               (0x1   << 3  )

/* GP2OUT[OUT2] - Data out */
#define GP2OUT_OUT2_BBA                (*(volatile unsigned long *) 0x42401288)
#define GP2OUT_OUT2_MSK                (0x1   << 2  )
#define GP2OUT_OUT2                    (0x1   << 2  )
#define GP2OUT_OUT2_LOW                (0x0   << 2  )
#define GP2OUT_OUT2_HIGH               (0x1   << 2  )

/* GP2OUT[OUT1] - Data out */
#define GP2OUT_OUT1_BBA                (*(volatile unsigned long *) 0x42401284)
#define GP2OUT_OUT1_MSK                (0x1   << 1  )
#define GP2OUT_OUT1                    (0x1   << 1  )
#define GP2OUT_OUT1_LOW                (0x0   << 1  )
#define GP2OUT_OUT1_HIGH               (0x1   << 1  )

/* GP2OUT[OUT0] - Data out */
#define GP2OUT_OUT0_BBA                (*(volatile unsigned long *) 0x42401280)
#define GP2OUT_OUT0_MSK                (0x1   << 0  )
#define GP2OUT_OUT0                    (0x1   << 0  )
#define GP2OUT_OUT0_LOW                (0x0   << 0  )
#define GP2OUT_OUT0_HIGH               (0x1   << 0  )

/* Reset Value for GP2SET*/
#define GP2SET_RVAL                    0x0 

/* GP2SET[SET7] - Set the output HIGH for the pin */
#define GP2SET_SET7_BBA                (*(volatile unsigned long *) 0x4240131C)
#define GP2SET_SET7_MSK                (0x1   << 7  )
#define GP2SET_SET7                    (0x1   << 7  )
#define GP2SET_SET7_SET                (0x1   << 7  )

/* GP2SET[SET6] - Set the output HIGH for the pin */
#define GP2SET_SET6_BBA                (*(volatile unsigned long *) 0x42401318)
#define GP2SET_SET6_MSK                (0x1   << 6  )
#define GP2SET_SET6                    (0x1   << 6  )
#define GP2SET_SET6_SET                (0x1   << 6  )

/* GP2SET[SET5] - Set the output HIGH for the pin */
#define GP2SET_SET5_BBA                (*(volatile unsigned long *) 0x42401314)
#define GP2SET_SET5_MSK                (0x1   << 5  )
#define GP2SET_SET5                    (0x1   << 5  )
#define GP2SET_SET5_SET                (0x1   << 5  )

/* GP2SET[SET4] - Set the output HIGH for the pin */
#define GP2SET_SET4_BBA                (*(volatile unsigned long *) 0x42401310)
#define GP2SET_SET4_MSK                (0x1   << 4  )
#define GP2SET_SET4                    (0x1   << 4  )
#define GP2SET_SET4_SET                (0x1   << 4  )

/* GP2SET[SET3] - Set the output HIGH for the pin */
#define GP2SET_SET3_BBA                (*(volatile unsigned long *) 0x4240130C)
#define GP2SET_SET3_MSK                (0x1   << 3  )
#define GP2SET_SET3                    (0x1   << 3  )
#define GP2SET_SET3_SET                (0x1   << 3  )

/* GP2SET[SET2] - Set the output HIGH for the pin */
#define GP2SET_SET2_BBA                (*(volatile unsigned long *) 0x42401308)
#define GP2SET_SET2_MSK                (0x1   << 2  )
#define GP2SET_SET2                    (0x1   << 2  )
#define GP2SET_SET2_SET                (0x1   << 2  )

/* GP2SET[SET1] - Set the output HIGH for the pin */
#define GP2SET_SET1_BBA                (*(volatile unsigned long *) 0x42401304)
#define GP2SET_SET1_MSK                (0x1   << 1  )
#define GP2SET_SET1                    (0x1   << 1  )
#define GP2SET_SET1_SET                (0x1   << 1  )

/* GP2SET[SET0] - Set the output HIGH for the pin */
#define GP2SET_SET0_BBA                (*(volatile unsigned long *) 0x42401300)
#define GP2SET_SET0_MSK                (0x1   << 0  )
#define GP2SET_SET0                    (0x1   << 0  )
#define GP2SET_SET0_SET                (0x1   << 0  )

/* Reset Value for GP2CLR*/
#define GP2CLR_RVAL                    0x0 

/* GP2CLR[CLR7] - Set the output low  for the port pin */
#define GP2CLR_CLR7_BBA                (*(volatile unsigned long *) 0x4240139C)
#define GP2CLR_CLR7_MSK                (0x1   << 7  )
#define GP2CLR_CLR7                    (0x1   << 7  )
#define GP2CLR_CLR7_CLR                (0x1   << 7  )

/* GP2CLR[CLR6] - Set the output low  for the port pin */
#define GP2CLR_CLR6_BBA                (*(volatile unsigned long *) 0x42401398)
#define GP2CLR_CLR6_MSK                (0x1   << 6  )
#define GP2CLR_CLR6                    (0x1   << 6  )
#define GP2CLR_CLR6_CLR                (0x1   << 6  )

/* GP2CLR[CLR5] - Set the output low  for the port pin */
#define GP2CLR_CLR5_BBA                (*(volatile unsigned long *) 0x42401394)
#define GP2CLR_CLR5_MSK                (0x1   << 5  )
#define GP2CLR_CLR5                    (0x1   << 5  )
#define GP2CLR_CLR5_CLR                (0x1   << 5  )

/* GP2CLR[CLR4] - Set the output low  for the port pin */
#define GP2CLR_CLR4_BBA                (*(volatile unsigned long *) 0x42401390)
#define GP2CLR_CLR4_MSK                (0x1   << 4  )
#define GP2CLR_CLR4                    (0x1   << 4  )
#define GP2CLR_CLR4_CLR                (0x1   << 4  )

/* GP2CLR[CLR3] - Set the output low  for the port pin */
#define GP2CLR_CLR3_BBA                (*(volatile unsigned long *) 0x4240138C)
#define GP2CLR_CLR3_MSK                (0x1   << 3  )
#define GP2CLR_CLR3                    (0x1   << 3  )
#define GP2CLR_CLR3_CLR                (0x1   << 3  )

/* GP2CLR[CLR2] - Set the output low  for the port pin */
#define GP2CLR_CLR2_BBA                (*(volatile unsigned long *) 0x42401388)
#define GP2CLR_CLR2_MSK                (0x1   << 2  )
#define GP2CLR_CLR2                    (0x1   << 2  )
#define GP2CLR_CLR2_CLR                (0x1   << 2  )

