koshkin-sergey/mbOS/Examples/basic/arch/cortex-m/eval_aducm320/src/include/ADuCM320.h
/* GP3CON[CON7] - p3.7  configuration bits */
#define GP3CON_CON7_MSK                (0x3   << 14 )
#define GP3CON_CON7_GPIO               (0x0   << 14 ) /* GPIO                     */
#define GP3CON_CON7_VDAC2              (0x1   << 14 ) /* VDAC2                    */
#define GP3CON_CON7_PLAO15             (0x3   << 14 ) /* PLAO[15]                 */

/* GP3CON[CON6] - p3.6  configuration bits */
#define GP3CON_CON6_MSK                (0x3   << 12 )
#define GP3CON_CON6_GPIO               (0x0   << 12 ) /* GPIO                     */
#define GP3CON_CON6_MDIO               (0x1   << 12 ) /* MDIO MDIO                */
#define GP3CON_CON6_PLAO14             (0x3   << 12 ) /* PLAO[14]                 */

/* GP3CON[CON5] - p3.5  configuration bits */
#define GP3CON_CON5_MSK                (0x3   << 10 )
#define GP3CON_CON5_GPIO               (0x0   << 10 ) /* GPIO                     */
#define GP3CON_CON5_MCLK               (0x1   << 10 ) /* MDIO MCK                 */
#define GP3CON_CON5_PLAO13             (0x3   << 10 ) /* PLAO[13]                 */

/* GP3CON[CON4] - p3.4  configuration bits */
#define GP3CON_CON4_MSK                (0x3   << 8  )
#define GP3CON_CON4_GPIO               (0x0   << 8  ) /* GPIO                     */
#define GP3CON_CON4_PRTADDR4           (0x1   << 8  ) /* MDIO PRTADDR4            */
#define GP3CON_CON4_PLAO12             (0x3   << 8  ) /* PLAO[12]                 */

/* GP3CON[CON3] - p3.3  configuration bits */
#define GP3CON_CON3_MSK                (0x3   << 6  )
#define GP3CON_CON3_GPIO               (0x0   << 6  ) /* GPIO                     */
#define GP3CON_CON3_PRTADDR3           (0x1   << 6  ) /* MDIO PRTADDR3            */
#define GP3CON_CON3_PLAI15             (0x3   << 6  ) /* PLAI[15]                 */

/* GP3CON[CON2] - p3.2  configuration bits */
#define GP3CON_CON2_MSK                (0x3   << 4  )
#define GP3CON_CON2_GPIO               (0x0   << 4  ) /* GPIO                     */
#define GP3CON_CON2_PRTADDR2           (0x1   << 4  ) /* MDIO PRTADDR2            */
#define GP3CON_CON2_PLAI14             (0x3   << 4  ) /* PLAI[14]                 */

/* GP3CON[CON1] - p3.1  configuration bits */
#define GP3CON_CON1_MSK                (0x3   << 2  )
#define GP3CON_CON1_GPIO               (0x0   << 2  ) /* GPIO                     */
#define GP3CON_CON1_PRTADDR1           (0x1   << 2  ) /* MDIO PRTADDR1            */
#define GP3CON_CON1_PLAI13             (0x3   << 2  ) /* PLAI[13]                 */

/* GP3CON[CON0] - p3.0  configuration bits */
#define GP3CON_CON0_MSK                (0x3   << 0  )
#define GP3CON_CON0_GPIO               (0x0   << 0  ) /* GPIO                     */
#define GP3CON_CON0_PRTADDR0           (0x1   << 0  ) /* MDIO PRTADDR0            */
#define GP3CON_CON0_PLAI12             (0x3   << 0  ) /* PLAI[12]                 */

/* Reset Value for GP3OE*/
#define GP3OE_RVAL                     0x0 

/* GP3OE[OE7] - Pin Output Drive enable */
#define GP3OE_OE7_BBA                  (*(volatile unsigned long *) 0x4240189C)
#define GP3OE_OE7_MSK                  (0x1   << 7  )
#define GP3OE_OE7                      (0x1   << 7  )
#define GP3OE_OE7_DIS                  (0x0   << 7  )
#define GP3OE_OE7_EN                   (0x1   << 7  )

/* GP3OE[OE6] - Pin Output Drive enable */
#define GP3OE_OE6_BBA                  (*(volatile unsigned long *) 0x42401898)
#define GP3OE_OE6_MSK                  (0x1   << 6  )
#define GP3OE_OE6                      (0x1   << 6  )
#define GP3OE_OE6_DIS                  (0x0   << 6  )
#define GP3OE_OE6_EN                   (0x1   << 6  )

/* GP3OE[OE5] - Pin Output Drive enable */
#define GP3OE_OE5_BBA                  (*(volatile unsigned long *) 0x42401894)
#define GP3OE_OE5_MSK                  (0x1   << 5  )
#define GP3OE_OE5                      (0x1   << 5  )
#define GP3OE_OE5_DIS                  (0x0   << 5  )
#define GP3OE_OE5_EN                   (0x1   << 5  )

/* GP3OE[OE4] - Pin Output Drive enable */
#define GP3OE_OE4_BBA                  (*(volatile unsigned long *) 0x42401890)
#define GP3OE_OE4_MSK                  (0x1   << 4  )
#define GP3OE_OE4                      (0x1   << 4  )
#define GP3OE_OE4_DIS                  (0x0   << 4  )
#define GP3OE_OE4_EN                   (0x1   << 4  )

/* GP3OE[OE3] - Pin Output Drive enable */
#define GP3OE_OE3_BBA                  (*(volatile unsigned long *) 0x4240188C)
#define GP3OE_OE3_MSK                  (0x1   << 3  )
#define GP3OE_OE3                      (0x1   << 3  )
#define GP3OE_OE3_DIS                  (0x0   << 3  )
#define GP3OE_OE3_EN                   (0x1   << 3  )

/* GP3OE[OE2] - Pin Output Drive enable */
#define GP3OE_OE2_BBA                  (*(volatile unsigned long *) 0x42401888)
#define GP3OE_OE2_MSK                  (0x1   << 2  )
#define GP3OE_OE2                      (0x1   << 2  )
#define GP3OE_OE2_DIS                  (0x0   << 2  )
#define GP3OE_OE2_EN                   (0x1   << 2  )

/* GP3OE[OE1] - Pin Output Drive enable */
#define GP3OE_OE1_BBA                  (*(volatile unsigned long *) 0x42401884)
#define GP3OE_OE1_MSK                  (0x1   << 1  )
#define GP3OE_OE1                      (0x1   << 1  )
#define GP3OE_OE1_DIS                  (0x0   << 1  )
#define GP3OE_OE1_EN                   (0x1   << 1  )

/* GP3OE[OE0] - Pin Output Drive enable */
#define GP3OE_OE0_BBA                  (*(volatile unsigned long *) 0x42401880)
#define GP3OE_OE0_MSK                  (0x1   << 0  )
#define GP3OE_OE0                      (0x1   << 0  )
#define GP3OE_OE0_DIS                  (0x0   << 0  )
#define GP3OE_OE0_EN                   (0x1   << 0  )

/* Reset Value for GP3PUL*/
#define GP3PUL_RVAL                    0x0 

/* GP3PUL[PUL7] - Pin Pull up enable */
#define GP3PUL_PUL7_BBA                (*(volatile unsigned long *) 0x4240191C)
#define GP3PUL_PUL7_MSK                (0x1   << 7  )
#define GP3PUL_PUL7                    (0x1   << 7  )
#define GP3PUL_PUL7_DIS                (0x0   << 7  )
#define GP3PUL_PUL7_EN                 (0x1   << 7  )

/* GP3PUL[PUL6] - Pin Pull up enable */
#define GP3PUL_PUL6_BBA                (*(volatile unsigned long *) 0x42401918)
#define GP3PUL_PUL6_MSK                (0x1   << 6  )
#define GP3PUL_PUL6                    (0x1   << 6  )
#define GP3PUL_PUL6_DIS                (0x0   << 6  )
#define GP3PUL_PUL6_EN                 (0x1   << 6  )

/* GP3PUL[PUL5] - Pin Pull up enable */
#define GP3PUL_PUL5_BBA                (*(volatile unsigned long *) 0x42401914)
#define GP3PUL_PUL5_MSK                (0x1   << 5  )
#define GP3PUL_PUL5                    (0x1   << 5  )
#define GP3PUL_PUL5_DIS                (0x0   << 5  )
#define GP3PUL_PUL5_EN                 (0x1   << 5  )

