koshkin-sergey/mbOS/Examples/basic/arch/cortex-m/eval_aducm320/src/include/ADuCM320.h
/* GP3PUL[PUL4] - Pin Pull up enable */
#define GP3PUL_PUL4_BBA                (*(volatile unsigned long *) 0x42401910)
#define GP3PUL_PUL4_MSK                (0x1   << 4  )
#define GP3PUL_PUL4                    (0x1   << 4  )
#define GP3PUL_PUL4_DIS                (0x0   << 4  )
#define GP3PUL_PUL4_EN                 (0x1   << 4  )

/* GP3PUL[PUL3] - Pin Pull up enable */
#define GP3PUL_PUL3_BBA                (*(volatile unsigned long *) 0x4240190C)
#define GP3PUL_PUL3_MSK                (0x1   << 3  )
#define GP3PUL_PUL3                    (0x1   << 3  )
#define GP3PUL_PUL3_DIS                (0x0   << 3  )
#define GP3PUL_PUL3_EN                 (0x1   << 3  )

/* GP3PUL[PUL2] - Pin Pull up enable */
#define GP3PUL_PUL2_BBA                (*(volatile unsigned long *) 0x42401908)
#define GP3PUL_PUL2_MSK                (0x1   << 2  )
#define GP3PUL_PUL2                    (0x1   << 2  )
#define GP3PUL_PUL2_DIS                (0x0   << 2  )
#define GP3PUL_PUL2_EN                 (0x1   << 2  )

/* GP3PUL[PUL1] - Pin Pull up enable */
#define GP3PUL_PUL1_BBA                (*(volatile unsigned long *) 0x42401904)
#define GP3PUL_PUL1_MSK                (0x1   << 1  )
#define GP3PUL_PUL1                    (0x1   << 1  )
#define GP3PUL_PUL1_DIS                (0x0   << 1  )
#define GP3PUL_PUL1_EN                 (0x1   << 1  )

/* GP3PUL[PUL0] - Pin Pull up enable */
#define GP3PUL_PUL0_BBA                (*(volatile unsigned long *) 0x42401900)
#define GP3PUL_PUL0_MSK                (0x1   << 0  )
#define GP3PUL_PUL0                    (0x1   << 0  )
#define GP3PUL_PUL0_DIS                (0x0   << 0  )
#define GP3PUL_PUL0_EN                 (0x1   << 0  )

/* Reset Value for GP3IE*/
#define GP3IE_RVAL                     0x0 

/* GP3IE[IEN7] - Input path enable */
#define GP3IE_IEN7_BBA                 (*(volatile unsigned long *) 0x4240199C)
#define GP3IE_IEN7_MSK                 (0x1   << 7  )
#define GP3IE_IEN7                     (0x1   << 7  )
#define GP3IE_IEN7_DIS                 (0x0   << 7  )
#define GP3IE_IEN7_EN                  (0x1   << 7  )

/* GP3IE[IEN6] - Input path enable */
#define GP3IE_IEN6_BBA                 (*(volatile unsigned long *) 0x42401998)
#define GP3IE_IEN6_MSK                 (0x1   << 6  )
#define GP3IE_IEN6                     (0x1   << 6  )
#define GP3IE_IEN6_DIS                 (0x0   << 6  )
#define GP3IE_IEN6_EN                  (0x1   << 6  )

/* GP3IE[IEN5] - Input path enable */
#define GP3IE_IEN5_BBA                 (*(volatile unsigned long *) 0x42401994)
#define GP3IE_IEN5_MSK                 (0x1   << 5  )
#define GP3IE_IEN5                     (0x1   << 5  )
#define GP3IE_IEN5_DIS                 (0x0   << 5  )
#define GP3IE_IEN5_EN                  (0x1   << 5  )

/* GP3IE[IEN4] - Input path enable */
#define GP3IE_IEN4_BBA                 (*(volatile unsigned long *) 0x42401990)
#define GP3IE_IEN4_MSK                 (0x1   << 4  )
#define GP3IE_IEN4                     (0x1   << 4  )
#define GP3IE_IEN4_DIS                 (0x0   << 4  )
#define GP3IE_IEN4_EN                  (0x1   << 4  )

/* GP3IE[IEN3] - Input path enable */
#define GP3IE_IEN3_BBA                 (*(volatile unsigned long *) 0x4240198C)
#define GP3IE_IEN3_MSK                 (0x1   << 3  )
#define GP3IE_IEN3                     (0x1   << 3  )
#define GP3IE_IEN3_DIS                 (0x0   << 3  )
#define GP3IE_IEN3_EN                  (0x1   << 3  )

/* GP3IE[IEN2] - Input path enable */
#define GP3IE_IEN2_BBA                 (*(volatile unsigned long *) 0x42401988)
#define GP3IE_IEN2_MSK                 (0x1   << 2  )
#define GP3IE_IEN2                     (0x1   << 2  )
#define GP3IE_IEN2_DIS                 (0x0   << 2  )
#define GP3IE_IEN2_EN                  (0x1   << 2  )

/* GP3IE[IEN1] - Input path enable */
#define GP3IE_IEN1_BBA                 (*(volatile unsigned long *) 0x42401984)
#define GP3IE_IEN1_MSK                 (0x1   << 1  )
#define GP3IE_IEN1                     (0x1   << 1  )
#define GP3IE_IEN1_DIS                 (0x0   << 1  )
#define GP3IE_IEN1_EN                  (0x1   << 1  )

/* GP3IE[IEN0] - Input path enable */
#define GP3IE_IEN0_BBA                 (*(volatile unsigned long *) 0x42401980)
#define GP3IE_IEN0_MSK                 (0x1   << 0  )
#define GP3IE_IEN0                     (0x1   << 0  )
#define GP3IE_IEN0_DIS                 (0x0   << 0  )
#define GP3IE_IEN0_EN                  (0x1   << 0  )

/* Reset Value for GP3IN*/
#define GP3IN_RVAL                     0x0 

/* GP3IN[IN7] - Registered data input */
#define GP3IN_IN7_BBA                  (*(volatile unsigned long *) 0x42401A1C)
#define GP3IN_IN7_MSK                  (0x1   << 7  )
#define GP3IN_IN7                      (0x1   << 7  )
#define GP3IN_IN7_LOW                  (0x0   << 7  )
#define GP3IN_IN7_HIGH                 (0x1   << 7  )

/* GP3IN[IN6] - Registered data input */
#define GP3IN_IN6_BBA                  (*(volatile unsigned long *) 0x42401A18)
#define GP3IN_IN6_MSK                  (0x1   << 6  )
#define GP3IN_IN6                      (0x1   << 6  )
#define GP3IN_IN6_LOW                  (0x0   << 6  )
#define GP3IN_IN6_HIGH                 (0x1   << 6  )

/* GP3IN[IN5] - Registered data input */
#define GP3IN_IN5_BBA                  (*(volatile unsigned long *) 0x42401A14)
#define GP3IN_IN5_MSK                  (0x1   << 5  )
#define GP3IN_IN5                      (0x1   << 5  )
#define GP3IN_IN5_LOW                  (0x0   << 5  )
#define GP3IN_IN5_HIGH                 (0x1   << 5  )

/* GP3IN[IN4] - Registered data input */
#define GP3IN_IN4_BBA                  (*(volatile unsigned long *) 0x42401A10)
#define GP3IN_IN4_MSK                  (0x1   << 4  )
#define GP3IN_IN4                      (0x1   << 4  )
#define GP3IN_IN4_LOW                  (0x0   << 4  )
#define GP3IN_IN4_HIGH                 (0x1   << 4  )

/* GP3IN[IN3] - Registered data input */
#define GP3IN_IN3_BBA                  (*(volatile unsigned long *) 0x42401A0C)
#define GP3IN_IN3_MSK                  (0x1   << 3  )
#define GP3IN_IN3                      (0x1   << 3  )
#define GP3IN_IN3_LOW                  (0x0   << 3  )
#define GP3IN_IN3_HIGH                 (0x1   << 3  )

/* GP3IN[IN2] - Registered data input */
#define GP3IN_IN2_BBA                  (*(volatile unsigned long *) 0x42401A08)
#define GP3IN_IN2_MSK                  (0x1   << 2  )
#define GP3IN_IN2                      (0x1   << 2  )
#define GP3IN_IN2_LOW                  (0x0   << 2  )
#define GP3IN_IN2_HIGH                 (0x1   << 2  )

/* GP3IN[IN1] - Registered data input */
#define GP3IN_IN1_BBA                  (*(volatile unsigned long *) 0x42401A04)
#define GP3IN_IN1_MSK                  (0x1   << 1  )
#define GP3IN_IN1                      (0x1   << 1  )
#define GP3IN_IN1_LOW                  (0x0   << 1  )
#define GP3IN_IN1_HIGH                 (0x1   << 1  )

/* GP3IN[IN0] - Registered data input */
#define GP3IN_IN0_BBA                  (*(volatile unsigned long *) 0x42401A00)
#define GP3IN_IN0_MSK                  (0x1   << 0  )
#define GP3IN_IN0                      (0x1   << 0  )
#define GP3IN_IN0_LOW                  (0x0   << 0  )
#define GP3IN_IN0_HIGH                 (0x1   << 0  )

/* Reset Value for GP3OUT*/
#define GP3OUT_RVAL                    0x0 

/* GP3OUT[OUT7] - Data out */
#define GP3OUT_OUT7_BBA                (*(volatile unsigned long *) 0x42401A9C)
#define GP3OUT_OUT7_MSK                (0x1   << 7  )
#define GP3OUT_OUT7                    (0x1   << 7  )
#define GP3OUT_OUT7_LOW                (0x0   << 7  )
#define GP3OUT_OUT7_HIGH               (0x1   << 7  )

