koshkin-sergey/mbOS/Examples/basic/arch/cortex-m/eval_aducm320/src/include/ADuCM320.h
/* GP3OUT[OUT6] - Data out */
#define GP3OUT_OUT6_BBA                (*(volatile unsigned long *) 0x42401A98)
#define GP3OUT_OUT6_MSK                (0x1   << 6  )
#define GP3OUT_OUT6                    (0x1   << 6  )
#define GP3OUT_OUT6_LOW                (0x0   << 6  )
#define GP3OUT_OUT6_HIGH               (0x1   << 6  )

/* GP3OUT[OUT5] - Data out */
#define GP3OUT_OUT5_BBA                (*(volatile unsigned long *) 0x42401A94)
#define GP3OUT_OUT5_MSK                (0x1   << 5  )
#define GP3OUT_OUT5                    (0x1   << 5  )
#define GP3OUT_OUT5_LOW                (0x0   << 5  )
#define GP3OUT_OUT5_HIGH               (0x1   << 5  )

/* GP3OUT[OUT4] - Data out */
#define GP3OUT_OUT4_BBA                (*(volatile unsigned long *) 0x42401A90)
#define GP3OUT_OUT4_MSK                (0x1   << 4  )
#define GP3OUT_OUT4                    (0x1   << 4  )
#define GP3OUT_OUT4_LOW                (0x0   << 4  )
#define GP3OUT_OUT4_HIGH               (0x1   << 4  )

/* GP3OUT[OUT3] - Data out */
#define GP3OUT_OUT3_BBA                (*(volatile unsigned long *) 0x42401A8C)
#define GP3OUT_OUT3_MSK                (0x1   << 3  )
#define GP3OUT_OUT3                    (0x1   << 3  )
#define GP3OUT_OUT3_LOW                (0x0   << 3  )
#define GP3OUT_OUT3_HIGH               (0x1   << 3  )

/* GP3OUT[OUT2] - Data out */
#define GP3OUT_OUT2_BBA                (*(volatile unsigned long *) 0x42401A88)
#define GP3OUT_OUT2_MSK                (0x1   << 2  )
#define GP3OUT_OUT2                    (0x1   << 2  )
#define GP3OUT_OUT2_LOW                (0x0   << 2  )
#define GP3OUT_OUT2_HIGH               (0x1   << 2  )

/* GP3OUT[OUT1] - Data out */
#define GP3OUT_OUT1_BBA                (*(volatile unsigned long *) 0x42401A84)
#define GP3OUT_OUT1_MSK                (0x1   << 1  )
#define GP3OUT_OUT1                    (0x1   << 1  )
#define GP3OUT_OUT1_LOW                (0x0   << 1  )
#define GP3OUT_OUT1_HIGH               (0x1   << 1  )

/* GP3OUT[OUT0] - Data out */
#define GP3OUT_OUT0_BBA                (*(volatile unsigned long *) 0x42401A80)
#define GP3OUT_OUT0_MSK                (0x1   << 0  )
#define GP3OUT_OUT0                    (0x1   << 0  )
#define GP3OUT_OUT0_LOW                (0x0   << 0  )
#define GP3OUT_OUT0_HIGH               (0x1   << 0  )

/* Reset Value for GP3SET*/
#define GP3SET_RVAL                    0x0 

/* GP3SET[SET7] - Set the output HIGH for the pin */
#define GP3SET_SET7_BBA                (*(volatile unsigned long *) 0x42401B1C)
#define GP3SET_SET7_MSK                (0x1   << 7  )
#define GP3SET_SET7                    (0x1   << 7  )
#define GP3SET_SET7_SET                (0x1   << 7  )

/* GP3SET[SET6] - Set the output HIGH for the pin */
#define GP3SET_SET6_BBA                (*(volatile unsigned long *) 0x42401B18)
#define GP3SET_SET6_MSK                (0x1   << 6  )
#define GP3SET_SET6                    (0x1   << 6  )
#define GP3SET_SET6_SET                (0x1   << 6  )

/* GP3SET[SET5] - Set the output HIGH for the pin */
#define GP3SET_SET5_BBA                (*(volatile unsigned long *) 0x42401B14)
#define GP3SET_SET5_MSK                (0x1   << 5  )
#define GP3SET_SET5                    (0x1   << 5  )
#define GP3SET_SET5_SET                (0x1   << 5  )

/* GP3SET[SET4] - Set the output HIGH for the pin */
#define GP3SET_SET4_BBA                (*(volatile unsigned long *) 0x42401B10)
#define GP3SET_SET4_MSK                (0x1   << 4  )
#define GP3SET_SET4                    (0x1   << 4  )
#define GP3SET_SET4_SET                (0x1   << 4  )

/* GP3SET[SET3] - Set the output HIGH for the pin */
#define GP3SET_SET3_BBA                (*(volatile unsigned long *) 0x42401B0C)
#define GP3SET_SET3_MSK                (0x1   << 3  )
#define GP3SET_SET3                    (0x1   << 3  )
#define GP3SET_SET3_SET                (0x1   << 3  )

/* GP3SET[SET2] - Set the output HIGH for the pin */
#define GP3SET_SET2_BBA                (*(volatile unsigned long *) 0x42401B08)
#define GP3SET_SET2_MSK                (0x1   << 2  )
#define GP3SET_SET2                    (0x1   << 2  )
#define GP3SET_SET2_SET                (0x1   << 2  )

/* GP3SET[SET1] - Set the output HIGH for the pin */
#define GP3SET_SET1_BBA                (*(volatile unsigned long *) 0x42401B04)
#define GP3SET_SET1_MSK                (0x1   << 1  )
#define GP3SET_SET1                    (0x1   << 1  )
#define GP3SET_SET1_SET                (0x1   << 1  )

/* GP3SET[SET0] - Set the output HIGH for the pin */
#define GP3SET_SET0_BBA                (*(volatile unsigned long *) 0x42401B00)
#define GP3SET_SET0_MSK                (0x1   << 0  )
#define GP3SET_SET0                    (0x1   << 0  )
#define GP3SET_SET0_SET                (0x1   << 0  )

/* Reset Value for GP3CLR*/
#define GP3CLR_RVAL                    0x0 

/* GP3CLR[CLR7] - Set the output low  for the port pin */
#define GP3CLR_CLR7_BBA                (*(volatile unsigned long *) 0x42401B9C)
#define GP3CLR_CLR7_MSK                (0x1   << 7  )
#define GP3CLR_CLR7                    (0x1   << 7  )
#define GP3CLR_CLR7_CLR                (0x1   << 7  )

/* GP3CLR[CLR6] - Set the output low  for the port pin */
#define GP3CLR_CLR6_BBA                (*(volatile unsigned long *) 0x42401B98)
#define GP3CLR_CLR6_MSK                (0x1   << 6  )
#define GP3CLR_CLR6                    (0x1   << 6  )
#define GP3CLR_CLR6_CLR                (0x1   << 6  )

/* GP3CLR[CLR5] - Set the output low  for the port pin */
#define GP3CLR_CLR5_BBA                (*(volatile unsigned long *) 0x42401B94)
#define GP3CLR_CLR5_MSK                (0x1   << 5  )
#define GP3CLR_CLR5                    (0x1   << 5  )
#define GP3CLR_CLR5_CLR                (0x1   << 5  )

/* GP3CLR[CLR4] - Set the output low  for the port pin */
#define GP3CLR_CLR4_BBA                (*(volatile unsigned long *) 0x42401B90)
#define GP3CLR_CLR4_MSK                (0x1   << 4  )
#define GP3CLR_CLR4                    (0x1   << 4  )
#define GP3CLR_CLR4_CLR                (0x1   << 4  )

/* GP3CLR[CLR3] - Set the output low  for the port pin */
#define GP3CLR_CLR3_BBA                (*(volatile unsigned long *) 0x42401B8C)
#define GP3CLR_CLR3_MSK                (0x1   << 3  )
#define GP3CLR_CLR3                    (0x1   << 3  )
#define GP3CLR_CLR3_CLR                (0x1   << 3  )

/* GP3CLR[CLR2] - Set the output low  for the port pin */
#define GP3CLR_CLR2_BBA                (*(volatile unsigned long *) 0x42401B88)
#define GP3CLR_CLR2_MSK                (0x1   << 2  )
#define GP3CLR_CLR2                    (0x1   << 2  )
#define GP3CLR_CLR2_CLR                (0x1   << 2  )

/* GP3CLR[CLR1] - Set the output low  for the port pin */
#define GP3CLR_CLR1_BBA                (*(volatile unsigned long *) 0x42401B84)
#define GP3CLR_CLR1_MSK                (0x1   << 1  )
#define GP3CLR_CLR1                    (0x1   << 1  )
#define GP3CLR_CLR1_CLR                (0x1   << 1  )

/* GP3CLR[CLR0] - Set the output low  for the port pin */
#define GP3CLR_CLR0_BBA                (*(volatile unsigned long *) 0x42401B80)
#define GP3CLR_CLR0_MSK                (0x1   << 0  )
#define GP3CLR_CLR0                    (0x1   << 0  )
#define GP3CLR_CLR0_CLR                (0x1   << 0  )

