koshkin-sergey/mbOS/Examples/basic/arch/cortex-m/eval_aducm320/src/include/ADuCM320.h
/* Reset Value for GP3TGL*/
#define GP3TGL_RVAL                    0x0 

/* GP3TGL[TGL7] - Toggle the output of the port pin */
#define GP3TGL_TGL7_BBA                (*(volatile unsigned long *) 0x42401C1C)
#define GP3TGL_TGL7_MSK                (0x1   << 7  )
#define GP3TGL_TGL7                    (0x1   << 7  )
#define GP3TGL_TGL7_TGL                (0x1   << 7  )

/* GP3TGL[TGL6] - Toggle the output of the port pin */
#define GP3TGL_TGL6_BBA                (*(volatile unsigned long *) 0x42401C18)
#define GP3TGL_TGL6_MSK                (0x1   << 6  )
#define GP3TGL_TGL6                    (0x1   << 6  )
#define GP3TGL_TGL6_TGL                (0x1   << 6  )

/* GP3TGL[TGL5] - Toggle the output of the port pin */
#define GP3TGL_TGL5_BBA                (*(volatile unsigned long *) 0x42401C14)
#define GP3TGL_TGL5_MSK                (0x1   << 5  )
#define GP3TGL_TGL5                    (0x1   << 5  )
#define GP3TGL_TGL5_TGL                (0x1   << 5  )

/* GP3TGL[TGL4] - Toggle the output of the port pin */
#define GP3TGL_TGL4_BBA                (*(volatile unsigned long *) 0x42401C10)
#define GP3TGL_TGL4_MSK                (0x1   << 4  )
#define GP3TGL_TGL4                    (0x1   << 4  )
#define GP3TGL_TGL4_TGL                (0x1   << 4  )

/* GP3TGL[TGL3] - Toggle the output of the port pin */
#define GP3TGL_TGL3_BBA                (*(volatile unsigned long *) 0x42401C0C)
#define GP3TGL_TGL3_MSK                (0x1   << 3  )
#define GP3TGL_TGL3                    (0x1   << 3  )
#define GP3TGL_TGL3_TGL                (0x1   << 3  )

/* GP3TGL[TGL2] - Toggle the output of the port pin */
#define GP3TGL_TGL2_BBA                (*(volatile unsigned long *) 0x42401C08)
#define GP3TGL_TGL2_MSK                (0x1   << 2  )
#define GP3TGL_TGL2                    (0x1   << 2  )
#define GP3TGL_TGL2_TGL                (0x1   << 2  )

/* GP3TGL[TGL1] - Toggle the output of the port pin */
#define GP3TGL_TGL1_BBA                (*(volatile unsigned long *) 0x42401C04)
#define GP3TGL_TGL1_MSK                (0x1   << 1  )
#define GP3TGL_TGL1                    (0x1   << 1  )
#define GP3TGL_TGL1_TGL                (0x1   << 1  )

/* GP3TGL[TGL0] - Toggle the output of the port pin */
#define GP3TGL_TGL0_BBA                (*(volatile unsigned long *) 0x42401C00)
#define GP3TGL_TGL0_MSK                (0x1   << 0  )
#define GP3TGL_TGL0                    (0x1   << 0  )
#define GP3TGL_TGL0_TGL                (0x1   << 0  )

/* Reset Value for GP3ODE*/
#define GP3ODE_RVAL                    0x0 

/* GP3ODE[ODE7] - Open drain enable */
#define GP3ODE_ODE7_BBA                (*(volatile unsigned long *) 0x42401C9C)
#define GP3ODE_ODE7_MSK                (0x1   << 7  )
#define GP3ODE_ODE7                    (0x1   << 7  )
#define GP3ODE_ODE7_DIS                (0x0   << 7  )
#define GP3ODE_ODE7_EN                 (0x1   << 7  )

/* GP3ODE[ODE6] - Open drain enable */
#define GP3ODE_ODE6_BBA                (*(volatile unsigned long *) 0x42401C98)
#define GP3ODE_ODE6_MSK                (0x1   << 6  )
#define GP3ODE_ODE6                    (0x1   << 6  )
#define GP3ODE_ODE6_DIS                (0x0   << 6  )
#define GP3ODE_ODE6_EN                 (0x1   << 6  )

/* GP3ODE[ODE5] - Open drain enable */
#define GP3ODE_ODE5_BBA                (*(volatile unsigned long *) 0x42401C94)
#define GP3ODE_ODE5_MSK                (0x1   << 5  )
#define GP3ODE_ODE5                    (0x1   << 5  )
#define GP3ODE_ODE5_DIS                (0x0   << 5  )
#define GP3ODE_ODE5_EN                 (0x1   << 5  )

/* GP3ODE[ODE4] - Open drain enable */
#define GP3ODE_ODE4_BBA                (*(volatile unsigned long *) 0x42401C90)
#define GP3ODE_ODE4_MSK                (0x1   << 4  )
#define GP3ODE_ODE4                    (0x1   << 4  )
#define GP3ODE_ODE4_DIS                (0x0   << 4  )
#define GP3ODE_ODE4_EN                 (0x1   << 4  )

/* GP3ODE[ODE3] - Open drain enable */
#define GP3ODE_ODE3_BBA                (*(volatile unsigned long *) 0x42401C8C)
#define GP3ODE_ODE3_MSK                (0x1   << 3  )
#define GP3ODE_ODE3                    (0x1   << 3  )
#define GP3ODE_ODE3_DIS                (0x0   << 3  )
#define GP3ODE_ODE3_EN                 (0x1   << 3  )

/* GP3ODE[ODE2] - Open drain enable */
#define GP3ODE_ODE2_BBA                (*(volatile unsigned long *) 0x42401C88)
#define GP3ODE_ODE2_MSK                (0x1   << 2  )
#define GP3ODE_ODE2                    (0x1   << 2  )
#define GP3ODE_ODE2_DIS                (0x0   << 2  )
#define GP3ODE_ODE2_EN                 (0x1   << 2  )

/* GP3ODE[ODE1] - Open drain enable */
#define GP3ODE_ODE1_BBA                (*(volatile unsigned long *) 0x42401C84)
#define GP3ODE_ODE1_MSK                (0x1   << 1  )
#define GP3ODE_ODE1                    (0x1   << 1  )
#define GP3ODE_ODE1_DIS                (0x0   << 1  )
#define GP3ODE_ODE1_EN                 (0x1   << 1  )

/* GP3ODE[ODE0] - Open drain enable */
#define GP3ODE_ODE0_BBA                (*(volatile unsigned long *) 0x42401C80)
#define GP3ODE_ODE0_MSK                (0x1   << 0  )
#define GP3ODE_ODE0                    (0x1   << 0  )
#define GP3ODE_ODE0_DIS                (0x0   << 0  )
#define GP3ODE_ODE0_EN                 (0x1   << 0  )
#if (__NO_MMR_STRUCTS__==1)

#define          GP4CON                                     (*(volatile unsigned short int *) 0x40020100)
#define          GP4OE                                      (*(volatile unsigned char      *) 0x40020104)
#define          GP4PUL                                     (*(volatile unsigned char      *) 0x40020108)
#define          GP4IE                                      (*(volatile unsigned char      *) 0x4002010C)
#define          GP4IN                                      (*(volatile unsigned char      *) 0x40020110)
#define          GP4OUT                                     (*(volatile unsigned char      *) 0x40020114)
#define          GP4SET                                     (*(volatile unsigned char      *) 0x40020118)
#define          GP4CLR                                     (*(volatile unsigned char      *) 0x4002011C)
#define          GP4TGL                                     (*(volatile unsigned char      *) 0x40020120)
#define          GP4ODE                                     (*(volatile unsigned char      *) 0x40020124)
#endif // (__NO_MMR_STRUCTS__==1)

/* Reset Value for GP4CON*/
#define GP4CON_RVAL                    0x0 

/* GP4CON[CON7] - p4.7  configuration bits */
#define GP4CON_CON7_MSK                (0x3   << 14 )

