koshkin-sergey/mbOS/Examples/basic/arch/cortex-m/eval_aducm320/src/include/ADuCM320.h
/* Reset Value for GP4TGL*/
#define GP4TGL_RVAL                    0x0 

/* GP4TGL[TGL7] - Toggle the output of the port pin */
#define GP4TGL_TGL7_BBA                (*(volatile unsigned long *) 0x4240241C)
#define GP4TGL_TGL7_MSK                (0x1   << 7  )
#define GP4TGL_TGL7                    (0x1   << 7  )
#define GP4TGL_TGL7_TGL                (0x1   << 7  )

/* GP4TGL[TGL6] - Toggle the output of the port pin */
#define GP4TGL_TGL6_BBA                (*(volatile unsigned long *) 0x42402418)
#define GP4TGL_TGL6_MSK                (0x1   << 6  )
#define GP4TGL_TGL6                    (0x1   << 6  )
#define GP4TGL_TGL6_TGL                (0x1   << 6  )

/* GP4TGL[TGL5] - Toggle the output of the port pin */
#define GP4TGL_TGL5_BBA                (*(volatile unsigned long *) 0x42402414)
#define GP4TGL_TGL5_MSK                (0x1   << 5  )
#define GP4TGL_TGL5                    (0x1   << 5  )
#define GP4TGL_TGL5_TGL                (0x1   << 5  )

/* GP4TGL[TGL4] - Toggle the output of the port pin */
#define GP4TGL_TGL4_BBA                (*(volatile unsigned long *) 0x42402410)
#define GP4TGL_TGL4_MSK                (0x1   << 4  )
#define GP4TGL_TGL4                    (0x1   << 4  )
#define GP4TGL_TGL4_TGL                (0x1   << 4  )

/* GP4TGL[TGL3] - Toggle the output of the port pin */
#define GP4TGL_TGL3_BBA                (*(volatile unsigned long *) 0x4240240C)
#define GP4TGL_TGL3_MSK                (0x1   << 3  )
#define GP4TGL_TGL3                    (0x1   << 3  )
#define GP4TGL_TGL3_TGL                (0x1   << 3  )

/* GP4TGL[TGL2] - Toggle the output of the port pin */
#define GP4TGL_TGL2_BBA                (*(volatile unsigned long *) 0x42402408)
#define GP4TGL_TGL2_MSK                (0x1   << 2  )
#define GP4TGL_TGL2                    (0x1   << 2  )
#define GP4TGL_TGL2_TGL                (0x1   << 2  )

/* GP4TGL[TGL1] - Toggle the output of the port pin */
#define GP4TGL_TGL1_BBA                (*(volatile unsigned long *) 0x42402404)
#define GP4TGL_TGL1_MSK                (0x1   << 1  )
#define GP4TGL_TGL1                    (0x1   << 1  )
#define GP4TGL_TGL1_TGL                (0x1   << 1  )

/* GP4TGL[TGL0] - Toggle the output of the port pin */
#define GP4TGL_TGL0_BBA                (*(volatile unsigned long *) 0x42402400)
#define GP4TGL_TGL0_MSK                (0x1   << 0  )
#define GP4TGL_TGL0                    (0x1   << 0  )
#define GP4TGL_TGL0_TGL                (0x1   << 0  )

/* Reset Value for GP4ODE*/
#define GP4ODE_RVAL                    0x0 

/* GP4ODE[ODE7] - Open drain enable */
#define GP4ODE_ODE7_BBA                (*(volatile unsigned long *) 0x4240249C)
#define GP4ODE_ODE7_MSK                (0x1   << 7  )
#define GP4ODE_ODE7                    (0x1   << 7  )
#define GP4ODE_ODE7_DIS                (0x0   << 7  )
#define GP4ODE_ODE7_EN                 (0x1   << 7  )

/* GP4ODE[ODE6] - Open drain enable */
#define GP4ODE_ODE6_BBA                (*(volatile unsigned long *) 0x42402498)
#define GP4ODE_ODE6_MSK                (0x1   << 6  )
#define GP4ODE_ODE6                    (0x1   << 6  )
#define GP4ODE_ODE6_DIS                (0x0   << 6  )
#define GP4ODE_ODE6_EN                 (0x1   << 6  )

/* GP4ODE[ODE5] - Open drain enable */
#define GP4ODE_ODE5_BBA                (*(volatile unsigned long *) 0x42402494)
#define GP4ODE_ODE5_MSK                (0x1   << 5  )
#define GP4ODE_ODE5                    (0x1   << 5  )
#define GP4ODE_ODE5_DIS                (0x0   << 5  )
#define GP4ODE_ODE5_EN                 (0x1   << 5  )

/* GP4ODE[ODE4] - Open drain enable */
#define GP4ODE_ODE4_BBA                (*(volatile unsigned long *) 0x42402490)
#define GP4ODE_ODE4_MSK                (0x1   << 4  )
#define GP4ODE_ODE4                    (0x1   << 4  )
#define GP4ODE_ODE4_DIS                (0x0   << 4  )
#define GP4ODE_ODE4_EN                 (0x1   << 4  )

/* GP4ODE[ODE3] - Open drain enable */
#define GP4ODE_ODE3_BBA                (*(volatile unsigned long *) 0x4240248C)
#define GP4ODE_ODE3_MSK                (0x1   << 3  )
#define GP4ODE_ODE3                    (0x1   << 3  )
#define GP4ODE_ODE3_DIS                (0x0   << 3  )
#define GP4ODE_ODE3_EN                 (0x1   << 3  )

/* GP4ODE[ODE2] - Open drain enable */
#define GP4ODE_ODE2_BBA                (*(volatile unsigned long *) 0x42402488)
#define GP4ODE_ODE2_MSK                (0x1   << 2  )
#define GP4ODE_ODE2                    (0x1   << 2  )
#define GP4ODE_ODE2_DIS                (0x0   << 2  )
#define GP4ODE_ODE2_EN                 (0x1   << 2  )

/* GP4ODE[ODE1] - Open drain enable */
#define GP4ODE_ODE1_BBA                (*(volatile unsigned long *) 0x42402484)
#define GP4ODE_ODE1_MSK                (0x1   << 1  )
#define GP4ODE_ODE1                    (0x1   << 1  )
#define GP4ODE_ODE1_DIS                (0x0   << 1  )
#define GP4ODE_ODE1_EN                 (0x1   << 1  )

/* GP4ODE[ODE0] - Open drain enable */
#define GP4ODE_ODE0_BBA                (*(volatile unsigned long *) 0x42402480)
#define GP4ODE_ODE0_MSK                (0x1   << 0  )
#define GP4ODE_ODE0                    (0x1   << 0  )
#define GP4ODE_ODE0_DIS                (0x0   << 0  )
#define GP4ODE_ODE0_EN                 (0x1   << 0  )
#if (__NO_MMR_STRUCTS__==1)

#define          GP5CON                                     (*(volatile unsigned char      *) 0x40020240)
#define          GP5OE                                      (*(volatile unsigned char      *) 0x40020244)
#define          GP5PUL                                     (*(volatile unsigned char      *) 0x40020248)
#define          GP5IE                                      (*(volatile unsigned char      *) 0x4002024C)
#define          GP5IN                                      (*(volatile unsigned char      *) 0x40020250)
#define          GP5OUT                                     (*(volatile unsigned char      *) 0x40020254)
#define          GP5SET                                     (*(volatile unsigned char      *) 0x40020258)
#define          GP5CLR                                     (*(volatile unsigned char      *) 0x4002025C)
#define          GP5TGL                                     (*(volatile unsigned char      *) 0x40020260)
#define          GP5ODE                                     (*(volatile unsigned char      *) 0x40020264)
#endif // (__NO_MMR_STRUCTS__==1)

/* Reset Value for GP5CON*/
#define GP5CON_RVAL                    0x0 

