koshkin-sergey/mbOS/Examples/basic/arch/cortex-m/eval_aducm320/src/include/ADuCM320.h
/* SPI0CON[ZEN] - Transmit zeros enable */
#define SPI0CON_ZEN_BBA                (*(volatile unsigned long *) 0x4258021C)
#define SPI0CON_ZEN_MSK                (0x1   << 7  )
#define SPI0CON_ZEN                    (0x1   << 7  )
#define SPI0CON_ZEN_DIS                (0x0   << 7  ) /* Clear this bit to transmit the last transmitted value when there is no valid data in the Tx FIFO. */
#define SPI0CON_ZEN_EN                 (0x1   << 7  ) /* Set this bit to transmit "0x00" when there is no valid data in the Tx FIFO. */

/* SPI0CON[TIM] - SPI transfer and interrupt mode */
#define SPI0CON_TIM_BBA                (*(volatile unsigned long *) 0x42580218)
#define SPI0CON_TIM_MSK                (0x1   << 6  )
#define SPI0CON_TIM                    (0x1   << 6  )
#define SPI0CON_TIM_RXRD               (0x0   << 6  ) /* Cleared by user to initiate transfer with a read of the SPI0RX register. Interrupt only occurs when Rx is full. */
#define SPI0CON_TIM_TXWR               (0x1   << 6  ) /* Set by user to initiate transfer with a write to the SPI0TX register. Interrupt only occurs when Tx is empty. */

/* SPI0CON[LSB] - LSB first transfer enable */
#define SPI0CON_LSB_BBA                (*(volatile unsigned long *) 0x42580214)
#define SPI0CON_LSB_MSK                (0x1   << 5  )
#define SPI0CON_LSB                    (0x1   << 5  )
#define SPI0CON_LSB_DIS                (0x0   << 5  ) /* MSB transmitted first    */
#define SPI0CON_LSB_EN                 (0x1   << 5  ) /* LSB transmitted first    */

/* SPI0CON[WOM] - SPI Wired Or mode */
#define SPI0CON_WOM_BBA                (*(volatile unsigned long *) 0x42580210)
#define SPI0CON_WOM_MSK                (0x1   << 4  )
#define SPI0CON_WOM                    (0x1   << 4  )
#define SPI0CON_WOM_EN                 (0x1   << 4  ) /* Enables open circuit data output enable. External pull-ups required on data out pins */
#define SPI0CON_WOM_DIS                (0x0   << 4  ) /* Normal output levels     */

/* SPI0CON[CPOL] - Serial Clock Polarity */
#define SPI0CON_CPOL_BBA               (*(volatile unsigned long *) 0x4258020C)
#define SPI0CON_CPOL_MSK               (0x1   << 3  )
#define SPI0CON_CPOL                   (0x1   << 3  )
#define SPI0CON_CPOL_LOW               (0x0   << 3  ) /* Serial clock idles low   */
#define SPI0CON_CPOL_HIGH              (0x1   << 3  ) /* Serial clock idles high  */

/* SPI0CON[CPHA] - Serial clock phase mode */
#define SPI0CON_CPHA_BBA               (*(volatile unsigned long *) 0x42580208)
#define SPI0CON_CPHA_MSK               (0x1   << 2  )
#define SPI0CON_CPHA                   (0x1   << 2  )
#define SPI0CON_CPHA_SAMPLETRAILING    (0x1   << 2  ) /* Serial clock pulses at the beginning of each serial bit transfer */
#define SPI0CON_CPHA_SAMPLELEADING     (0x0   << 2  ) /* Serial clock pulses at the end of each serial bit transfer */

/* SPI0CON[MASEN] - Master mode enable */
#define SPI0CON_MASEN_BBA              (*(volatile unsigned long *) 0x42580204)
#define SPI0CON_MASEN_MSK              (0x1   << 1  )
#define SPI0CON_MASEN                  (0x1   << 1  )
#define SPI0CON_MASEN_DIS              (0x0   << 1  ) /* Enable slave mode        */
#define SPI0CON_MASEN_EN               (0x1   << 1  ) /* Enable master mode       */

/* SPI0CON[ENABLE] - SPI enable */
#define SPI0CON_ENABLE_BBA             (*(volatile unsigned long *) 0x42580200)
#define SPI0CON_ENABLE_MSK             (0x1   << 0  )
#define SPI0CON_ENABLE                 (0x1   << 0  )
#define SPI0CON_ENABLE_DIS             (0x0   << 0  ) /* Disable the SPI          */
#define SPI0CON_ENABLE_EN              (0x1   << 0  ) /* Enable the SPI           */

/* Reset Value for SPI0DMA*/
#define SPI0DMA_RVAL                   0x0 

/* SPI0DMA[IENRXDMA] - Enable receive DMA request */
#define SPI0DMA_IENRXDMA_BBA           (*(volatile unsigned long *) 0x42580288)
#define SPI0DMA_IENRXDMA_MSK           (0x1   << 2  )
#define SPI0DMA_IENRXDMA               (0x1   << 2  )
#define SPI0DMA_IENRXDMA_DIS           (0x0   << 2  ) /* Disable RX DMA Interrupt */
#define SPI0DMA_IENRXDMA_EN            (0x1   << 2  ) /* Enable RX DMA Interrupt  */

/* SPI0DMA[IENTXDMA] - Enable transmit DMA request */
#define SPI0DMA_IENTXDMA_BBA           (*(volatile unsigned long *) 0x42580284)
#define SPI0DMA_IENTXDMA_MSK           (0x1   << 1  )
#define SPI0DMA_IENTXDMA               (0x1   << 1  )
#define SPI0DMA_IENTXDMA_DIS           (0x0   << 1  ) /* Disable TX DMA Interrupt */
#define SPI0DMA_IENTXDMA_EN            (0x1   << 1  ) /* Enable TX DMA Interrupt  */

/* SPI0DMA[ENABLE] - Enable DMA for data transfer */
#define SPI0DMA_ENABLE_BBA             (*(volatile unsigned long *) 0x42580280)
#define SPI0DMA_ENABLE_MSK             (0x1   << 0  )
#define SPI0DMA_ENABLE                 (0x1   << 0  )
#define SPI0DMA_ENABLE_DIS             (0x0   << 0  )
#define SPI0DMA_ENABLE_EN              (0x1   << 0  )

/* Reset Value for SPI0CNT*/
#define SPI0CNT_RVAL                   0x0 

/* SPI0CNT[COUNT] - Transfer byte count */
#define SPI0CNT_COUNT_MSK              (0xFF  << 0  )
#if (__NO_MMR_STRUCTS__==1)

#define          SPI1STA                                    (*(volatile unsigned short int *) 0x40030000)
#define          SPI1RX                                     (*(volatile unsigned short int *) 0x40030004)
#define          SPI1TX                                     (*(volatile unsigned short int *) 0x40030008)
#define          SPI1DIV                                    (*(volatile unsigned short int *) 0x4003000C)
#define          SPI1CON                                    (*(volatile unsigned short int *) 0x40030010)
#define          SPI1DMA                                    (*(volatile unsigned short int *) 0x40030014)
#define          SPI1CNT                                    (*(volatile unsigned short int *) 0x40030018)
#endif // (__NO_MMR_STRUCTS__==1)

/* Reset Value for SPI1STA*/
#define SPI1STA_RVAL                   0x0 

/* SPI1STA[CSRSG] - Detected a rising edge on CS, in CONT mode */
#define SPI1STA_CSRSG_BBA              (*(volatile unsigned long *) 0x42600038)
#define SPI1STA_CSRSG_MSK              (0x1   << 14 )
#define SPI1STA_CSRSG                  (0x1   << 14 )
#define SPI1STA_CSRSG_CLR              (0x0   << 14 ) /* Cleared to 0 when the Status register is read */
#define SPI1STA_CSRSG_SET              (0x1   << 14 ) /* Set to 1 when there was a rising edge in CS line, when the device was in master mode, continuous transfer, High Frequency mode and CSIRQ_EN was asserted. */

