koshkin-sergey/mbOS/Examples/basic/arch/cortex-m/eval_aducm320/src/include/ADuCM320.h
/* Reset Value for SPI1DMA*/
#define SPI1DMA_RVAL                   0x0 

/* SPI1DMA[IENRXDMA] - Enable receive DMA request */
#define SPI1DMA_IENRXDMA_BBA           (*(volatile unsigned long *) 0x42600288)
#define SPI1DMA_IENRXDMA_MSK           (0x1   << 2  )
#define SPI1DMA_IENRXDMA               (0x1   << 2  )
#define SPI1DMA_IENRXDMA_DIS           (0x0   << 2  ) /* Disable RX DMA Interrupt */
#define SPI1DMA_IENRXDMA_EN            (0x1   << 2  ) /* Enable RX DMA Interrupt  */

/* SPI1DMA[IENTXDMA] - Enable transmit DMA request */
#define SPI1DMA_IENTXDMA_BBA           (*(volatile unsigned long *) 0x42600284)
#define SPI1DMA_IENTXDMA_MSK           (0x1   << 1  )
#define SPI1DMA_IENTXDMA               (0x1   << 1  )
#define SPI1DMA_IENTXDMA_DIS           (0x0   << 1  ) /* Disable TX DMA Interrupt */
#define SPI1DMA_IENTXDMA_EN            (0x1   << 1  ) /* Enable TX DMA Interrupt  */

/* SPI1DMA[ENABLE] - Enable DMA for data transfer */
#define SPI1DMA_ENABLE_BBA             (*(volatile unsigned long *) 0x42600280)
#define SPI1DMA_ENABLE_MSK             (0x1   << 0  )
#define SPI1DMA_ENABLE                 (0x1   << 0  )
#define SPI1DMA_ENABLE_DIS             (0x0   << 0  )
#define SPI1DMA_ENABLE_EN              (0x1   << 0  )

/* Reset Value for SPI1CNT*/
#define SPI1CNT_RVAL                   0x0 

/* SPI1CNT[COUNT] - Transfer byte count */
#define SPI1CNT_COUNT_MSK              (0xFF  << 0  )
// ------------------------------------------------------------------------------------------------
// -----                                        ADC_CORE                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief ADC_CORE (pADI_ADC)
  */

#if (__NO_MMR_STRUCTS__==0)
typedef struct {                            /*!< pADI_ADC Structure                     */
  __IO uint16_t  ADCCON;                    /*!< ADC Configuration                     */
  __I  uint16_t  RESERVED0[8005];
  __IO uint32_t  ADCDAT[28];                /*!< ADCx Data and flags                   */
  __I  uint32_t  RESERVED1[4];
  __IO uint16_t  ADCCHA;                    /*!< ADC Channel Select                    */
  __I  uint16_t  RESERVED2[3];
  __IO uint32_t  ADCSEQ;                    /*!< ADC Sequencer Control                 */
  __IO uint32_t  ADCSEQC;                   /*!< ADC Sequencer Configuration           */
  __IO uint16_t  ADCGN;                     /*!< User gain adjust                      */
  __I  uint16_t  RESERVED3;
  __IO uint16_t  ADCOF;                     /*!< User offset adjust                    */
  __I  uint16_t  RESERVED4;
  __IO uint32_t  ADCCMP;                    /*!< Digital comparator configuration      */
  __IO uint32_t  ADCCNVC;                   /*!< ADC conversion  configuration         */
} ADI_ADC_TypeDef;
#else // (__NO_MMR_STRUCTS__==0)
#define          ADCCON                                     (*(volatile unsigned short int *) 0x40082174)
#define          ADCDAT0                                    (*(volatile unsigned long      *) 0x40086000)
#define          ADCDAT1                                    (*(volatile unsigned long      *) 0x40086004)
#define          ADCDAT2                                    (*(volatile unsigned long      *) 0x40086008)
#define          ADCDAT3                                    (*(volatile unsigned long      *) 0x4008600C)
#define          ADCDAT4                                    (*(volatile unsigned long      *) 0x40086010)
#define          ADCDAT5                                    (*(volatile unsigned long      *) 0x40086014)
#define          ADCDAT6                                    (*(volatile unsigned long      *) 0x40086018)
#define          ADCDAT7                                    (*(volatile unsigned long      *) 0x4008601C)
#define          ADCDAT8                                    (*(volatile unsigned long      *) 0x40086020)
#define          ADCDAT9                                    (*(volatile unsigned long      *) 0x40086024)
#define          ADCDAT10                                   (*(volatile unsigned long      *) 0x40086028)
#define          ADCDAT11                                   (*(volatile unsigned long      *) 0x4008602C)
#define          ADCDAT12                                   (*(volatile unsigned long      *) 0x40086030)
#define          ADCDAT13                                   (*(volatile unsigned long      *) 0x40086034)
#define          ADCDAT14                                   (*(volatile unsigned long      *) 0x40086038)
#define          ADCDAT15                                   (*(volatile unsigned long      *) 0x4008603C)
#define          ADCDAT16                                   (*(volatile unsigned long      *) 0x40086040)
#define          ADCDAT17                                   (*(volatile unsigned long      *) 0x40086044)
#define          ADCDAT18                                   (*(volatile unsigned long      *) 0x40086048)
#define          ADCDAT19                                   (*(volatile unsigned long      *) 0x4008604C)
#define          ADCDAT20                                   (*(volatile unsigned long      *) 0x40086050)
#define          ADCDAT21                                   (*(volatile unsigned long      *) 0x40086054)
#define          ADCDAT22                                   (*(volatile unsigned long      *) 0x40086058)
#define          ADCDAT23                                   (*(volatile unsigned long      *) 0x4008605C)
#define          ADCDAT24                                   (*(volatile unsigned long      *) 0x40086060)
#define          ADCDAT25                                   (*(volatile unsigned long      *) 0x40086064)
#define          ADCDAT26                                   (*(volatile unsigned long      *) 0x40086068)
#define          ADCDAT27                                   (*(volatile unsigned long      *) 0x4008606C)
#define          ADCCHA                                     (*(volatile unsigned short int *) 0x40086080)
#define          ADCSEQ                                     (*(volatile unsigned long      *) 0x40086088)
#define          ADCSEQC                                    (*(volatile unsigned long      *) 0x4008608C)
#define          ADCGN                                      (*(volatile unsigned short int *) 0x40086090)
#define          ADCOF                                      (*(volatile unsigned short int *) 0x40086094)
#define          ADCCMP                                     (*(volatile unsigned long      *) 0x40086098)
#define          ADCCNVC                                    (*(volatile unsigned long      *) 0x4008609C)
#endif // (__NO_MMR_STRUCTS__==0)

