koshkin-sergey/mbOS/Examples/basic/arch/cortex-m/eval_aducm320/src/include/ADuCM320.h
/* Reset Value for ADCCON*/
#define ADCCON_RVAL                    0x280 

/* ADCCON[SOFT_RESET] - software reset ADC */
#define ADCCON_SOFT_RESET_MSK          (0x3F  << 10 )

/* ADCCON[PUP] - ADC power up */
#define ADCCON_PUP_BBA                 (*(volatile unsigned long *) 0x43042EA4)
#define ADCCON_PUP_MSK                 (0x1   << 9  )
#define ADCCON_PUP                     (0x1   << 9  )

/* ADCCON[REFB_PUP] - ADC reference buffer power up */
#define ADCCON_REFB_PUP_BBA            (*(volatile unsigned long *) 0x43042E9C)
#define ADCCON_REFB_PUP_MSK            (0x1   << 7  )
#define ADCCON_REFB_PUP                (0x1   << 7  )

/* ADCCON[Restart_ADC] - Restart ADC, reset Analog Part of ADC */
#define ADCCON_Restart_ADC_BBA         (*(volatile unsigned long *) 0x43042E98)
#define ADCCON_Restart_ADC_MSK         (0x1   << 6  )
#define ADCCON_Restart_ADC             (0x1   << 6  )

/* ADCCON[SEQ_DMA] - DMA request enable for ADC sequence conversion */
#define ADCCON_SEQ_DMA_BBA             (*(volatile unsigned long *) 0x43042E90)
#define ADCCON_SEQ_DMA_MSK             (0x1   << 4  )
#define ADCCON_SEQ_DMA                 (0x1   << 4  )

/* ADCCON[CNV_DMA] - DMA request enable for ADC non-sequence conversion */
#define ADCCON_CNV_DMA_BBA             (*(volatile unsigned long *) 0x43042E8C)
#define ADCCON_CNV_DMA_MSK             (0x1   << 3  )
#define ADCCON_CNV_DMA                 (0x1   << 3  )

/* ADCCON[C_TYPE] - ADC conversion type */
#define ADCCON_C_TYPE_MSK              (0x7   << 0  )
#define ADCCON_C_TYPE_NO               (0x0   << 0  ) /* No conversion            */
#define ADCCON_C_TYPE_DIO              (0x1   << 0  ) /* DIO pin starts conversion (P2.4) */
#define ADCCON_C_TYPE_SINGLE           (0x2   << 0  ) /* Single conversion        */
#define ADCCON_C_TYPE_CONT             (0x3   << 0  ) /* Continuous conversion (use this mode for the sequencer) */
#define ADCCON_C_TYPE_PLA              (0x4   << 0  ) /* PLA conversion           */

/* Reset Value for ADCDAT*/
#define ADCDAT_RVAL                    0x0 

/* ADCDAT[DAT] - ADCx data */
#define ADCDAT_DAT_MSK                 (0xFFFFFFF << 4  )

/* ADCDAT[VALID] - Flag indicating if data is valid. */
#define ADCDAT_VALID_BBA               (*(volatile unsigned long *) 0x430C000C)
#define ADCDAT_VALID_MSK               (0x1   << 3  )
#define ADCDAT_VALID                   (0x1   << 3  )
#define ADCDAT_VALID_CLR               (0x0   << 3  ) /* Data is Invalid          */
#define ADCDAT_VALID_SET               (0x1   << 3  ) /* Data is Valid            */

/* ADCDAT[OLD] - Flag data has already been read. */
#define ADCDAT_OLD_BBA                 (*(volatile unsigned long *) 0x430C0008)
#define ADCDAT_OLD_MSK                 (0x1   << 2  )
#define ADCDAT_OLD                     (0x1   << 2  )
#define ADCDAT_OLD_CLR                 (0x0   << 2  ) /* Last data has not been read */
#define ADCDAT_OLD_SET                 (0x1   << 2  ) /* Last data already read   */

/* Reset Value for ADCCHA*/
#define ADCCHA_RVAL                    0x111F 

/* ADCCHA[ADCCN] - Selects channel for ADC negative input */
#define ADCCHA_ADCCN_MSK               (0x1F  << 8  )
#define ADCCHA_ADCCN_AIN0              (0x0   << 8  ) /* AIN0                     */
#define ADCCHA_ADCCN_AIN1              (0x1   << 8  ) /* AIN1                     */
#define ADCCHA_ADCCN_AIN2              (0x2   << 8  ) /* AIN2                     */
#define ADCCHA_ADCCN_AIN3              (0x3   << 8  ) /* AIN3                     */
#define ADCCHA_ADCCN_AIN4              (0x4   << 8  ) /* AIN4                     */
#define ADCCHA_ADCCN_AIN5              (0x5   << 8  ) /* AIN5                     */
#define ADCCHA_ADCCN_AIN6              (0x6   << 8  ) /* AIN6                     */
#define ADCCHA_ADCCN_AIN7              (0x7   << 8  ) /* AIN7                     */
#define ADCCHA_ADCCN_AIN8              (0x8   << 8  ) /* AIN8                     */
#define ADCCHA_ADCCN_AIN9              (0x9   << 8  ) /* AIN9                     */
#define ADCCHA_ADCCN_AIN10             (0xA   << 8  ) /* AIN10                    */
#define ADCCHA_ADCCN_AIN11             (0xB   << 8  ) /* AIN11                    */
#define ADCCHA_ADCCN_AIN12             (0xC   << 8  ) /* AIN12                    */
#define ADCCHA_ADCCN_AIN13             (0xD   << 8  ) /* AIN13                    */
#define ADCCHA_ADCCN_AIN14             (0xE   << 8  ) /* AIN14                    */
#define ADCCHA_ADCCN_AIN15             (0xF   << 8  ) /* AIN15                    */
#define ADCCHA_ADCCN_VREFP_NADC        (0x10  << 8  ) /* VREFP_NADC: Connect ADC_REFP to negative input. */
#define ADCCHA_ADCCN_VREFN_NADC        (0x11  << 8  ) /* VREFN_NADC: Connect ADC_REFN to negative input. Use This setting for single ended measurements. */
#define ADCCHA_ADCCN_AGND              (0x12  << 8  ) /* AGND                     */
#define ADCCHA_ADCCN_PGND              (0x13  << 8  ) /* PGND                     */

/* ADCCHA[ADCCP] - Select ADC channel */
#define ADCCHA_ADCCP_MSK               (0x1F  << 0  )
#define ADCCHA_ADCCP_AIN0              (0x0   << 0  ) /* AIN0                     */
#define ADCCHA_ADCCP_AIN1              (0x1   << 0  ) /* AIN1                     */
#define ADCCHA_ADCCP_AIN2              (0x2   << 0  ) /* AIN2                     */
#define ADCCHA_ADCCP_AIN3              (0x3   << 0  ) /* AIN3                     */
#define ADCCHA_ADCCP_AIN4              (0x4   << 0  ) /* AIN4                     */
#define ADCCHA_ADCCP_AIN5              (0x5   << 0  ) /* AIN5                     */
#define ADCCHA_ADCCP_AIN6              (0x6   << 0  ) /* AIN6                     */
#define ADCCHA_ADCCP_AIN7              (0x7   << 0  ) /* AIN7                     */
#define ADCCHA_ADCCP_AIN8              (0x8   << 0  ) /* AIN8                     */
#define ADCCHA_ADCCP_AIN9              (0x9   << 0  ) /* AIN9                     */
#define ADCCHA_ADCCP_AIN10             (0xA   << 0  ) /* AIN10                    */
#define ADCCHA_ADCCP_AIN11             (0xB   << 0  ) /* AIN11                    */
#define ADCCHA_ADCCP_AIN12             (0xC   << 0  ) /* AIN12                    */
#define ADCCHA_ADCCP_AIN13             (0xD   << 0  ) /* AIN13                    */
#define ADCCHA_ADCCP_AIN14             (0xE   << 0  ) /* AIN14                    */
#define ADCCHA_ADCCP_AIN15             (0xF   << 0  ) /* AIN15                    */
#define ADCCHA_ADCCP_TEMP_SENSOR       (0x16  << 0  ) /* TEMP_SENSOR              */
#define ADCCHA_ADCCP_VREFP_PADC        (0x17  << 0  ) /* VREFP_PADC: Connect ADC_REFP to positive input. Note: This pin should not be measured relative to AGND. This selection is intended for measuring the differential voltage between the negative input and ADC_REFP. */
#define ADCCHA_ADCCP_PVDD_IDAC2        (0x18  << 0  ) /* PVDD_IDAC2: Use this to measure the PVDD supply voltage for IDAC2 */
#define ADCCHA_ADCCP_IOVDD_2           (0x19  << 0  ) /* IOVDD_2: Use this to measure half of the IOVDD supply voltage */
#define ADCCHA_ADCCP_AVDD_2            (0x1A  << 0  ) /* AVDD_2: Use this to measure half of the AVDD supply voltage. */
#define ADCCHA_ADCCP_VREFN_PADC        (0x1B  << 0  ) /* VREFN_PADC: Connect ADC_REFN to positive input. */

/* Reset Value for ADCSEQ*/
#define ADCSEQ_RVAL                    0x0 

/* ADCSEQ[ST] - Sequence restart, used to force sequence to start at first channel when sequence is working */
#define ADCSEQ_ST_BBA                  (*(volatile unsigned long *) 0x430C117C)
#define ADCSEQ_ST_MSK                  (0x1   << 31 )
#define ADCSEQ_ST                      (0x1   << 31 )

/* ADCSEQ[EN] - Sequence enable */
#define ADCSEQ_EN_BBA                  (*(volatile unsigned long *) 0x430C1178)
#define ADCSEQ_EN_MSK                  (0x1   << 30 )
#define ADCSEQ_EN                      (0x1   << 30 )

/* ADCSEQ[CH] - Select channels included in sequence operation. */
#define ADCSEQ_CH_MSK                  (0x1FFFFFFF << 0  )

