koshkin-sergey/mbOS/Examples/basic/arch/cortex-m/eval_aducm320/src/include/ADuCM320.h
/* Reset Value for ADCSEQC*/
#define ADCSEQC_RVAL                   0x8C631 

/* ADCSEQC[T] - Define programmable delay of 0 to 254 between sequences. A delay 255 will cause a halt after one sequence. */
#define ADCSEQC_T_MSK                  (0xFF  << 20 )

/* ADCSEQC[DIF6] - Selects differential mode negative input for AIN6 in the sequence. */
#define ADCSEQC_DIF6_MSK               (0x1F  << 15 )

/* ADCSEQC[DIF4] - Selects differential mode negative input for AIN4 in the sequence. */
#define ADCSEQC_DIF4_MSK               (0x1F  << 10 )

/* ADCSEQC[DIF2] - Selects differential mode negative input for AIN2 in the sequence. */
#define ADCSEQC_DIF2_MSK               (0x1F  << 5  )

/* ADCSEQC[DIF0] - Selects differential mode negative input for AIN0 in the sequence. */
#define ADCSEQC_DIF0_MSK               (0x1F  << 0  )

/* Reset Value for ADCGN*/
#define ADCGN_RVAL                     0x2000 

/* ADCGN[GN] - User gain register */
#define ADCGN_GN_MSK                   (0x3FFF << 0  )

/* Reset Value for ADCOF*/
#define ADCOF_RVAL                     0x2000 

/* ADCOF[OF] - User offset register */
#define ADCOF_OF_MSK                   (0x3FFF << 0  )

/* Reset Value for ADCCMP*/
#define ADCCMP_RVAL                    0x0 

/* ADCCMP[THR] - Digital compare threshold */
#define ADCCMP_THR_MSK                 (0xFFFF << 2  )

/* ADCCMP[DIR] - Select digital comparator direction */
#define ADCCMP_DIR_BBA                 (*(volatile unsigned long *) 0x430C1304)
#define ADCCMP_DIR_MSK                 (0x1   << 1  )
#define ADCCMP_DIR                     (0x1   << 1  )
#define ADCCMP_DIR_DIS                 (0x0   << 1  ) /* ADCTH less than channel 4 data */
#define ADCCMP_DIR_EN                  (0x1   << 1  ) /* ADCTH larger than channel 4 data */

/* ADCCMP[EN] - Digital comparator enable */
#define ADCCMP_EN_BBA                  (*(volatile unsigned long *) 0x430C1300)
#define ADCCMP_EN_MSK                  (0x1   << 0  )
#define ADCCMP_EN                      (0x1   << 0  )
#define ADCCMP_EN_DIS                  (0x0   << 0  ) /* Disable                  */
#define ADCCMP_EN_EN                   (0x1   << 0  ) /* Enable                   */

/* Reset Value for ADCCNVC*/
#define ADCCNVC_RVAL                   0xA00C8 

/* ADCCNVC[CNVD] - Configure ADC Acquisition time and sampling time */
#define ADCCNVC_CNVD_MSK               (0x3FF << 16 )

/* ADCCNVC[CNVC] - Configure Conversion frequency */
#define ADCCNVC_CNVC_MSK               (0x3FF << 0  )
// ------------------------------------------------------------------------------------------------
// -----                                        VDAC                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief VDAC (pADI_VDAC0)
  */

#if (__NO_MMR_STRUCTS__==0)
typedef struct {                            /*!< pADI_VDAC0 Structure                   */
  __IO uint16_t  DACCON;                    /*!< DAC0 control register                 */
  __I  uint16_t  RESERVED0[8193];
  __IO uint32_t  DACDAT;                    /*!< DAC0 data register                    */
} ADI_VDAC_TypeDef;
#else // (__NO_MMR_STRUCTS__==0)
#define          DAC0CON                                    (*(volatile unsigned short int *) 0x40082400)
#define          DAC0DAT                                    (*(volatile unsigned long      *) 0x40086404)
#endif // (__NO_MMR_STRUCTS__==0)

/* Reset Value for DAC0CON*/
#define DAC0CON_RVAL                   0x100 

/* DAC0CON[PD] - DAC0 power down */
#define DAC0CON_PD_BBA                 (*(volatile unsigned long *) 0x43048020)
#define DAC0CON_PD_MSK                 (0x1   << 8  )
#define DAC0CON_PD                     (0x1   << 8  )

/* DAC0CON[EN] - DAC0 enable */
#define DAC0CON_EN_BBA                 (*(volatile unsigned long *) 0x43048010)
#define DAC0CON_EN_MSK                 (0x1   << 4  )
#define DAC0CON_EN                     (0x1   << 4  )

/* DAC0CON[RN] - DAC0 reference selection */
#define DAC0CON_RN_MSK                 (0x3   << 0  )

/* Reset Value for DAC0DAT*/
#define DAC0DAT_RVAL                   0x0 

/* DAC0DAT[DAT] - DAC0 data */
#define DAC0DAT_DAT_MSK                (0xFFF << 16 )
#if (__NO_MMR_STRUCTS__==1)

#define          DAC1CON                                    (*(volatile unsigned short int *) 0x40082404)
#define          DAC1DAT                                    (*(volatile unsigned long      *) 0x40086408)
#endif // (__NO_MMR_STRUCTS__==1)

/* Reset Value for DAC1CON*/
#define DAC1CON_RVAL                   0x100 

/* DAC1CON[PD] - DAC1 power down */
#define DAC1CON_PD_BBA                 (*(volatile unsigned long *) 0x430480A0)
#define DAC1CON_PD_MSK                 (0x1   << 8  )
#define DAC1CON_PD                     (0x1   << 8  )

/* DAC1CON[EN] - DAC1 enable */
#define DAC1CON_EN_BBA                 (*(volatile unsigned long *) 0x43048090)
#define DAC1CON_EN_MSK                 (0x1   << 4  )
#define DAC1CON_EN                     (0x1   << 4  )

/* DAC1CON[RN] - DAC1 reference selection */
#define DAC1CON_RN_MSK                 (0x3   << 0  )

/* Reset Value for DAC1DAT*/
#define DAC1DAT_RVAL                   0x0 

/* DAC1DAT[DAT] - DAC1 data */
#define DAC1DAT_DAT_MSK                (0xFFF << 16 )
#if (__NO_MMR_STRUCTS__==1)

#define          DAC2CON                                    (*(volatile unsigned short int *) 0x40082408)
#define          DAC2DAT                                    (*(volatile unsigned long      *) 0x4008640C)
#endif // (__NO_MMR_STRUCTS__==1)

/* Reset Value for DAC2CON*/
#define DAC2CON_RVAL                   0x100 

/* DAC2CON[PD] - DAC2 power down */
#define DAC2CON_PD_BBA                 (*(volatile unsigned long *) 0x43048120)
#define DAC2CON_PD_MSK                 (0x1   << 8  )
#define DAC2CON_PD                     (0x1   << 8  )

/* DAC2CON[EN] - DAC2 enable */
#define DAC2CON_EN_BBA                 (*(volatile unsigned long *) 0x43048110)
#define DAC2CON_EN_MSK                 (0x1   << 4  )
#define DAC2CON_EN                     (0x1   << 4  )

