koshkin-sergey/mbOS/Examples/basic/arch/cortex-m/eval_aducm320/src/include/ADuCM320.h
/* DAC2CON[RN] - DAC2 reference selection */
#define DAC2CON_RN_MSK                 (0x3   << 0  )

/* Reset Value for DAC2DAT*/
#define DAC2DAT_RVAL                   0x0 

/* DAC2DAT[DAT] - DAC2 data */
#define DAC2DAT_DAT_MSK                (0xFFF << 16 )
#if (__NO_MMR_STRUCTS__==1)

#define          DAC3CON                                    (*(volatile unsigned short int *) 0x4008240C)
#define          DAC3DAT                                    (*(volatile unsigned long      *) 0x40086410)
#endif // (__NO_MMR_STRUCTS__==1)

/* Reset Value for DAC3CON*/
#define DAC3CON_RVAL                   0x100 

/* DAC3CON[PD] - DAC3 power down */
#define DAC3CON_PD_BBA                 (*(volatile unsigned long *) 0x430481A0)
#define DAC3CON_PD_MSK                 (0x1   << 8  )
#define DAC3CON_PD                     (0x1   << 8  )

/* DAC3CON[EN] - DAC3 enable */
#define DAC3CON_EN_BBA                 (*(volatile unsigned long *) 0x43048190)
#define DAC3CON_EN_MSK                 (0x1   << 4  )
#define DAC3CON_EN                     (0x1   << 4  )

/* DAC3CON[RN] - DAC3 reference selection */
#define DAC3CON_RN_MSK                 (0x3   << 0  )

/* Reset Value for DAC3DAT*/
#define DAC3DAT_RVAL                   0x0 

/* DAC3DAT[DAT] - DAC3 data */
#define DAC3DAT_DAT_MSK                (0xFFF << 16 )
#if (__NO_MMR_STRUCTS__==1)

#define          DAC4CON                                    (*(volatile unsigned short int *) 0x40082410)
#define          DAC4DAT                                    (*(volatile unsigned long      *) 0x40086414)
#endif // (__NO_MMR_STRUCTS__==1)

/* Reset Value for DAC4CON*/
#define DAC4CON_RVAL                   0x100 

/* DAC4CON[PD] - DAC4 power down */
#define DAC4CON_PD_BBA                 (*(volatile unsigned long *) 0x43048220)
#define DAC4CON_PD_MSK                 (0x1   << 8  )
#define DAC4CON_PD                     (0x1   << 8  )

/* DAC4CON[EN] - DAC4 enable */
#define DAC4CON_EN_BBA                 (*(volatile unsigned long *) 0x43048210)
#define DAC4CON_EN_MSK                 (0x1   << 4  )
#define DAC4CON_EN                     (0x1   << 4  )

/* DAC4CON[RN] - DAC4 reference selection */
#define DAC4CON_RN_MSK                 (0x3   << 0  )

/* Reset Value for DAC4DAT*/
#define DAC4DAT_RVAL                   0x0 

/* DAC4DAT[DAT] - DAC4 data */
#define DAC4DAT_DAT_MSK                (0xFFF << 16 )
#if (__NO_MMR_STRUCTS__==1)

#define          DAC5CON                                    (*(volatile unsigned short int *) 0x40082414)
#define          DAC5DAT                                    (*(volatile unsigned long      *) 0x40086418)
#endif // (__NO_MMR_STRUCTS__==1)

/* Reset Value for DAC5CON*/
#define DAC5CON_RVAL                   0x100 

/* DAC5CON[PD] - DAC5 power down */
#define DAC5CON_PD_BBA                 (*(volatile unsigned long *) 0x430482A0)
#define DAC5CON_PD_MSK                 (0x1   << 8  )
#define DAC5CON_PD                     (0x1   << 8  )

/* DAC5CON[EN] - DAC5 enable */
#define DAC5CON_EN_BBA                 (*(volatile unsigned long *) 0x43048290)
#define DAC5CON_EN_MSK                 (0x1   << 4  )
#define DAC5CON_EN                     (0x1   << 4  )

/* DAC5CON[RN] - DAC5 reference selection */
#define DAC5CON_RN_MSK                 (0x3   << 0  )

/* Reset Value for DAC5DAT*/
#define DAC5DAT_RVAL                   0x0 

/* DAC5DAT[DAT] - DAC5 data */
#define DAC5DAT_DAT_MSK                (0xFFF << 16 )
#if (__NO_MMR_STRUCTS__==1)

#define          DAC6CON                                    (*(volatile unsigned short int *) 0x40082418)
#define          DAC6DAT                                    (*(volatile unsigned long      *) 0x4008641C)
#endif // (__NO_MMR_STRUCTS__==1)

/* Reset Value for DAC6CON*/
#define DAC6CON_RVAL                   0x100 

/* DAC6CON[PD] - DAC6 power down */
#define DAC6CON_PD_BBA                 (*(volatile unsigned long *) 0x43048320)
#define DAC6CON_PD_MSK                 (0x1   << 8  )
#define DAC6CON_PD                     (0x1   << 8  )

/* DAC6CON[EN] - DAC6 enable */
#define DAC6CON_EN_BBA                 (*(volatile unsigned long *) 0x43048310)
#define DAC6CON_EN_MSK                 (0x1   << 4  )
#define DAC6CON_EN                     (0x1   << 4  )

/* DAC6CON[RN] - DAC6 reference selection */
#define DAC6CON_RN_MSK                 (0x3   << 0  )

/* Reset Value for DAC6DAT*/
#define DAC6DAT_RVAL                   0x0 

/* DAC6DAT[DAT] - DAC6 data */
#define DAC6DAT_DAT_MSK                (0xFFF << 16 )
#if (__NO_MMR_STRUCTS__==1)

#define          DAC7CON                                    (*(volatile unsigned short int *) 0x4008241C)
#define          DAC7DAT                                    (*(volatile unsigned long      *) 0x40086420)
#endif // (__NO_MMR_STRUCTS__==1)

/* Reset Value for DAC7CON*/
#define DAC7CON_RVAL                   0x100 

/* DAC7CON[PD] - DAC7 power down */
#define DAC7CON_PD_BBA                 (*(volatile unsigned long *) 0x430483A0)
#define DAC7CON_PD_MSK                 (0x1   << 8  )
#define DAC7CON_PD                     (0x1   << 8  )

/* DAC7CON[EN] - DAC7 enable */
#define DAC7CON_EN_BBA                 (*(volatile unsigned long *) 0x43048390)
#define DAC7CON_EN_MSK                 (0x1   << 4  )
#define DAC7CON_EN                     (0x1   << 4  )

/* DAC7CON[RN] - DAC7 reference selection */
#define DAC7CON_RN_MSK                 (0x3   << 0  )

/* Reset Value for DAC7DAT*/
#define DAC7DAT_RVAL                   0x0 

/* DAC7DAT[DAT] - DAC7 data */
#define DAC7DAT_DAT_MSK                (0xFFF << 16 )
// ------------------------------------------------------------------------------------------------
// -----                                        InBuf                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief InBuf (pADI_InBuf)
  */

#if (__NO_MMR_STRUCTS__==0)
typedef struct {                            /*!< pADI_InBuf Structure                   */
  __IO uint16_t  IBUFCON;                   /*!< InBuf control register                */
} ADI_InBuf_TypeDef;
#else // (__NO_MMR_STRUCTS__==0)
#define          IBUFCON                                    (*(volatile unsigned short int *) 0x40081400)
#endif // (__NO_MMR_STRUCTS__==0)

