koshkin-sergey/mbOS/Examples/basic/arch/cortex-m/eval_aducm320/src/include/ADuCM320.h
/* INTSEL[SEL_ACOMP_1] - Write 1 to this bit to enable analog comparator interrupt for interrupt pin 1 */
#define INTSEL_SEL_ACOMP_1_BBA         (*(volatile unsigned long *) 0x4306010C)
#define INTSEL_SEL_ACOMP_1_MSK         (0x1   << 3  )
#define INTSEL_SEL_ACOMP_1             (0x1   << 3  )
#define INTSEL_SEL_ACOMP_1_DIS         (0x0   << 3  )
#define INTSEL_SEL_ACOMP_1_EN          (0x1   << 3  )

/* INTSEL[SEL_DCOMP_1] - Write 1 to this bit to enable digital comparator interrupt for interrupt pin 1 */
#define INTSEL_SEL_DCOMP_1_BBA         (*(volatile unsigned long *) 0x43060108)
#define INTSEL_SEL_DCOMP_1_MSK         (0x1   << 2  )
#define INTSEL_SEL_DCOMP_1             (0x1   << 2  )
#define INTSEL_SEL_DCOMP_1_DIS         (0x0   << 2  )
#define INTSEL_SEL_DCOMP_1_EN          (0x1   << 2  )

/* INTSEL[SEL_ADC_SEQ_1] - Write 1 to this bit to enable ADC sequence conversion interrupt for interrupt pin 1 */
#define INTSEL_SEL_ADC_SEQ_1_BBA       (*(volatile unsigned long *) 0x43060104)
#define INTSEL_SEL_ADC_SEQ_1_MSK       (0x1   << 1  )
#define INTSEL_SEL_ADC_SEQ_1           (0x1   << 1  )
#define INTSEL_SEL_ADC_SEQ_1_DIS       (0x0   << 1  )
#define INTSEL_SEL_ADC_SEQ_1_EN        (0x1   << 1  )

/* INTSEL[SEL_ADC_SOFTCONV_1] - Write 1 to this bit to enable ADC software conversion interrupt for interrupt pin 1 */
#define INTSEL_SEL_ADC_SOFTCONV_1_BBA  (*(volatile unsigned long *) 0x43060100)
#define INTSEL_SEL_ADC_SOFTCONV_1_MSK  (0x1   << 0  )
#define INTSEL_SEL_ADC_SOFTCONV_1      (0x1   << 0  )
#define INTSEL_SEL_ADC_SOFTCONV_1_DIS  (0x0   << 0  )
#define INTSEL_SEL_ADC_SOFTCONV_1_EN   (0x1   << 0  )

/* Reset Value for INTSTA*/
#define INTSTA_RVAL                    0x0 

/* INTSTA[WRECC_ERR] - Write data ECC error interrupt status */
#define INTSTA_WRECC_ERR_BBA           (*(volatile unsigned long *) 0x4306019C)
#define INTSTA_WRECC_ERR_MSK           (0x1   << 7  )
#define INTSTA_WRECC_ERR               (0x1   << 7  )
#define INTSTA_WRECC_ERR_CLR           (0x0   << 7  )
#define INTSTA_WRECC_ERR_SET           (0x1   << 7  )

/* INTSTA[RDECC_ERR] - Read data ECC error interrupt status */
#define INTSTA_RDECC_ERR_BBA           (*(volatile unsigned long *) 0x43060198)
#define INTSTA_RDECC_ERR_MSK           (0x1   << 6  )
#define INTSTA_RDECC_ERR               (0x1   << 6  )
#define INTSTA_RDECC_ERR_CLR           (0x0   << 6  )
#define INTSTA_RDECC_ERR_SET           (0x1   << 6  )

/* INTSTA[IDAC_EXTRESLOW] - IDAC EXTRESLOW interrupt status */
#define INTSTA_IDAC_EXTRESLOW_BBA      (*(volatile unsigned long *) 0x43060194)
#define INTSTA_IDAC_EXTRESLOW_MSK      (0x1   << 5  )
#define INTSTA_IDAC_EXTRESLOW          (0x1   << 5  )
#define INTSTA_IDAC_EXTRESLOW_CLR      (0x0   << 5  )
#define INTSTA_IDAC_EXTRESLOW_SET      (0x1   << 5  )

/* INTSTA[IDAC_TSHUT] - IDAC temperature TSHT interrupt status */
#define INTSTA_IDAC_TSHUT_BBA          (*(volatile unsigned long *) 0x43060190)
#define INTSTA_IDAC_TSHUT_MSK          (0x1   << 4  )
#define INTSTA_IDAC_TSHUT              (0x1   << 4  )
#define INTSTA_IDAC_TSHUT_CLR          (0x0   << 4  )
#define INTSTA_IDAC_TSHUT_SET          (0x1   << 4  )

/* INTSTA[ACOMP] - Analog comparator interrupt status */
#define INTSTA_ACOMP_BBA               (*(volatile unsigned long *) 0x4306018C)
#define INTSTA_ACOMP_MSK               (0x1   << 3  )
#define INTSTA_ACOMP                   (0x1   << 3  )
#define INTSTA_ACOMP_CLR               (0x0   << 3  )
#define INTSTA_ACOMP_SET               (0x1   << 3  )

/* INTSTA[DCOMP] - Digital comparator interrupt status */
#define INTSTA_DCOMP_BBA               (*(volatile unsigned long *) 0x43060188)
#define INTSTA_DCOMP_MSK               (0x1   << 2  )
#define INTSTA_DCOMP                   (0x1   << 2  )
#define INTSTA_DCOMP_CLR               (0x0   << 2  )
#define INTSTA_DCOMP_SET               (0x1   << 2  )

/* INTSTA[ADC_SEQ] - ADC sequence interrupt status */
#define INTSTA_ADC_SEQ_BBA             (*(volatile unsigned long *) 0x43060184)
#define INTSTA_ADC_SEQ_MSK             (0x1   << 1  )
#define INTSTA_ADC_SEQ                 (0x1   << 1  )
#define INTSTA_ADC_SEQ_CLR             (0x0   << 1  )
#define INTSTA_ADC_SEQ_SET             (0x1   << 1  )

/* INTSTA[ADC_SOFTCONV] - ADC software conversion  interrupt status */
#define INTSTA_ADC_SOFTCONV_BBA        (*(volatile unsigned long *) 0x43060180)
#define INTSTA_ADC_SOFTCONV_MSK        (0x1   << 0  )
#define INTSTA_ADC_SOFTCONV            (0x1   << 0  )
#define INTSTA_ADC_SOFTCONV_CLR        (0x0   << 0  )
#define INTSTA_ADC_SOFTCONV_SET        (0x1   << 0  )
// ------------------------------------------------------------------------------------------------
// -----                                        IDAC                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief IDAC (pADI_IDAC0)
  */

#if (__NO_MMR_STRUCTS__==0)
typedef struct {                            /*!< pADI_IDAC0 Structure                   */
  __IO uint32_t  IDACDAT;                   /*!< IDAC0 data register                   */
  __IO uint8_t   IDACCON;                   /*!< IDAC0 control register                */
} ADI_IDAC_TypeDef;
#else // (__NO_MMR_STRUCTS__==0)
#define          IDAC0DAT                                   (*(volatile unsigned long      *) 0x40086800)
#define          IDAC0CON                                   (*(volatile unsigned char      *) 0x40086804)
#endif // (__NO_MMR_STRUCTS__==0)

/* Reset Value for IDAC0DAT*/
#define IDAC0DAT_RVAL                  0x0 

/* IDAC0DAT[DATH] - IDAC0 high data */
#define IDAC0DAT_DATH_MSK              (0x7FF << 17 )

/* IDAC0DAT[DATL] - IDAC0 low data */
#define IDAC0DAT_DATL_MSK              (0x1F  << 12 )

/* IDAC0DAT[SYNC] - IDAC0 sync bits */
#define IDAC0DAT_SYNC_MSK              (0x3F  << 0  )

/* Reset Value for IDAC0CON*/
#define IDAC0CON_RVAL                  0x1 

/* IDAC0CON[CLRB] - IDAC0 Clear bit */
#define IDAC0CON_CLRB_BBA              (*(volatile unsigned long *) 0x430D009C)
#define IDAC0CON_CLRB_MSK              (0x1   << 7  )
#define IDAC0CON_CLRB                  (0x1   << 7  )

/* IDAC0CON[SHT_EN] - IDAC0 shutdown enable */
#define IDAC0CON_SHT_EN_BBA            (*(volatile unsigned long *) 0x430D0098)
#define IDAC0CON_SHT_EN_MSK            (0x1   << 6  )
#define IDAC0CON_SHT_EN                (0x1   << 6  )

/* IDAC0CON[BW] - IDAC0 bandwidth */
#define IDAC0CON_BW_MSK                (0xF   << 2  )

/* IDAC0CON[PUL] - IDAC0 pull down */
#define IDAC0CON_PUL_BBA               (*(volatile unsigned long *) 0x430D0084)
#define IDAC0CON_PUL_MSK               (0x1   << 1  )
#define IDAC0CON_PUL                   (0x1   << 1  )

/* IDAC0CON[PD] - IDAC0 power down */
#define IDAC0CON_PD_BBA                (*(volatile unsigned long *) 0x430D0080)
#define IDAC0CON_PD_MSK                (0x1   << 0  )
#define IDAC0CON_PD                    (0x1   << 0  )
#define IDAC0CON_PD_ON                 (0x0   << 0  ) /* Powers IDAC0 up          */
#define IDAC0CON_PD_OFF                (0x1   << 0  ) /* Powers IDAC0 down        */
#if (__NO_MMR_STRUCTS__==1)

