koshkin-sergey/mbOS/Examples/basic/arch/cortex-m/eval_aducm320/src/include/ADuCM320.h
/* AFETEMPC[PD] - Temperature sensor power down. */
#define AFETEMPC_PD_BBA                (*(volatile unsigned long *) 0x430F0600)
#define AFETEMPC_PD_MSK                (0x1   << 0  )
#define AFETEMPC_PD                    (0x1   << 0  )
#define AFETEMPC_PD_DIS                (0x0   << 0  ) /* Power up temp sensor     */
#define AFETEMPC_PD_EN                 (0x1   << 0  ) /* Power down temp sensor   */

/* Reset Value for AFEREFC*/
#define AFEREFC_RVAL                   0x0 

/* AFEREFC[B2MA_PDA] - Power down the reference 2mA output driving buffer A. */
#define AFEREFC_B2MA_PDA_BBA           (*(volatile unsigned long *) 0x430F0698)
#define AFEREFC_B2MA_PDA_MSK           (0x1   << 6  )
#define AFEREFC_B2MA_PDA               (0x1   << 6  )
#define AFEREFC_B2MA_PDA_DIS           (0x0   << 6  ) /* Power up 2.5 V reference output driving buffer A */
#define AFEREFC_B2MA_PDA_EN            (0x1   << 6  ) /* Power down 2.5 V reference output driving buffer A */

/* AFEREFC[REF] - bypass the internal reference, and select the external reference. */
#define AFEREFC_REF_BBA                (*(volatile unsigned long *) 0x430F068C)
#define AFEREFC_REF_MSK                (0x1   << 3  )
#define AFEREFC_REF                    (0x1   << 3  )
#define AFEREFC_REF_INT                (0x0   << 3  ) /* Select internal 2.5v reference */
#define AFEREFC_REF_EXT                (0x1   << 3  ) /* Select external 2.5v reference */

/* AFEREFC[B2MA_PDB] - Power down the reference 2mA output driving buffer B. */
#define AFEREFC_B2MA_PDB_BBA           (*(volatile unsigned long *) 0x430F0688)
#define AFEREFC_B2MA_PDB_MSK           (0x1   << 2  )
#define AFEREFC_B2MA_PDB               (0x1   << 2  )
#define AFEREFC_B2MA_PDB_DIS           (0x0   << 2  ) /* Power up 2.5 V reference output driving buffer B */
#define AFEREFC_B2MA_PDB_EN            (0x1   << 2  ) /* Power down 2.5 V reference output driving buffer B */

/* AFEREFC[B2V5R_PD] - 2.5v reference buffer power down */
#define AFEREFC_B2V5R_PD_BBA           (*(volatile unsigned long *) 0x430F0684)
#define AFEREFC_B2V5R_PD_MSK           (0x1   << 1  )
#define AFEREFC_B2V5R_PD               (0x1   << 1  )
#define AFEREFC_B2V5R_PD_DIS           (0x0   << 1  ) /* Power up 2.5 V reference buffer */
#define AFEREFC_B2V5R_PD_EN            (0x1   << 1  ) /* Power down 2.5 V reference buffer */

/* AFEREFC[BG_PD] - Bandgap power down */
#define AFEREFC_BG_PD_BBA              (*(volatile unsigned long *) 0x430F0680)
#define AFEREFC_BG_PD_MSK              (0x1   << 0  )
#define AFEREFC_BG_PD                  (0x1   << 0  )
#define AFEREFC_BG_PD_DIS              (0x0   << 0  ) /* Power up 1.2 V bandgap   */
#define AFEREFC_BG_PD_EN               (0x1   << 0  ) /* Power down 1.2 V bandgap */

/* Reset Value for AFECOMP*/
#define AFECOMP_RVAL                   0x0 

/* AFECOMP[EN] - Powers up and enables comparator */
#define AFECOMP_EN_BBA                 (*(volatile unsigned long *) 0x430F0720)
#define AFECOMP_EN_MSK                 (0x1   << 8  )
#define AFECOMP_EN                     (0x1   << 8  )
#define AFECOMP_EN_DIS                 (0x0   << 8  ) /* Power down and disable comparator */
#define AFECOMP_EN_EN                  (0x1   << 8  ) /* Power up and enable comparator */

/* AFECOMP[INNEG] - Selects comparator negative input signal. */
#define AFECOMP_INNEG_MSK              (0x3   << 6  )
#define AFECOMP_INNEG_AVDD2            (0x0   << 6  ) /* AVDD/2                   */
#define AFECOMP_INNEG_AIN5             (0x1   << 6  ) /* AIN5                     */
#define AFECOMP_INNEG_DAC7             (0x2   << 6  ) /* DAC7                     */

/* AFECOMP[OUT] - Connects comparator output to interrupt logic. */
#define AFECOMP_OUT_MSK                (0x3   << 4  )
#define AFECOMP_OUT_DIS                (0x0   << 4  ) /* Do not connect output    */
#define AFECOMP_OUT_EN                 (0x1   << 4  ) /* Connect output to interrupt logic */

/* AFECOMP[INV] - Selects output logic state. */
#define AFECOMP_INV_BBA                (*(volatile unsigned long *) 0x430F070C)
#define AFECOMP_INV_MSK                (0x1   << 3  )
#define AFECOMP_INV                    (0x1   << 3  )
#define AFECOMP_INV_NO                 (0x0   << 3  ) /* Output will be high if +ve input is above -ve input. */
#define AFECOMP_INV_YES                (0x1   << 3  ) /* Output will be high if +ve input is below -ve input. */

/* AFECOMP[SPEED] - Selects comparator speed. */
#define AFECOMP_SPEED_MSK              (0x3   << 1  )
#define AFECOMP_SPEED_SPEED6           (0x0   << 1  ) /* 6.00us                   */
#define AFECOMP_SPEED_SPEED3           (0x1   << 1  ) /* 3.25us                   */
#define AFECOMP_SPEED_SPEED2           (0x2   << 1  ) /* 1.75us                   */
#define AFECOMP_SPEED_SPEED1           (0x3   << 1  ) /* 1.00us                   */

/* AFECOMP[HYS] - Enables comparator hysteresis */
#define AFECOMP_HYS_BBA                (*(volatile unsigned long *) 0x430F0700)
#define AFECOMP_HYS_MSK                (0x1   << 0  )
#define AFECOMP_HYS                    (0x1   << 0  )
#define AFECOMP_HYS_DIS                (0x0   << 0  ) /* Disable hysteresis       */
#define AFECOMP_HYS_EN                 (0x1   << 0  ) /* Enable  hysteresis       */
// ------------------------------------------------------------------------------------------------
// -----                                        nvic                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief nvic (pADI_nvic)
  */

#if (__NO_MMR_STRUCTS__==0)
#else // (__NO_MMR_STRUCTS__==0)
#define          ICTR                                       (*(volatile unsigned long      *) 0xE000E004)
#define          STCSR                                      (*(volatile unsigned long      *) 0xE000E010)
#define          STRVR                                      (*(volatile unsigned long      *) 0xE000E014)
#define          STCVR                                      (*(volatile unsigned long      *) 0xE000E018)
#define          STCR                                       (*(volatile unsigned long      *) 0xE000E01C)
#define          ISER0                                      (*(volatile unsigned long      *) 0xE000E100)
#define          ISER1                                      (*(volatile unsigned long      *) 0xE000E104)
#define          ICER0                                      (*(volatile unsigned long      *) 0xE000E180)
#define          ICER1                                      (*(volatile unsigned long      *) 0xE000E184)
#define          ISPR0                                      (*(volatile unsigned long      *) 0xE000E200)
#define          ISPR1                                      (*(volatile unsigned long      *) 0xE000E204)
#define          ICPR0                                      (*(volatile unsigned long      *) 0xE000E280)
#define          ICPR1                                      (*(volatile unsigned long      *) 0xE000E284)
#define          IABR0                                      (*(volatile unsigned long      *) 0xE000E300)
#define          IABR1                                      (*(volatile unsigned long      *) 0xE000E304)
#define          IPR0                                       (*(volatile unsigned long      *) 0xE000E400)
#define          IPR1                                       (*(volatile unsigned long      *) 0xE000E404)
#define          IPR2                                       (*(volatile unsigned long      *) 0xE000E408)
#define          IPR3                                       (*(volatile unsigned long      *) 0xE000E40C)
#define          IPR4                                       (*(volatile unsigned long      *) 0xE000E410)
#define          IPR5                                       (*(volatile unsigned long      *) 0xE000E414)
#define          IPR6                                       (*(volatile unsigned long      *) 0xE000E418)
#define          IPR7                                       (*(volatile unsigned long      *) 0xE000E41C)
#define          IPR8                                       (*(volatile unsigned long      *) 0xE000E420)
#define          IPR9                                       (*(volatile unsigned long      *) 0xE000E424)
#define          IPR10                                      (*(volatile unsigned long      *) 0xE000E428)
#define          IPR11                                      (*(volatile unsigned long      *) 0xE000E42C)
#define          IPR12                                      (*(volatile unsigned long      *) 0xE000E430)
#define          IPR13                                      (*(volatile unsigned long      *) 0xE000E434)
#define          CPUID                                      (*(volatile unsigned long      *) 0xE000ED00)
#define          ICSR                                       (*(volatile unsigned long      *) 0xE000ED04)
#define          VTOR                                       (*(volatile unsigned long      *) 0xE000ED08)
#define          AIRCR                                      (*(volatile unsigned long      *) 0xE000ED0C)
#define          SCR                                        (*(volatile unsigned short int *) 0xE000ED10)
#define          CCR                                        (*(volatile unsigned long      *) 0xE000ED14)
#define          SHPR1                                      (*(volatile unsigned long      *) 0xE000ED18)
#define          SHPR2                                      (*(volatile unsigned long      *) 0xE000ED1C)
#define          SHPR3                                      (*(volatile unsigned long      *) 0xE000ED20)
#define          SHCRS                                      (*(volatile unsigned long      *) 0xE000ED24)
#define          CFSR                                       (*(volatile unsigned long      *) 0xE000ED28)
#define          HFSR                                       (*(volatile unsigned long      *) 0xE000ED2C)
#define          MMAR                                       (*(volatile unsigned long      *) 0xE000ED34)
#define          BFAR                                       (*(volatile unsigned long      *) 0xE000ED38)
#define          AFSR                                       (*(volatile unsigned long      *) 0xE000ED3C)
#define          STIR                                       (*(volatile unsigned long      *) 0xE000EF00)
#endif // (__NO_MMR_STRUCTS__==0)

/* Reset Value for ICTR*/
#define ICTR_RVAL                      0x0 

/* Reset Value for STCSR*/
#define STCSR_RVAL                     0x0 

/* Reset Value for STRVR*/
#define STRVR_RVAL                     0x0 

/* Reset Value for STCVR*/
#define STCVR_RVAL                     0x0 

/* Reset Value for STCR*/
#define STCR_RVAL                      0x0 

