koshkin-sergey/mbOS/Examples/basic/arch/cortex-m/eval_aducm320/src/include/ADuCM320.h
#define pADI_TMR0                     ((ADI_TIMER_TypeDef              *)ADI_TMR0_ADDR)
#define pADI_TMR1                     ((ADI_TIMER_TypeDef              *)ADI_TMR1_ADDR)
#define pADI_TMR2                     ((ADI_TIMER_TypeDef              *)ADI_TMR2_ADDR)
#define pADI_ID                       ((ADI_ID_TypeDef                 *)ADI_ID_ADDR)
#define pADI_PWRCTL                   ((ADI_PWRCTL_TypeDef             *)ADI_PWRCTL_ADDR)
#define pADI_RESET                    ((ADI_RESET_TypeDef              *)ADI_RESET_ADDR)
#define pADI_INTERRUPT                ((ADI_INTERRUPT_TypeDef          *)ADI_INTERRUPT_ADDR)
#define pADI_WDT                      ((ADI_WDT_TypeDef                *)ADI_WDT_ADDR)
#define pADI_WUT                      ((ADI_WUT_TypeDef                *)ADI_WUT_ADDR)
#define pADI_I2C0                     ((ADI_I2C_TypeDef                *)ADI_I2C0_ADDR)
#define pADI_I2C1                     ((ADI_I2C_TypeDef                *)ADI_I2C1_ADDR)
#define pADI_UART                     ((ADI_UART_TypeDef               *)ADI_UART_ADDR)
#define pADI_MDIO                     ((ADI_MDIO_TypeDef               *)ADI_MDIO_ADDR)
#define pADI_PLA                      ((ADI_PLA_TypeDef                *)ADI_PLA_ADDR)
#define pADI_DMA                      ((ADI_DMA_TypeDef                *)ADI_DMA_ADDR)
#define pADI_FEE                      ((ADI_FEE_TypeDef                *)ADI_FEE_ADDR)
#define pADI_GP0                      ((ADI_GPIO_TypeDef               *)ADI_GP0_ADDR)
#define pADI_GP1                      ((ADI_GPIO_TypeDef               *)ADI_GP1_ADDR)
#define pADI_GPIO_FIX                 ((ADI_GPIO_FIX_TypeDef           *)ADI_GPIO_FIX_ADDR)
#define pADI_GP2                      ((ADI_GPIO_TypeDef               *)ADI_GP2_ADDR)
#define pADI_GP3                      ((ADI_GPIO_TypeDef               *)ADI_GP3_ADDR)
#define pADI_GP4                      ((ADI_GPIO_TypeDef               *)ADI_GP4_ADDR)
#define pADI_GP5                      ((ADI_GPIO_TypeDef               *)ADI_GP5_ADDR)
#define pADI_PWM                      ((ADI_PWM_TypeDef                *)ADI_PWM_ADDR)
#define pADI_CLKCTL                   ((ADI_CLKCTL_TypeDef             *)ADI_CLKCTL_ADDR)
#define pADI_dma_ctl                  ((ADI_dma_ctl_TypeDef            *)ADI_dma_ctl_ADDR)
#define pADI_SPI0                     ((ADI_SPI_TypeDef                *)ADI_SPI0_ADDR)
#define pADI_SPI1                     ((ADI_SPI_TypeDef                *)ADI_SPI1_ADDR)
#define pADI_ADC                      ((ADI_ADC_TypeDef                *)ADI_ADC_ADDR)
#define pADI_VDAC0                    ((ADI_VDAC_TypeDef               *)ADI_VDAC0_ADDR)
#define pADI_VDAC1                    ((ADI_VDAC_TypeDef               *)ADI_VDAC1_ADDR)
#define pADI_VDAC2                    ((ADI_VDAC_TypeDef               *)ADI_VDAC2_ADDR)
#define pADI_VDAC3                    ((ADI_VDAC_TypeDef               *)ADI_VDAC3_ADDR)
#define pADI_VDAC4                    ((ADI_VDAC_TypeDef               *)ADI_VDAC4_ADDR)
#define pADI_VDAC5                    ((ADI_VDAC_TypeDef               *)ADI_VDAC5_ADDR)
#define pADI_VDAC6                    ((ADI_VDAC_TypeDef               *)ADI_VDAC6_ADDR)
#define pADI_VDAC7                    ((ADI_VDAC_TypeDef               *)ADI_VDAC7_ADDR)
#define pADI_InBuf                    ((ADI_InBuf_TypeDef              *)ADI_InBuf_ADDR)
#define pADI_LV                       ((ADI_LV_TypeDef                 *)ADI_LV_ADDR)
#define pADI_LV_RST                   ((ADI_LV_RST_TypeDef             *)ADI_LV_RST_ADDR)
#define pADI_LV_INT                   ((ADI_LV_INT_TypeDef             *)ADI_LV_INT_ADDR)
#define pADI_IDAC0                    ((ADI_IDAC_TypeDef               *)ADI_IDAC0_ADDR)
#define pADI_IDAC1                    ((ADI_IDAC_TypeDef               *)ADI_IDAC1_ADDR)
#define pADI_IDAC2                    ((ADI_IDAC_TypeDef               *)ADI_IDAC2_ADDR)
#define pADI_IDAC3                    ((ADI_IDAC_TypeDef               *)ADI_IDAC3_ADDR)
#define pADI_AFE                      ((ADI_AFE_TypeDef                *)ADI_AFE_ADDR)

/** @} */ /* End of group Device_Peripheral_Registers */
/** @} */ /* End of group ADUCM320 */
/** @} */ /* End of group CMSIS */

#ifdef __cplusplus
}
#endif 


#endif  // __ADUCM320_H__

